{
  "cutscenes": {
    "assistant-firecanyon-resolution": [
      "GEWELDIG! JE HEBT DE 20 CELLEN DIE NODIG ZIJN VOOR MIJN HITTESCHILD!",
      "WEES NU VOORZICHTIG, HET SCHILD BESCHERMT ALLEEN JE ZOOMER",
      "TOT HET 500 GRADEN BEREIKT, DUS PROBEER HAAR KOEL TE HOUDEN.",
      "VLIEGEN OVER OPEN LAVA ZAL JE ZEKER SNEL OPWARMEN.",
      "ALS HET 500 GRADEN WORDT, IS HET VOORBIJ.",
      "VOORBIJ?! ALS IN BRANDEND GESMOLTEN METAAL VOORBIJ?!",
      "DE VUURVALLEI WORDT BEHOORLIJK HEET, DUS KIJK UIT VOOR SCHANSEN",
      "OM JE VAN DE HETE GROND TE HOUDEN.",
      "IK HEB OOK EEN AANTAL BLAUWE KOELBALLONNEN UITGEBRACHT DIE JE KUNT GEBRUIKEN OM",
      "DE TEMPERATUUR VAN HET SCHILD SNEL TE DOEN DALEN.",
      "OH! EN ALS JE AAN DE OVERKANT BENT, VERGEET DAN NIET OM",
      "DE TELEPORT-POORT IN HET LAB VAN DE BLAUWE WIJZE TE ACTIVEREN.",
      "DAN KUNNEN WE NAAR JOU TELEPORTEREN EN JE ONTMOETEN!",
      "VEEL SUCCES!"
    ],
    "assistant-introduction-blue-eco-switch": [
      "HEY SCHAT. WAT ZEG JE ERVAN ALS JIJ EN IK GAAN CRUISEN OP DEZE ANTI-ZWAARTEKRACHT ZOOMER?",
      "REGEL NUMMER ÉÉN: IK GA NIET UIT MET DIEREN.",
      "OH, JE WEET NIET WAT JE MIST.",
      "LUISTER, ALS JE IETS NODIG HEBT OM JE BEZIG TE HOUDEN, MIJN VADER SPRAK ALTIJD",
      "OVER EEN OUDE PRECURSOR PIJPLEIDING DIEP ONDER DE GROND VERBORGEN.",
      "SOMMIGE VAN DEZE PIJPEN EINDIGEN IN OPENINGEN WAARUIT ECO STROOMT,",
      "EN SOMMIGE ZIJN AFGEDEKT, ZODAT DE ECO IS AFGESLOTEN.",
      "MOET ER EEN MANIER ZIJN OM DE VENTILATIEOPENINGEN AAN TE ZETTEN.",
      "HEB IK EEN DEEL VAN DE PIJPLEIDING NAAR DE VERBODEN TEMPEL GETRACEERD.",
      "MISSCHIEN MOET JE DAAR KIJKEN VOOR EEN SOORT SCHAKELAAR."
    ],
    "assistant-introduction-race-bike": [
      "HÉ SCHATJE, WAAR WERK JE AAN?",
      "WEES VOORZICHTIG DAARMEE! IK PROBEER UIT TE ZOEKEN HOE IK DE ZOOMER KAN VERVOEREN",
      "MET DE TRANS-PADS DIE DE PRECURSORS OVER DE HELE WERELD HEBBEN ACHTERGELATEN.",
      "ALS JE EEN VAN DEZE PADS TEGENKOMT, KAN IK DE LOCATIE VAN JE COMMUNICATOR BEPALEN",
      "EN JE DE ZOOMER STUREN!",
      "KIJK UIT NAAR EEN TRANS-PAD WANNEER JE MISTY EILAND VERKENT, EN WAAR JE OOK HEEN GAAT!"
    ],
    "assistant-lavatube-end-resolution": [
      "HEY! WAAR IS DE OUDE KORTE, GROENE EN RIMPELIGE?",
      "DIT IS VERSCHRIKKELIJK! VADER WORDT VERMIST!",
      "IK DENK DAT GOL EN MAIA HEM OOK ONTVOERD HEBBEN!",
      "RELAX, LIEVERD. IK HEB ALLES ONDER CONTROLE.",
      "ONDER CONTROLE?!",
      "DE LEGERS VAN DE LURKERS BLIJVEN  DOOR HET LAND GROEIEN,",
      "DE WIJZEN ZIJN ONTVOERD,",
      "GOL EN MAIA HEBBEN GENOEG ECO VERZAMELD",
      "OM HUN VRESELIJKE PLAN TE VOLTOOIEN,",
      "EN OM ZE TE STOPPEN, ZUL JE",
      "JE WEG MOETEN VECHTEN DOOR HUN CITADEL!",
      "UH, JA. DAT VAT HET ONGEVEER SAMEN.",
      "JE MOET MIJN VADER REDDEN VOORDAT HET TE LAAT IS!",
      "NL HOE...",
      "WEES VOORZICHTIG.",
      "JA. DAT ZULLEN WE ZIJN!"
    ],
    "assistant-lavatube-start-resolution": [
      "HA HA! OK!",
      "MET DEZE EXTRA ENERGIECELLEN, ZOU IK IN STAAT MOETEN ZIJN OM HET HITTESCHILD",
      "MET GENOEG KRACHT OP TE LADEN OM DEZE LAVA TE WEERSTAAN.",
      "MAAR HET SCHILD HEEFT NOG STEEDS EEN LIMIET.",
      "HET IS NU BESTAND TEGEN TEMPERATUREN TOT 800 GRADEN, MAAR NIET MEER.",
      "DUS HOU JE METER IN DE GATEN.",
      "IK WIL ER NIET AAN DENKEN WAT DIE TEMPERATUREN MET JE ZOOMER ZOUDEN DOEN",
      "ALS HET SCHILD HET BEGEEFT.",
      "JA, DE HITTE...",
      "WAT? DE ZOOMER? HÉ! EN WIJ DAN?",
      "DENK JE NIET DAT WE EEN VEILIGER ROUTE KUNNEN ZOEKEN NAAR DE CITADEL VAN GOL?",
      "KIJK, IK HEB MEER KOELBALLONNEN IN DE BUIS GELATEN.",
      "ZODAT JE ZE KUNT GEBRUIKEN OM DE TEMPERATUUR LAAG TE HOUDEN.",
      "EN VERGEET NIET DE TELEPORT-POORT IN HET LAB VAN DE GELE WIJZE TE ACTIVEREN.",
      "WE REKENEN OP JE."
    ],
    "assistant-reminder-1-blue-eco-switch": [
      "IK WEET ZEKER DAT ALS JE IN DE VERBODEN PRECURSORTEMPEL KIJKT",
      "JE EEN MANIER ZULT VINDEN OM DIE BLAUWE ECO VENTILATIE OP SENTINEL BEACH AAN TE ZETTEN."
    ],
    "assistant-reminder-1-generic": [
      "HEY GASTEN, BLIJF ENERGIECELLEN VERZAMELEN!",
      "ZE ZIJN DE SLEUTEL OM ONZE TOCHT RICHTING HET NOORDEN VERDER TE ZETTEN."
    ],
    "assistant-reminder-1-race-bike": [
      "IK HEB ABSOLUUT UITGEVOGELD HOE IK DE TRANS-PADS MOET GEBRUIKEN",
      "GA NU NAAR MISTY EILAND EN IK STUUR DE ZOOMER NAAR JE"
    ],
    "assistant-village2-introduction": [
      "WAUW!",
      "IK DENK NIET DAT IK OOIT ZAL WENNEN AAN DAT TINTELENDE GEVOEL VAN EEN TELEPORTER.",
      "HOI!",
      "HET LIJKT EROP DAT DE BLAUWE WIJZE EEN FEESTJE GEGEVEN HEEFT.",
      "OH NEE! ROCK VILLAGE STAAT IN BRAND!",
      "EEN GEWELDIG FEEST.",
      "NEE! IK BEDOEL DAT ROCK VILLAGE WORDT GEBOMBARDEERD MET BRANDENDE ROTSBLOKKEN!",
      "OH! EN HET LIJKT EROP DAT DE BLAUWE WIJZE WERKT AAN EEN ZWEEFMACHINE OM ZE TE VERPLAATSEN.",
      "ALS WE ER VANUIT GAAN DAT HET WERKT, GAAN WE ENERGIECELLEN NODIG HEBBEN.",
      "IK DENK DAT JULLIE ER NOG EEN PAAR ZULLEN MOETEN VINDEN.",
      "KUNNEN WE BETER ZIJN AANTEKENINGEN EVEN BEKIJKEN.",
      "JAK, GA KIJKEN HOE HET MET DE DORPELINGEN GAAT, KOM DAN TERUG EN GEEF ONS EEN UPDATE.",
      "EN NEEM DE HAARBAL MET JE MEE!"
    ],
    "assistant-village2-introduction-flutflut": [
      "WEER TERUG, JONGENS?",
      "\"JONGEN\"?",
      "HÉ SCHAT, IK BEN EEN VOLWASSEN...",
      "AH...",
      "IETS... IETS DONZIGS.",
      "OH, RAAD EENS? MET TOESTEMMING VAN ONZE DORPSVOGELSPOTTER,",
      "IK HEB DE BABY FLUT-FLUT UITGERUST MET EEN ZADEL.",
      "HET LIJKT EROP DAT ER EEN PRECURSOR TRANS-PAD IN HET MOERAS IS.",
      "ALS JE HET KUNT VINDEN, STUUR IK JE DE FLUT-FLUT IN VOL ORNAAT.",
      "HAAR VERSPRINGEN KAN VAN PAS KOMEN ALS JE HET TEER OVERSTEEKT."
    ],
    "assistant-village2-introduction-robbers": [
      "HÉ, JULLIE TWEE!",
      "IK WEET WAAR JE NOG EEN ENERGIECEL KAN VINDEN!",
      "VOLGENS ZIJN AANTEKENINGEN,",
      "EEN PAAR DAGEN GELEDEN HEBBEN VLIEGENDE LURKERS ER EEN GESTOLEN VAN DE BLAUWE WIJZE,",
      "EN VLOOG WEG NAAR HET PRECURSORBASSIN.",
      "IK DURF TE WEDDEN DAT JE DIE LURKERS KAN NEERHALEN MET JE ZOOMER",
      "TOTDAT JE DEGENE MET DE ENERGIECEL VINDT.",
      "JE VINDT DE ZOOMER OP HET TRANS-PAD BIJ DE INGANG VAN HET PRECURSORBASSIN."
    ],
    "assistant-village2-introduction-room": [
      "BLIJKBAAR LEIDT DE PRECURSOR CONSTRUCTIE VLAK VOOR DE KUST",
      "NAAR EEN VERLOREN STAD ONDER WATER.",
      "DE BLAUWE WIJZE HEEFT GEPROBEERD UIT TE ZOEKEN",
      "HOE HIJ EEN VAN DE KAMERS NAAR DE OPPERVLAKTE KAN BRENGEN.",
      "MAAR HET IS HEM NOOIT GELUKT.",
      "JE MOET HET ECHT EENS CHECKEN.",
      "UH... ZIJN ER NIET VEEL, UM...",
      "LURKERHAAIEN IN DAT WATER?",
      "WAAROM? BEN JE BANG?",
      "IK? NATUURLIJK NIET!",
      "IK ZORG GEWOON VOOR JAK!",
      "JIJ, UH, HEH...",
      "JE WEET WAT EEN BANGERIK HIJ KAN ZIJN.",
      "NOU, ALS JE OVER HET KORAALRIF ZWEMT, BETWIJFEL IK OF DE HAAIEN JE LASTIG ZULLEN VALLEN.",
      "ZE HOUDEN NIET VAN ONDIEP WATER."
    ],
    "assistant-village2-reminder-1-flutflut": [
      "IK WEET ZEKER DAT DE FLUT-FLUT JE VAN PAS KAN KOMEN IN HET MOERAS.",
      "ZOEK DE TRANS-PAD EN IK TELEPORTEER HAAR NAAR JE TOE."
    ],
    "assistant-village2-reminder-1-robbers": [
      "IK TELEPORTEER JE ZOOMER NAAR JE TOE BIJ HET PRECURSORBASSIN,",
      "ZODAT JE DIE VLIEGENDE LURKERS WAAR WE HET OVER HADDEN KUNT ACHTERVOLGEN."
    ],
    "assistant-village2-reminder-1-room": [
      "BEN JE AL NAAR DE VERLOREN PRECURSORSTAD GEZWOMMEN?",
      "JE ZOU ECHT MOETEN PROBEREN DE KAMER WAAR DE BLAUWE WIJZE NAAR OP ZOEK WAS TE VERHOGEN."
    ],
    "assistant-village2-resolution": [
      "GEWELDIG, JE HEBT DE CELLEN VOOR DE MACHINE!",
      "ZOUDEN ZE GENOEG KRACHT MOETEN LEVEREN OM DAT ROTSBLOK OP TE TILLEN.",
      "DAAR GAAN WE!",
      "WEES NU VOORZICHTIG MET DAT LURKERMONSTER BOVENAAN.",
      "WACHT! UH...",
      "IK BLIJF HIER EN BESCHERM KEIRA!",
      "JAK, IK DENK DAT JE KLAAR BENT OM DAT MONSTER ZONDER MIJ AAN TE PAKKEN.",
      "OH, ECHT HEROÏSCH VAN JOU."
    ],
    "assistant-village3-reminder": [
      "HEY GASTEN, BLIJF ENERGIECELLEN VERZAMELEN!",
      "ZIJ ZIJN DE SLEUTEL OM ONZE REIS NAAR HET NOORDEN VOOR TE ZETTEN."
    ],
    "billy-accept": [
      "GOED! DIE RATTEN KOMEN ELK MOMENT TERUG.",
      "SCHIET AL DIE RATTEN NEER, EN BEWAAR ZE",
      "DOOR TEN MINSTE ÉÉN VAN HEN SNACKS TE ETEN."
    ],
    "billy-introduction": [
      "HOE, VRIENDEN! GENIET VAN MIJN PRACHTIGE MOERAS?",
      "IK BEZIT DEZE HIER ONDERDELEN.",
      "ALLES DAT NIET IN DE MODDER DANKZINKT, DAT IS HET! HA HA HA...",
      "AFGAANDE OP DE GEUR, DURF IK TE WEDDEN",
      "HET BAD ZONK LANG GELEDEN IN DE MODDER.",
      "WAT IS EEN BAD?",
      "HOE DAN OOK, IK HEB NU EEN GROTER PROBLEEM...",
      "HET LIJKT EROP DAT ER EEN PAAR VERVELENDE LURKER-VARMINTS GROUSIN 'OVER ZIJN,",
      "ALLES AFPAKKEN WAAR ZE HUN GROEZELIGE KLEINE POOTJES OP KUNNEN KRIJGEN.",
      "EN MIJN HUISDIER HIPHOG, FARTHY, VERWIJDEREN.",
      "HIJ WORDT AL BIJNA EEN WASBEERLEEFTIJD VERMIST.",
      "IK HEB ZIJN FAVORIETE SNACK KLAARGEMAAKT,",
      "MAAR DIE ONBESCHADIGDE MOERASRATEN BLIJVEN ZE STELEN!",
      "ALS JE DIE VERVELENDE BEESTJES LANG GENOEG OP AFSTAND ZOU KUNNEN HOUDEN,",
      "IK WEET DAT FARTHY DE VOEDSELSOORTEN ZOU RUIKEN EN TERUG ZOU KOMEN!",
      "WIL JE MIJ HELPEN?"
    ],
    "billy-reject": [
      "NOU, ALS JE VAN GEDACHTEN VERANDERT, WEET JE WAAR JE MIJ KUNT VINDEN!",
      "HIJ HIJ HIJ HEE..."
    ],
    "billy-reminder-1": [
      "AHH, GAAN JULLIE ALLEMAAL TERUG OM DIE RATTEN TE HELPEN STOPPEN?"
    ],
    "billy-resolution": [
      "GOED BAK MIJN HUID! JE WEET ZEKER HOE TE SCHIETEN!",
      "BEDANKT EEN HOOP VOOR DE HULP."
    ],
    "bird-lady-beach-resolution": [
      "OH MIJN, IK HOOP DAT HET GOED GAAT MET DE ARME SCHAT.",
      "HIER IS EEN KRACHTCEL VOOR JE MOED.",
      "MAMA!",
      "MAMA!",
      "OH NEE! NEE NEE NEE NEE!",
      "KIJK... IS DAT NIET LEUK? HET DENKT DAT JE ZIJN MAMA BENT.",
      "EH? IK BEN JE MOEDER NIET! ZIE JE HIER VEREN?",
      "O, LIEFDE OP HET EERSTE GEZICHT! AH...",
      "LUISTER, JONGENS, IK NEEM DIT KLEINE MEID MEE TERUG NAAR HET DORP",
      "EN WERK SAMEN MET DE WIJZE OM VOOR HAAR TE ZORGEN."
    ],
    "bird-lady-introduction": [
      "O MIJN, WAT EEN VERSCHRIKKELIJK ZIEK VOGELTJE.",
      "HAU! U ZIET ER ZELF NIET ZO GOED UIT, DAME!",
      "OH SORRY. IK DACHT DAT JE EEN GEVLEKT WAS",
      "ORANJE-BELLIED REGENFRAY.",
      "WEET JE, GISTEREN HEB IK ER EEN PAAR GEZIEN",
      "VRESELIJK WREDE WEZENS VANGEN",
      "EEN MOEDER FLUT-FLUT DICHTBIJ HET STRAND.",
      "NU IS ER DIT ARME KLEINE WEESEI",
      "ZITTEN IN EEN NEST BOVEN OP DE KLIF",
      "EN IK KAN ER NIET BIJ.",
      "ALS JE DAAR OMHOOG ZOU KUNNEN KLIMMEN EN HET ERAF ZOU KUNNEN DUWEN, DAN HEB IK HET OPGESTAPELD",
      "WAT HOOI NEER AAN DE BASIS OM HET VEILIG TE VANGEN.",
      "DOE EEN OUDE DAME EEN PLEZIER, EN IK GEEF JE EEN KRACHTCEL."
    ],
    "bird-lady-reminder-1": [
      "O, HALLO OPNIEUW. HEBBEN JULLIE DAT BLAUWE EI OP DE KLIF GEVONDEN?",
      "DUW HET VAN DE RAND EN IK GEEF JE EEN KRACHTCEL!"
    ],
    "bird-lady-reminder-2": [
      "KIEZEN JULLIE HIER NOG STEEDS? HO HO HO.",
      "IK WED DAT DAT ARME KLEINE BLAUWE EI OP DE KLIF LIGT",
      "HET WORDT INMIDDELS VERSCHRIKKELIJK KOUD.",
      "RED HET DOOR HET VAN DE RAND VAN DE KLIP TE DUWEN,",
      "EN IK GEEF JE EEN KRACHTCEL."
    ],
    "bluesage-resolution": [
      "GOED WERK, JONGENS! DE OUDE SAMOS HAD GELIJK OVER JULLIE!",
      "GROTE STAPELS PRECURSOR METAAL!",
      "DIE VERRADERLIJKE MECHANISCHE CREATIE",
      "MAG NIET WORDEN TOEGESTAAN ZIJN VERSCHRIKKELIJKE RAVAGE AAN TE RICHTEN!",
      "IK ZAL PROBEREN DE SCHILDDEUR TE BEDIENEN",
      "DOOR EEN KANAAL VAN ENERGIE OP TE WEKKEN",
      "TUSSEN MIJ EN HET GROTE PORTAAL BENEDEN!",
      "UH... JA, DOE DAT MAAR. WE GAAN, UH... HULP ZOEKEN.",
      "RAAR!"
    ],
    "death-0181": [
      "STAP NIET IN HET LICHT, JAK! STAP NIET IN HET LICHT!"
    ],
    "death-0182": [
      "HÉ, JAK! KAN IK...",
      "HEBT U UW INSECTENVERZAMELING?"
    ],
    "death-0184": [
      "TERWIJL JE DAAR BENT, EHM...",
      "KAN JE MIJN VOETEN WRIJVEN?"
    ],
    "death-0186": [
      "MAAK JE GEEN ZORGEN! IK ZAL JE WREKEN!",
      "...NIET."
    ],
    "death-0187": [
      "NOU, EUH...",
      "BETER JIJ DAN IK."
    ],
    "death-0191": [
      "HET LIJKT EROP DAT HET PIJN DOET.",
      "MOET IK BELLEN VOOR VERVANGING?"
    ],
    "death-0193": [
      "STAP EEN: BLIJF IN LEVEN!",
      "STAP TWEE...",
      "DENK ER EENS OVER NA OM ZOIETS NIET MEER TE DOEN!"
    ],
    "death-0195": [
      "IK STOND VLAK ACHTER JE, JAK!",
      "...ECHT. IK WAS."
    ],
    "death-0197": [
      "HEIMELIJK! EH... BRANCARD!",
      "BAUW... ADEMMUNT?"
    ],
    "death-0199": [
      "IK ZAL OP DE BEGRAFENIS IETS HEEL TRAANIGS ZEGGEN, ZOALS...",
      "...\"HOE WORD IK NU TERUG VERANDERD?!\""
    ],
    "death-0202": [
      "ZEG GOEDE NACHT HOE!"
    ],
    "evilbro-misty-end": [
      "DIE TWEE KUNNEN PROBLEMEN BLIJKEN TE ZIJN.",
      "MAAK JE GEEN ZORGEN LIEVE BROER, IK ZAL MIJN LURKER-LEGER STUREN OM ZE AF TE HANDELEN.",
      "ZORG ER MAAR VOOR DAT ZE NIET TE DICHT BIJ ONZE NOORDELIJKE ACTIVITEITEN KOMEN.",
      "IK BETWIJFEL OF ZE ZO VER ZULLEN KOMEN...",
      "MAAR ALS ZE DAT DOEN, WACHT ER EEN VERRASSING IN ROCK VILLAGE.",
      "DUS...JIJ GAAT...KLAWW UIT ZIJN KOOI LATEN?",
      "IK DENK DAT HET HET RISICO WAARD IS.",
      "INDERDAAD..."
    ],
    "explorer-introduction": [
      "NOU, HALLO DAAR, MIJN LIEVE JONGEN.",
      "JE HEBT GEVANGEN OP EEN MEEST ONGESCHIKT MOMENT.",
      "IK ZOU GISTEREN OP REIS GAAN",
      "MAAR IK BEN ZO GESCHIKT VOOR DE OUDE VOORGANGERS.",
      "IK ZOU MIJN WOORD HEBBEN BELOOFD DAT IK ER 90 HAD,",
      "MAAR IK BEGRIJP DAT JE JONGE VRIEND, JE WEET WEL, DE",
      "WEINIG VERVELEND, ELLENDIG LELIJK",
      "MISSCHIEN HEB IK ZE GEWOON GESTOLEN ALS EEN SOORT PLEZIERTJE.",
      "HOE DAN OOK, ZOU JE ZO VRIENDELIJK WILLEN ZIJN OM JE LIEVE OUDE OOM TE LENEN?",
      "90 VOORLOPIGE ORBS ZODAT HIJ OP START KAN GAAN?",
      "IN RUIL DAARVOOR ZOU IK JE EEN KRACHTCEL AANBIEDEN."
    ],
    "explorer-reminder-1": [
      "WAT? HEBT U NIET DE VOLLEDIGE STASH? HARRUMP!",
      "NOU JA, MINDER DAN 90 VOORLOPIGE ORBS",
      "EN IK KRIJG GEEN KANS OM OP PAD TE GAAN, LIEVE JONGEN."
    ],
    "explorer-reminder-2": [
      "OH ZIE HIER, DE DEAL IS VOOR 90 PRECURSOR-ORBS VOOR EEN KRACHTCEL.",
      "EEN RECHTE ZELFS HANDEL."
    ],
    "explorer-resolution": [
      "IK ZIE DAT JULLIE TWEE TERUG ZIJN OM DE RUIL TE DOEN. GOED, GOED, HEEL GOED!",
      "EH, JE HEBT DE VOORLOPIGE ORBS WAAR WE HET OVER EENS ZIJN?",
      "IK HOOP DAT JE DEZE MET ZWARE KRACHT VERDIENDE POWER CELL GOED GEBRUIKT.",
      "CHEERIO, TA TA, DAAAAAAAA!"
    ],
    "farmer-introduction": [
      "IK MOET DIE YAKOWS MELKEN, IK MOET DIE YAKOWS MELKEN...",
      "OH! JIJ BENT HET... GEWOON MIJN VERMOEIDE BOTEN RUSTEN.",
      "IK HEB GEPROBEERD DIE ORNERY YAKOWS TE KRIJGEN",
      "TERUG IN DE PEN DE HELE DAG!",
      "SOMMIGE VREEMDE WEZENS PROBEERDEN ZE EERDER TE STELEN.",
      "DENK JE DAT JE EEN OUDE MAN KUNT HELPEN OM ZE TERUG IN DE CORRAL TE KRIJGEN?"
    ],
    "farmer-reminder-1": [
      "HOI! MIJN YAKOWS ZIJN NOG STEEDS LOS!",
      "EH, KUN JE ZE AL VOOR MIJ TERUGBRENGEN?"
    ],
    "farmer-reminder-2": [
      "DIE VERDOMDE YAKOWS ZIJN NOG STEEDS VRIJ.",
      "GA JE ZE NIET AL DE KRAAL IN JAGEN?"
    ],
    "farmer-resolution": [
      "AH, GOED GEDAAN MIJN JONGEN. JE HEBT DIE VLOOIENZAKKEN DAADWERKELIJK IN DE PEN GESTOPT.",
      "NU KAN IK VREDE SLAPEN. NEEM DEZE KRACHTCEL VOOR UW PROBLEMEN."
    ],
    "finalbosscam-white-eco": [
      "LICHT ECO! HET BESTAAT WEL!",
      "ZE MOGEN HET NIET KRIJGEN!"
    ],
    "fisher-accept": [
      "ER ZIJN TWEE SOORTEN GOEDE VIS OM TE VANGEN:",
      "FISHIES VAN ÉÉN POND EN FISHIES VAN VIJF POND.",
      "HEE. ALS JE 20 PONDEN GOEDE VIS MIST",
      "DAN NEEM IK ME NET TERUG VAN YA!",
      "ER ZIJN GIFTIGE PALINGEN IN DEZE RIVIER.",
      "VANG ZELFS EEN VAN HEN BOOGERS",
      "EN JE ZULT DE HELE VERDOMDE VANGST VERGIFTIGEN!"
    ],
    "fisher-introduction": [
      "WAT HEB JE IN DE MAND?",
      "NIETS OM OVER TE PRATEN.",
      "DIE MONSTERS PATROUILLEREN OP DE OCEAAN",
      "NAM EEN HAAT UIT MIJ FISHIN' RIG.",
      "EN NU SCHROBBEN ZE MIJ OP!",
      "WAT IK OOK PROBEER, HET LIJKT EROP DAT IK IN DEZE RIVIER GEEN ENKELE VIS KAN VANGEN.",
      "WHOO! MISSCHIEN... IS HET JE ADEM.",
      "DENKT U DAT U HET BETER KAN DOEN?",
      "PROBEER RIVIERVIS OP TE SCHEPPEN MET EEN KLEIN NET!",
      "IK GEEF JE EEN KRACHTCEL",
      "ALS JE 200 POND VAN DIE BEESTJES KUNT VANGEN!",
      "EN IK LAAT JOU EN GARNALEN HIER",
      "GEBRUIK MIJN SPEEDBOOT OM NAAR MISTY EILAND TE GAAN.",
      "WILT U DE UITDAGING PROBEREN?"
    ],
    "fisher-reject": [
      "NOU JA, ALS JE EEN KEER DE POWER CELL WILT PROBEREN",
      "JE WEET WAAR JE ME KUNT VINDEN."
    ],
    "fisher-reminder-1": [
      "WIL JE PROBEREN DE RIVIER TE VERSLAAN?"
    ],
    "fisher-resolution": [
      "JE HEBT HET GEDAAN! JE HEBT 200 PONDEN VIS GEVANGEN!",
      "NIET SLECHT VOOR EEN PAAR LANDLUBBERS!",
      "HIER IS DE KRACHTCEL DIE IK BELOOFDE",
      "EN JE KUNT MIJN BOOT IN HET DORPSDOK GEBRUIKEN",
      "WANNEER JE MAAR WILT!"
    ],
    "fishermans-boat-ride-to-village1-alt": [
      "DIE TWEE KUNNEN PROBLEMEN BLIJKEN TE ZIJN.",
      "MAAK JE GEEN ZORGEN, LIEVE BROER. IK STUUR MIJN LURKER-LEGER OM ZE AF TE HANDELEN.",
      "ZORG ER WEL VOOR DAT ZE NIET TE DICHT BIJ ONZE NOORDELIJKE ACTIVITEITEN KOMEN.",
      "IK BETWIJFEL OF ZE ZO VER ZULLEN KOMEN.",
      "MAAR ALS ZE DAT DOEN, WACHT ER EEN VERRASSING IN ROCK VILLAGE.",
      "DUS... GA JE KLAWW UIT ZIJN KOOI LATEN?",
      "IK DENK DAT HET HET RISICO WAARD IS.",
      "INDERDAAD."
    ],
    "gambler-introduction-1": [
      "AW, NEE. NIET EEN ANDERE \"HELD\".",
      "IK VERLOOR MIJN KORTE BROEK TIJDENS HET GROTE GEVECHT VAN DEZE ZOGENAAMDE HELD",
      "TEGEN HET MONSTER DAAR BOVEN.",
      "VERTROUW ME, HET SLIMME GELD IS OP HET MONSTER.",
      "DIE WEDDENSCHAP HEEFT MIJ BEHOORLIJK UITGELACHEN!",
      "DUS, IK HEB EEN VOORSTEL.",
      "BRENG ME 90 ORBS OM ME WEER OP MIJN VOET EN UIT DIT VAT TE KRIJGEN,",
      "EN IK GEEF JE IN RUIL DAARVOOR EEN ENERGIECEL.",
      "EN ALS JE EEN SPEL BENT, HEB IK NOG EEN WEDDENSCHAP ONLINE.",
      "MIJN GROTE COMEBACK!",
      "VERSLA DE RECORDTIJD RACING DEAD MAN'S GORGE IN HET PRECURSOR BASIN,",
      "EN IK KRIJG EEN MOOIE UITBETALING!",
      "DAARVOOR GEEF IK JE NOG EEN POWER CELL."
    ],
    "gambler-reminder-money": [
      "HOI. VERGEET DE ORBS NIET DIE IK NODIG HEB.",
      "90 KRIJG ER EEN. ÉÉN KRACHTCEL, DAT IS!"
    ],
    "gambler-reminder-race": [
      "WEL, WAAR WACHT JE OP?",
      "DIT VAT JEUKT!",
      "VERSLA DE BESTE TIJD IN DEAD MAN'S GORGE,",
      "EN WIJ ZULLEN BEIDE WINNAARS ZIJN!"
    ],
    "gambler-resolution-money": [
      "HEE HEE HEE! O JA!",
      "DEZE ORBS ZULLEN ME HELPEN DE WEG TERUG UIT DIT VAT TE WINNEN!",
      "HIER IS DE KRACHTCEL DIE IK BELOOFDE!"
    ],
    "gambler-resolution-race": [
      "OH, GEWELDIGE BEWEGINGEN, JONGEN! IK WIST DAT HET TIJDSRECORD ZOU VALLEN.",
      "NU IS HIER JE KRACHTCEL, EN IK KAN MIJN GROTE UITBETALING GAAN OPHALEN!"
    ],
    "geologist-introduction": [
      "JULLIE TWEE ZIEN ERUIT ALS EEN PAAR CAPABELE KERELS.",
      "IK HEB EEN ONDERZOEKSPROJECT AAN DE GANG,",
      "EN MISSCHIEN KUN JIJ MIJ HELPEN.",
      "HÉ, WIJ ZIJN HIER OP EEN GROTE ZOEKTOCHT.",
      "WIJ VRAGEN U OM HULP.",
      "NOU JA, MISSCHIEN KUNNEN WE ELKAAR HELPEN.",
      "IK HEB DE GRAAFGEWOONTEN VAN HET AANSTEKEN VAN MOEDERVLEKKEN BESTUDEERD",
      "JARENLANG IN HET VOORLOPERBEKKEN NAAST ONS DORP.",
      "MAAR NU HEBBEN DIE AFGRIJSELIJKE LOERKUNDIGEN DE MOLLEN NAAR DE OPPERVLAKTE GEKREGEN!",
      "EN OMDAT ZE ZO BLIND ZIJN ALS VLEERMUIZEN, KUNNEN ZE DE WEG TERUG ONDER DE GROND NIET VINDEN.",
      "ALS JE ZE TERUG ZOU KUNNEN DRIJVEN NAAR HUN GRAVENDE TUNNELS,",
      "U KUNT HUN LEVEN REDDEN.",
      "IK HEB EEN KRACHTCEL DIE ZEGT DAT JE HET KUNT.",
      "JA, BLIKSEMMOLES... WIJ ZORGEN DAAR VOOR.",
      "MISSCHIEN VOOR TWEE ENERGIECELLEN!",
      "GOED GEPROBEERD. MAAR IK ZOU BEREID ZIJN DEEL TE NEMEN VAN EEN ANDERE KRACHTCEL",
      "ALS JULLIE TWEE MIJ 90 VOORLOPER-ORBS VINDEN VOOR MIJN ONDERZOEKSAPPARATUUR.",
      "REDELIJK?"
    ],
    "geologist-reminder-moles": [
      "HEB JE DIE BLIKSEMMOLEN TERUG ONDER DE GROND GEDWONGEN?",
      "JE MOET HAAST HEBBEN - HET DIRECTE ZONLICHT IS NIET GOED VOOR HEN!"
    ],
    "geologist-reminder-money": [
      "IK HEB DIE ORBS NODIG ALS IK MIJN ONDERZOEK GA VERDER GAAN!"
    ],
    "geologist-resolution-moles": [
      "BEDANKT VOOR HET BEHOUDEN VAN DIE MOLES, DAT IS HEEL GOED VAN JE.",
      "HIER IS EEN KRACHTCEL OM U TE HELPEN.",
      "NU KAN IK TERUG NAAR MIJN ONDERZOEK!"
    ],
    "geologist-resolution-money": [
      "OH, JE HEBT DE ORBS!",
      "HIER IS EEN KRACHTCEL WAAR WE HET OVER EENS ZIJN."
    ],
    "green-sagecage-daxter-sacrifice": [
      "LICHTE ECO! DAT ZOU HET SPUL KUNNEN ZIJN OM ME TERUG TE VERANDEREN!",
      "OF... HET KAN DIE ROBOT STOPPEN.",
      "DONZIG BLIJVEN, DE WERELD REDDEN... KEUZES...",
      "OKÉ, PRIMA, WE ZULLEN DE WERELD REDDEN.",
      "MAAR DOE HET SNEL VOORDAT IK VAN GEDACHTEN VERANDER!"
    ],
    "green-sagecage-introduction": [
      "HET WERD TIJD DAT JULLIE TWEE EENS KWAMEN OPDAGEN!",
      "OOK LEUK OM JOU TE ZIEN!",
      "LATEN ZE JE NU DE VLOEREN DWEILEN?",
      "GEEN TIJD VOOR GRAPJES, DAXTER. GOL EN MAIA HEBBEN ONS ONTVOERD",
      "OM ONZE ENERGIE OP TE ZUIGEN OM HUN AFSCHUWELIJKE MACHINE VAN ENERGIE TE VOORZIEN.",
      "HET LIJKT EROP DAT ZE DE WERKENDE OVERBLIJFSELEN VAN EEN PRECURSORRROBOT HEBBEN GECOMBINEERD",
      "MET VERZAMELDE ARTEFACTEN UIT HET HELE LAND.",
      "TOEN VOEGDEN ZE ER ZELF NOG EEN PAAR DUIVELSE TOEVOEGINGEN AAN TOE,",
      "OM ZO HET ENIGE TE CREËREN DAT IN STAAT IS OM DE DONKERE ECO-SILO'S TE OPENEN.",
      "ALS JE ONS VIEREN KUNT BEVRIJDEN, KUNNEN WE ONZE GECOMBINEERDE KRACHTEN GEBRUIKEN...",
      "OM HET KRACHTVELD ROND DE ROBOT TE DOORBREKEN",
      "VOORDAT ZE HET GEBRUIKEN OM DE WERELD TE VERNIETIGEN."
    ],
    "green-sagecage-outro-beat-boss-a": [
      "DOE IETS!",
      "NEE!"
    ],
    "green-sagecage-outro-beat-boss-b": [
      "NOU, HET LIJKT EROP DAT IK TE HARD VOOR JULLIE BEN GEWEEST JONGENS!",
      "JULLIE HEBBEN WAT NODIG IS OM HELDEN TE ZIJN!",
      "MAAR, DAXTER, NU KUNNEN WE JE NIET MEER TERUGVERANDEREN.",
      "MAAK JE GEEN ZORGEN OM MIJ, SCHATJE.",
      "JE WEET WAT ZE ZEGGEN: GROTE DINGEN KOMEN IN KLEINE VERPAKKINGEN.",
      "JAK, JE HEBT EEN ONGELOOFLIJK TALENT OM ECO TE KANALISEREN!",
      "SAMOS, MISSCHIEN HAD JE TOCH GELIJK OVER DEZE!",
      "EN KEIRA, ZONDER JOUW HULP EN VINDINGRIJKHEID",
      "ZOU NIETS VAN DIT ALLES MOGELIJK ZIJN GEWEEST.",
      "HM-HM-HM. MISSCHIEN HEBBEN WE EEN ANDERE WIJZE GEVONDEN",
      "NU GOL EN MAIA VERLOREN ZIJN...",
      "JA, GOL EN MAIA... DE DONKERE ECO HEEFT ZE WAARSCHIJNLIJK VERNIETIGD.",
      "EH, WAARSCHIJNLIJK...",
      "AH, WIE KAN HET SCHELEN? KOM MAAR OP, WE KUNNEN ZE WEL WEER AAN! TOCH, JAK?",
      "IK ZEI: TOCH, JAK?",
      "WHOA! ZET HET OP IJS, GROTE JONGEN!"
    ],
    "green-sagecage-outro-beat-boss-enough-cells": [
      "WOW! WAT KAN DAT ZIJN?",
      "HET IS EEN OUDE PRECURSORDEUR!",
      "HET LIJKT EROP DAT HET ALLEEN OPEN GAAT ALS WE ALLE 100 GATEN VULLEN MET STROOMCELLEN!",
      "UH, WE ZIJN HELDEN, WEET JE NOG? WE HEBBEN 100 ENERGIECELLEN!"
    ],
    "green-sagecage-outro-beat-boss-need-cells": [
      "HEILIGE YAKOW! WAT KAN DAT ZIJN?",
      "WOW, HET IS EEN OUDE VOORLOPDEUR!",
      "HET ZIET ER NAAR UIT DAT HET ALLEEN OPENGAAT ALS WE ALLE 100 GATEN VULLEN MET ENERGIECELLEN!",
      "OH JONGEN... HIER GAAN WE WEER!"
    ],
    "green-sagecage-outro-big-finish": [
      "WAUW! WAT IS HET?",
      "HET IS ZO MOOI...",
      "DOOR DE VOORLOPERS..."
    ],
    "green-sagecage-outro-preboss": [
      "JE BENT TE LAAT, SAMOS.",
      "EENS BEZIT IK ONBEPERKTE DARK ECO",
      "IK ZAL DE SLEUTEL HEBBEN TOT DE CREATIE ZELF!",
      "DIT IS WAANZIN!",
      "HET VRIJGEVEN VAN DAT VEEL DONKERE ECO ZAL ALLES WAT WE WETEN VERNIETIGEN!",
      "KIJK EENS WAT HET MET JE HEBT GEDAAN!",
      "HET HEEFT ONS EEN SCHOONHEID GEGEVEN DIE ALLES WAT U KUNT BEGRIJPEN.",
      "SCHOONHEID? HEBBEN JULLIE DE LAATSTE TIJD IN DE SPIEGEL GEKEKEN?",
      "WACHT NOG TOT WE DE SILO'S OPENEN, KLEINTJE.",
      "DENK JE DAT KLEIN EN DONZIG SLECHT IS?",
      "EN DAN TE BEDENKEN DAT JULLIE HELEMAAL HIERHEEN ZIJN GEREISD VOOR MIJN HULP.",
      "DWAZEN! GENIET VAN JULLIE PLEK OP DE EERSTE RIJ VOOR DE RECREATIE VAN DE WERELD!",
      "JAK! NEEM DE LIFT NAAR BOVEN EN STOP DIE ROBOT!"
    ],
    "green-sagecage-resolution": [
      "GOED WERK, JONGENS! JULLIE ZIJN NU ECHTE HELDEN.",
      "IK ZAL MIJN GROENE ECO COMBINEREN MET DE ANDERE DRIE WIJZEN",
      "EN SAMEN OPENEN WE DE SCHILDDEUR ROND DE PRECURSORROBOT.",
      "JA JA DAT KLINKT ALS EEN GOED BEGIN.",
      "EN DAN NADAT JULLIE DAT SCHILD HEBBEN GEOPEND",
      "WAT GAAT U DOEN AAN DE ROBOT?",
      "NIETS, DAXTER. WE MOETEN HET SCHILD OPEN HOUDEN.",
      "HET IS AAN JULLIE TWEE OM UIT TE ZOEKEN HOE JE DE ROBOT VERNIETIGT.",
      "OH GEWELDIG. IK MAG DE MAN HELPEN DIE MIJ IN EEN FURBALL HEEFT VERANDERD",
      "VERNIETIG DE ENIGE PERSOON DIE ME TERUGKEERT!",
      "EERST: RED DE WERELD!",
      "DAN PROBEREN WE GOL ERVAN TE OVERTUIGEN DAXTER TE HELPEN."
    ],
    "mayor-introduction": [
      "NEE... (MOMTERT) VERTEL ME NIET DAT JULLIE OOK PROBLEMEN HEBBEN!",
      "EERST HOOR IK VAN MONSTERWAARNEMINGEN IN DE BUURT VAN HET DORP, EN NU DIT.",
      "ZIE JE DIE UITRUSTING DAARBOVEN, JONGENS? ZIE ZE? ZIE HOE ZE NIET BEWEGEN?",
      "DAT BETEKENT DAT ONS DORP GEEN KRACHT HEEFT!",
      "DE ECO-STRAL DIE UIT DE JUNGLE-TEMPEL KOMT, IS ONDERBROKEN!",
      "EN JONGENS, IEDEREEN IS TE BANG OM UIT TE GAAN EN TE ONTDEKKEN WAT ER IS GEBEURD.",
      "HEBT U DE REKENING BETAALD?",
      "JA-HMM? OH-HUH-OH, JE BENT GRAPPIG.",
      "KIJK NU, ALS JULLIE TWEE DE ECO BEAM REPAREREN, GEEF IK JE EEN KRACHTCEL.",
      "OH OOH OOH EN-EN NOG ANDERS, UH...",
      "ALS U EVENTUEEL GEÏNTERESSEERD BENT IN EEN BIJDRAGE AAN MIJN HERVERKIEZINGSCAMPAGNE,",
      "IK BEN MISSCHIEN BEREID AFSTAND TE DOEN VAN NOG EEN KRACHTCEL!",
      "DE MINIMUMBIJDRAGE IS, OH, EEN ZEER BESCHEIDEN...",
      "90 VOORLOPIGE ORBS."
    ],
    "mayor-reminder-beams": [
      "AL TERUG? EN ZONDER DE ECO BALKEN TE BEVESTIGEN?",
      "(SOBS) UW DORP HEEFT JULLIE NODIG, JONGENS!"
    ],
    "mayor-reminder-donation": [
      "AH, HIER OM EEN DONATIE TE DOEN AAN MIJN CAMPAGNE, OH HO HO HO.",
      "90 PRECURSOR ORBS KOOPT EEN KRACHTCEL VOOR JE, DANK JE WEL."
    ],
    "mayor-resolution-beams": [
      "OH HO HO, WAT EEN PRACHTIG GEZICHT! IK BEDANK JE!",
      "EN HET HELE DORP ZAL ME DANKEN -",
      "UH, JONGENS, JULLIE HEBBEN DE MACHT IN HET DORP HERSTELD EN MIJN HERVERKIEZING GEGARANDEERD!",
      "EN DAARVOOR, MIJN JONGEN, HEB JE EEN KRACHTCEL VERDIEND."
    ],
    "mayor-resolution-donation": [
      "DUS EH, U UH, WIL U EEN BIJDRAGE DOEN? GOED... EEN GROTE, HOOP IK.",
      "YOOH! EH HIJ HIJ, HET IS EEN, OH, DIT IS EEN GROTE BIJDRAGE!",
      "IK, WH-WH-WH-WAAROM IK HOOP ENKEL DAT DEZE KRACHTCEL VOLDOENDE MIJN DANKBAARHEID VERTEGENWOORDIGT."
    ],
    "minershort-introduction-gnawers": [
      "WAAROM MAKEN JULLIE JEZELF NIET NUTTIG?",
      "LUIKERAARS HEBBEN DAAR DE DONKERE GROTTEN OPGEGRAVEN.",
      "HET LIJKT EROP DAT ZE OP ZOEK ZIJN NAAR VOORLOPERARTEFACTEN.",
      "ZE MOGEN DE ARTEFACTEN HEBBEN, WAT MIJ BETREFT.",
      "VOOR ALLES WAAR WIJ VOOR ZORGEN!",
      "WILLARD, VOER JE VOGEL.",
      "HET ENIGE WAAR IK OM GEEF ZIJN EDELSTENEN!",
      "MAAR IK KAN DE EDELSTENEN VAN DE GROT NIET KRIJGEN",
      "WANT ALS ZE KLAAR ZIJN, GAAN ZE DE BOEL LATEN INSTORTEN!",
      "ALS JE DE LURKERS UITSCHAKELT DIE OP DE STEUNBALKEN KAUWEN,",
      "JE KUNT DE GROT VOOR MIJ BEWAREN.",
      "NU VERSLAAT HET!"
    ],
    "minershort-introduction-orbs": [
      "HEY GORDY, DUH, IK DENK DAT WE BEZOEKERS HEBBEN.",
      "DENK JE, WILLARD? HOE, VREEMDELINGEN, OP DOORTOCHT?",
      "UH, VS, OOK. NOU, WE MOETEN VERDER, ER IS HIER NIETS TE ZIEN.",
      "DUH, IK DACHT DAT JE ZEI DAT DIT EEN ONBETAALBAAR JUWEEL WAS DAT DE MOEITE WAARD WAS-",
      "WILLARD!",
      "EIGENLIJK WILLEN WE ENERGIECELLEN, GEEN EDELSTENEN.",
      "WIJ HEBBEN VIER VAN ZE. DUH, WIL JE ZE?",
      "WAT VOGELBRAIN HIER PROBEERT TE ZEGGEN IS:",
      "WE HEBBEN MISSCHIEN WEL WAT ENERGIECELLEN RONDLIGGEN...",
      "EN WE ZIJN MISSCHIEN BEREID AFSTAND VAN HEN TE DOEN VOOR...",
      "90 ORBS ELK.",
      "WAAR HEB IK DAT EERDER GEHOORD?",
      "HÉ, HOE VERWACHTEN JULLIE TWEE GENIEËN DAT GROTE JUWEELTJE HIER ÜBERHAUPT WEG TE KRIJGEN?",
      "NOU, SMARTYPANTS, WE HEBBEN NOG TWAALF JAAR OM DAT UIT TE ZOEKEN.",
      "EHH... GORDY, ZOU HET NIET MINDER TIJD KUNNEN DURVEN ALS JE OOK GROEFT?"
    ],
    "minershort-introduction-switch": [
      "PSST, JONGENS. DUH...",
      "BIRDIE EN IK VERKENNEN EEN GROT DIE JIJ WILT!",
      "HET WERD GEVULD MET MOOI ORANJE METAAL,",
      "EN HEEL GOED VERBORGEN ACHTER SOMMIGE BOMEN IN DE BESNEEUWDE BERGEN!",
      "IK VERTELDE HET AAN GORDY, MAAR HIJ SCHREEUWDE ALLEEN MAAR TEGEN MIJ OMDAT IK NIET GRAAFDE!",
      "WAAROM GRAAF JE NIET?!",
      "HET SPIJT ME!"
    ],
    "minershort-reminder-1-gnawers": [
      "ZOU JIJ VOOR DIE LURKERS ZORGEN",
      "CHEWIN BIJ DE DONKERE GROT STEUNBALKEN REEDS!",
      "DIE BALKEN KUNNEN DAT SOORT MISBRUIK NIET VOOR ALTIJD AANHOUDEN!"
    ],
    "minershort-reminder-1-orbs": [
      "VERGEET ONZE DEAL NIET. BRENG ONS 100 ORBS.",
      "DUH... JE ZEI 90.",
      "WILLARD!",
      "PRIMA. 90 ORBS EEN KRACHTCEL."
    ],
    "minershort-reminder-1-switch": [
      "HEB JE DE GROT ACHTER DE BOMEN IN DE BESNEEUWDE BERGEN GEVONDEN?",
      "IK GA ER BINNENKORT HEEN, OM MIJ VOOR GORDY TE VERSTOPPEN, WANT HIJ ROEPT WEER TEGEN MIJ!",
      "WILLARD!!"
    ],
    "minershort-reminder-2-orbs": [
      "DUH, GORDY?",
      "90 ORBS EEN KRACHTCEL, WILLARD! URGH!"
    ],
    "minershort-resolution-1-orbs": [
      "O, AL GOED.",
      "HIER IS EEN POWERCELL VOOR JULLIE BOLLEN."
    ],
    "minershort-resolution-2-orbs": [
      "OOO! OH, IK HEB HET DEZE KEER! UH...",
      "HIER IS EEN...",
      "DUHH.. HIER IS EEN...!",
      "EEN KRACHTCEL!",
      "JA, JA... WAT HIJ ZEI.",
      "DAT IS HET. JE HEBT ONS OPGERUIMD.",
      "GEEN! ENERGIECELLEN! MEER!"
    ],
    "oracle-intro-1": [
      "WIE MAAKT HET ORACEL WAKKER?",
      "WACHT, EEN VAN JULLIE HEEFT HET LICHT BINNEN.",
      "VAN VÓÓR TIJD HEB IK KIJKEN EN GEWACHT",
      "VOOR DE WARE HELD DIE TERUGKEERT.",
      "PRESENTEER MIJ 120 VOORLOPIGE ORBS",
      "VOOR ELKE KRACHTCEL DIE IK BEVAT."
    ],
    "oracle-intro-2": [
      "PAS OP VOOR HET DONKERE LICHT,",
      "WANT HET HEEFT HET LOT VAN EEN VAN JULLIE VERDRAAID.",
      "BRENG ME 120 VOORLOPIGE ORBS",
      "VOOR ELKE KRACHTCEL DIE IK BEVAT."
    ],
    "oracle-intro-3": [
      "ZOEK HET PURE LICHT, WANT IN HAAR VLAM ZITTEN DE ANTWOORDEN.",
      "JE KAN MIJN ENERGIECELLEN VERDIENEN",
      "DOOR VOOR IEDEREEN 120 VOORLOPIGE ORBS TE BRENGEN."
    ],
    "oracle-left-eye-1": [
      "JE HEBT BEWEZEN DAT JE HET WAARD BENT. HIER IS EEN POWER CELL."
    ],
    "oracle-left-eye-2": [
      "VOOR JE OFFER BIE IK JE EEN KRACHTCEL AAN."
    ],
    "oracle-left-eye-3": [
      "VOOR UW INSPANNING IS EEN KRACHTCEL DE BELONING."
    ],
    "oracle-reminder-1": [
      "BRENG MIJ 120 VOORLOPER-ORBS",
      "EN IK ZAL JE EEN KRACHTCEL TONEN."
    ],
    "oracle-reminder-2": [
      "AANWEZIG 120 VOORLOPIGE ORBS",
      "EN EEN POWER CELL ZAL UW BELONING ZIJN."
    ],
    "oracle-reminder-3": [
      "JE MOET 120 PRECURSOR ORBS MEENEMEN",
      "AAN MIJ VOOR ELKE KRACHTCEL DIE IK BEVAT."
    ],
    "oracle-right-eye-1": [
      "VOOR UW GESCHENK, KRIJGT U NOG EEN POWER CELL."
    ],
    "oracle-right-eye-2": [
      "HIER IS NOG EEN POWERCEL VOOR UW ZOEKTOCHT."
    ],
    "oracle-right-eye-3": [
      "U HEBT EEN ANDERE POWER CEL VERKREGEN."
    ],
    "redsage-resolution": [
      "HEE-HE-HEH... JE BENT EINDELIJK KOMEN OM ME TE REDDEN.",
      "WEET JE HOE LANG IK HIER AL BEN?",
      "WAAROM DUURDE HET ZOLANG? EN UH, HIJ-HEH...",
      "WAT ZIJN JOUW NAMEN?",
      "IK BEN DAXTER! HIJ IS JAK, HIJ IS BIJ MIJ.",
      "GOED GEDAAN, DAXTER. JE BENT EEN ECHTE HELD.",
      "JE MOET GOL ERVAN WEERHOUDEN DE ROBOT TE LANCEREN.",
      "IK GEBRUIK MIJN ECO-KRACHT OM DE SCHILDTEUR TE HELPEN OPENEN."
    ],
    "sage-bluehut-introduction-crop-dusting": [
      "NOU, DE SITUATIE HIER STINKT ERGER DAN DE OKSEL VAN EEN LURKER.",
      "VOORDAT DE BLAUWE SALIE VERDWEEN,",
      "HIJ REGISTREERDE AANZIENLIJKE PROBLEMEN IN ALLE OMLIGGENDE GEBIEDEN.",
      "VAN BIJZONDER BELANG VOOR MIJ IS DE DONKERE ECO-INFECTIE",
      "OVER ENKELE ONSCHULDIGE PLANTEN IN HET VOORLOPIGE BEKKEN.",
      "KEIRA TELEPORTEERT UW A-GRAV ZOOMER NAAR DE DICHTSTBIJZIJNDE TRANS-PAD.",
      "RIJD MET DE ZOOMER NAAR EEN GROENE ECO-VENT,",
      "EN DRAAG DAN DE GROENE ECO NAAR DE CORRUPTE PLANTEN.",
      "DAT MOET ZE GENEZEN.",
      "ZORG ERVOOR DAT U GEEN ENKELE PLANT MIS, ANDERS ZULLEN DE GEÏNFECTEERDE PLANT DE GEZONDE PLANT LANGZAAM OPNIEUW INFECTEREN.",
      "EN DAXTER...",
      "BEGIN HIER MET OPRUIMEN!",
      "EN VERGEET DE HOEKEN NIET!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "IK HOOP DAT JE EEN LUNCHPAKKET HEBT MEEGENOMEN. WANT WE ZIJN NOG MAAR NET BEGONNEN.",
      "VOLGENS DE AANTEKENINGEN VAN DE BLAUWE WIJZE,",
      "LUIKERAARS HEBBEN HET MOERAS AAN DE BAAI BESMET.",
      "BLIJKBAAR ZIJN ZE VAN PLAN EEN DIRIGIBLE TE GEBRUIKEN",
      "OM EEN BELANGRIJK VOORLOPERARTEFACT UIT DE SLECHTHEID TE HALEN.",
      "JE ZULT DAARHEEN MOETEN GAAN OM HUN BANDEN LOS TE MAKEN.",
      "WIE WEET WAT ZE WILLEN MET HET ARTEFACT,",
      "MAAR ZOALS ORANJE STUFF HIER IS ADEM, KAN HET GEWOON NIET GOED ZIJN."
    ],
    "sage-bluehut-reminder-1-crop-dusting": [
      "MIJN OGEN MOETEN ME BEDRIEGEN!",
      "OMDAT IK WEET DAT JULLIE TWEEËN DIEP IN HET VOORLOPERBEKKEN ZITTEN,",
      "REDDEN VAN DE DONKERE, ECO-GEÏNFECTEERDE PLANTEN."
    ],
    "sage-bluehut-reminder-1-prec-arm": [
      "WAT DOET JIJ HIER AL?",
      "IK KAN ZIEN VANAF HET BALKON",
      "DAT DE LURKER DIRIGIBLE NOG STEEDS BOVEN HET MOERAS DRIJFT.",
      "U HEEFT DUIDELIJK UW TAAK NIET VOLTOOID.",
      "KOM IN BEWEGING!"
    ],
    "sage-intro-sequence-a": [
      "IK HEB MIJN HELE LEVEN GEZOCHT NAAR DE ANTWOORDEN DIE MIJN VADER,",
      "EN DE VADERS VAN MIJN VADER KONDEN HET NIET VINDEN.",
      "WIE WAREN DE VOORLOPERS?",
      "WAAROM HEBBEN ZIJ DE ENORME MONOLITEN GEMAAKT DIE ONZE PLANEET VERVUILEN?",
      "HOE HEBBEN ZE ECO, DE LEVENSENERGIE VAN DE WERELD, GEBRUIKT?",
      "WAT WAS HUN DOEL? EN WAAROM ZIJN ZE VERDWENEN?",
      "IK HEB DE PLANTEN GEVRAAGD, MAAR ZE HERINNEREN HET NIET.",
      "DE PLANTEN HEBBEN HET AAN DE ROTSEN GEVRAAGD, MAAR DE ROTSEN HERINNEREN ZICH NIET.",
      "ZELFS DE ROTSEN HERINNEREN NIET...",
      "ELK BOT IN MIJN LICHAAM VERTELT ME DAT DE ANTWOORDEN RUSTEN",
      "OP DE SCHOUDERS VAN EEN JONGE JONGEN",
      "ZICH NIET BEWUST VAN ZIJN LOT, ONGEÏNTERESSEERD IN DE ZOEKTOCHT NAAR WAARHEID",
      "EN HET VERWERPEN VAN MIJN BEGELEIDING!",
      "EN WAAROM ZOU HIJ EIGENLIJK WILLEN LUISTEREN NAAR OUDE SAMOS DE WIJZE?",
      "IK BEN SLECHTS DE MEESTER VAN GROENE ECO, EEN VAN DE WIJSTE MANNEN OP DE PLANEET!",
      "HET LIJKT DUS DAT HET ANTWOORD NIET BEGINT MET ZORGVULDIG ONDERZOEK",
      "OF VERSTANDIG DENKEN.",
      "NEEN! ZOALS BIJ VEEL MYSTERIES VAN HET LOT",
      "HET BEGINT MET SLECHTS EEN KLEINE DAAD VAN ONGEHOORZAAMHEID.",
      "HOI! EH, JAK? OL' GREEN STUFF VERTELDE ONS HIER NIET TE KOMEN!"
    ],
    "sage-intro-sequence-d1": [
      "WAT WILLEN JULLIE IN GROENE TARNATION?",
      "WIJ- WIJ- WIJ WAS- ZIJ WAS- IK BEN- IK WAS-",
      "VERTEL ME NIET! IN PLAATS VAN NAAR MIJN WIJSHEID",
      "JULLIE TWEEËN GINGEN RONDSNUFFELEN",
      "OP DE ENIGE PLEK WAARVAN IK ZEI DAT JE ER NIET HEEN MOEST GAAN: MISTY EILAND!",
      "DAT IS JUIST! EN DAN-",
      "EN DAXTER, JE HEBT EINDELIJK EEN HOOGNODIG BAD GENOMEN",
      "MAAR IN EEN BAD GEVULD MET DARK ECO.",
      "KIJK, OUDE MAN, GA JE YAPPIN HOUDEN?",
      "OF JE HELPT ME UIT DEZE PUBLIEK!?",
      "IK BLIJF YAPPIN'! OMDAT NAAR MIJN PROFESSIONELE MENING",
      "DE VERANDERING IS EEN VERBETERING.",
      "EN BOVENDIEN... IK ZOU JE NIET KUNNEN HELPEN ALS IK DAT WILDE.",
      "WAT!?",
      "ER IS SLECHTS ÉÉN PERSOON DIE DARK ECO LANG GENOEG STUDEERT",
      "OM EEN KANS TE HEBBEN OM TERUG TE KOMEN NAAR UW VORIGE FORMULIER:",
      "GOL ACHERON, DE WIJZE.",
      "MAAR HIJ WOONT VER NAAR HET NOORDEN. VER, VER NAAR HET NOORDEN.",
      "NIEMAND HEEFT AL EEUWEN MET HEM GESPROKEN.",
      "IK ZOU JE DAARHEEN WILLEN TELEPORTEREN, MAAR DAT KAN IK OOK NIET.",
      "GEEN VAN DE DRIE WIJZEN DIE DE ANDERE TELEPORTEERPOORTEN ONDERHOUDEN",
      "HEBBEN HET GESCHIKT GEZIEN OM HUN EINDE AL EEN TIJD AAN TE ZETTEN!"
    ],
    "sage-intro-sequence-d2": [
      "DE ENIGE ANDERE WEG NAAR HET NOORDEN IS TE VOET DOOR DE FIRE CANYON",
      "MAAR DE VULKANISCHE BODEM IS HEET GENOEG OM HET VOORLOPERMETAAL TE LATEN SMELTEN.",
      "JE KUNT ER NIET ZOMAAR DOORHEEN LOPEN.",
      "MAAR JE KAN ER OVERVLIEGEN",
      "ALS JE EEN ZOOMER HEEFT UITGERUST MET EEN HITTESCHILD.",
      "IK BEN TOEVALIG OP DIT MOMENT AAN IETS ZO'N WERK AAN.",
      "ALLES WAT IK NODIG HEB ZIJN TWINTIG ENERGIECELLEN OM HET GENOEG ENERGIE TE GEVEN",
      "OM DE HITTE VAN DE CANYON TE WEERSTAAN. IS DAT NIET JUIST, PAPA?",
      "JA, KEIRA, DAT ZOU KUNNEN WERKEN. MAAR WAAR IS EEN JONGEN?",
      "EN EEN HALF!",
      "TWINTIG ENERGIECELLEN HALEN?",
      "VAN DE DORPEN! DE MEESTE VAN HEN HEBBEN EEN POWERCEL OF TWEE",
      "ERGENS VERSTOPT.",
      "EN ZELFS ALS ZE NIET BEREID ZIJN OM ZE GEWOON WEG TE GEVEN",
      "HUN PALMEN INVETEN MET EEN PAAR VOORLOPIGE ORBS ZOU DE TRUC KUNNEN DOEN.",
      "EN IK WED DAT ER NOG MEER VAN HEN IN DE WILDERNIS ZIJN, GEWOON OP SOMMIGEN WACHTEN",
      "MOEDIGE AVONTURIER OM TE VINDEN.",
      "NOU, WE HEBBEN TENMINSTE DE DAPPERE AVONTURIER.",
      "DAPPERE AVONTURIER?",
      "ZONDER TRAINING KUNNEN JULLIE TWEE DE WEG UIT HET DORP NIET VINDEN!",
      "VOORDAT JE IETS ANDERS DOET, KUN JE BETER DOOR DE WARPPOORT GAAN EN",
      "ENKELE OEFENINGEN OP DE GEISERROTS.",
      "UH, WE ZULLEN NIET MEER VAN DAT DONKERE KLEVERIGE ECO-STUFF VINDEN, WEL?",
      "OMDAT IK HET NIET LEUK ZOU VINDEN OM ER WEER IN TE VALLEN EN IN JOU TE VERANDEREN!",
      "GA ERIN! VOORDAT IK JULLIE ALLEBEI IN VARENS VERANDER!"
    ],
    "sage-intro-sequence-e": [
      "GOEDE TRAINING, JONGENS, MAAR DAT IS NIETS VERGELEKEN MET DE UITDAGINGEN DIE VOOR ONS LIGGEN.",
      "AH, DAT IS GEEN PROBLEEM. WE HEBBEN DE BEWEGINGEN, EH JAK?",
      "WE WILLEN GRAAG BLIJVEN EN CHATTEN, GROOT GROEN, MAAR WIJ ZIJN UH...",
      "JEUK OM DOOR TE GAAN MET ONZE AVONTUREN.",
      "FIJN, FIJN, \"AVONTUUR\" WEG DAN.",
      "EN WAAROM MAAK JE JEZELF NIET NUTTIG TERWIJL JE OP AVONTUUR BENT?",
      "MIJN DARN GROENE ECO-VERZAMELAARS ZIJN WEER VERSTOPT.",
      "GA NAAR DE VERSTE KANT VAN HET STRAND EN MAAK ZE UIT, WAAROM NIET.",
      "VOLG DE LAMPEN, ZE BRENGEN JE DAAR DAAR.",
      "NU, JULLIE ALLEMAAL...",
      "GA WEG!"
    ],
    "sage-introduction-misty-cannon": [
      "OH, HET ZIJN DE VEROVERENDE HELDEN.",
      "GOED, IK WILDE MET JULLIE TWEE PRATEN OVER IETS ERNSTIGS.",
      "ER LIJKT NOGAL WAT LURKER ACTIVITEIT TE ZIJN OP MISTY ISLAND.",
      "IK ZIE ZE DE VOORLOPER-SILO BOMBARDEREN VANUIT MIJN UITKIJKTOREN.",
      "ALS DE LURKERS HET OPENMAKEN EN DE DARK ECO VRIJLATEN, KUNNEN WE ALLEMAAL EINDIGEN",
      "ROND RENNEN EN ER ZO BELACHELIJK UITZIEN ALS DIT VERVELENDE KLEINE SPECIMEN.",
      "JAK, HET IS TIJD DAT JE JE WAARDE MOET BEWEZEN.",
      "ZORG DAT DE VISSER JE ZIJN BOOT TERUG NAAR MISTY ISLAND LAAT NEMEN",
      "GA NAAR DE TOP VAN DE VOORLOPIGE SILO EN HAAL DAT KANON UIT.",
      "EN IK DAN?",
      "JIJ? WAAROM MOP JE MIJN VLOEREN NIET? ZE LIJKEN DE LAATSTE TIJD HUN GLANS TE HEBBEN VERLOREN."
    ],
    "sage-reminder-1-ecorocks": [
      "SOMMIGE \"MOEDIGE AVONTURIERS\" ZIJN JULLIE TWEE.",
      "REEDS TERUG EN ZONDER MIJN GEBLOKKEERDE ECO-OOGSTEN OP TE RUIMEN!",
      "ZE ZIJN AAN DE ANDERE KANT VAN HET STRAND, JONGENS.",
      "NU...",
      "KOM IN BEWEGING!"
    ],
    "sage-reminder-1-generic": [
      "WAT DOEN JULLIE TWEE HIER? JULLIE MOETEN ENERGIECELLEN VERZAMELEN!",
      "LAAT ME MET RUST... TOTDAT JE ZE HEBT!"
    ],
    "sage-reminder-1-misty-cannon": [
      "HET BOMBARDMENT WORDT ERGER!",
      "VIND DE VISSER IN DE JUNGLE, KRIJG TOESTEMMING OM ZIJN BOOT TE GEBRUIKEN",
      "EN GA NAAR MISTY EILAND OM HET KANON TE STOPPEN",
      "EN JIJ DAXTER, JIJ MOET GAAN DWEILEN. DEZE PLAATS IS EEN PUINHOOP!"
    ],
    "sage-reminder-2-generic": [
      "JULLIE TWEE BEGRIJPEN DE ERNST VAN DE SITUATIE GEWOON NIET.",
      "DIT GAAT OVER MEER DAN EEN ENKELE JONGEN DIE WAUW IS. DIT GAAT OVER HET LEVEN ZOALS WIJ HET KENNEN.",
      "GA NU OP ONTDEKKING EN VERVUL JE LOT."
    ],
    "sage-village3-introduction": [
      "OW! IK VRAAG ME ALTIJD AF OF IK LICHAAMSDELEN VERLIES IN DIE DINGEN!",
      "HEILIGE JAKOW! HET LAB VAN DE RODE WIJZE ZIET ER SLECHTER UIT DAN DAT VAN DE BLAUWE!",
      "NOU, HET ZIET ER ZEKER NAAR UIT ALSOF ER HIER EEN STRIJD IS GEWEEST.",
      "HA HA HA HA HA!",
      "IK ZOU HET NAUWELIJKS 'STRIJD' NOEMEN.",
      "ZOU U, BESTE ZUSTER?",
      "ZEKER NIET. DE RODE SALIE GAF HET OP MET ZO WEINIG MOEITE.",
      "HELEMAAL GEEN PLEZIER.",
      "GOL? BEN JIJ DAT?",
      "JE BENT EINDELIJK UIT HET DIEPE GEGAAN, HÈ?",
      "EN, MAIA! IK VERTELDE JE DAT DE DONKERE ECO JULLIE ALLEBEI ZOU BEÏNVLOEDEN!",
      "HNG, NIEMAND LUISTERT OOIT NAAR OUDE SAMOS...",
      "WAT HEBBEN JULLIE GEDAAN MET DE BLAUWE EN RODE WIJZE?",
      "MAAK JE GEEN ZORGEN OVER JE KLEURRIJKE VRIENDEN, OUWE DWAAS.",
      "ZE ZIJN PERFECT VEILIG IN ONZE CITADEL. ONZE SPECIALE GASTEN.",
      "ZE HEBBEN ER VRIENDELIJK MEE INGESTEMD OM ONS TE HELPEN BIJ EEN KLEIN PROJECT.",
      "JE HAD HET MIS, SAMOS. DARK ECO KAN WORDEN GECONTROLEERD!",
      "WE HEBBEN DE GEHEIMEN HAAR GELEERD, EN NU KUNNEN WE DE WERELD NAAR ONS WIL WERDEN.",
      "U KUNT DARK ECO NIET ZICHZELF BESTUREN! ZELFS DE VOORLOPERS KUNNEN NIET-",
      "TOT NU MOESTEN WE VERDER GAAN MET WAT WEINIG DONKERE ECO",
      "WE KUNNEN DICHTBIJ HET OPPERVLAK VINDEN.",
      "MAAR BINNENKORT HEBBEN WE TOEGANG TOT DE ENORME WINKELS",
      "VAN DONKER ECO VERBORGEN DIEP ONDERGRONDS.",
      "NIET DE SILO'S!",
      "JA, DE SILO'S!",
      "ZE ZULLEN GEOPEND WORDEN, EN ALLE DONKERE ECO IN DE WERELD ZAL VAN ONS ZIJN!",
      "MAAR DAT IS ONMOGELIJK! SLECHTS EEN VOORLOPIGE ROBOT-",
      "O, KIJK NIET ZO BOOS, SAMOS.",
      "WIJ HEBBEN GROTE PLANNEN VOOR U.",
      "AH HA HA HA HA HA HA! AHH...",
      "WACHT EVEN!",
      "DAT WAS GOL?",
      "DEZELFDE GOL DIE MIJ TERUG MOET VERANDEREN?",
      "GOL IS DE KEREL DIE ONS PROBEERT TE DODEN?!",
      "IK BEN GEDOEMD.",
      "WE KUNNEN ALLEMAAL VERDOEMD ZIJN.",
      "ALS ZE DE SILO'S OPENEN, ZAL DE DARK ECO DAT WEL DOEN",
      "DRAAI EN VERNIETIG ALLES WAT HET AANRAKT!",
      "WE MOETEN GEWOON NAAR HUN CITADEL GAAN, OM ZE TEGENHOUDEN!",
      "DE SNELSTE WEG ER IS VIA DE LAVABUIS",
      "AAN DE BODEM VAN DEZE KRATER.",
      "NOG EEN PAAR ENERGIECELLEN, EN HET HITTESCHILD VAN DE ZOOMER",
      "ZOU JE VEILIG OVER DE LAVA KUNNEN KRIJGEN.",
      "OKÉ, MIJN JONGEN. JE WEET WAT JE MOET DOEN.",
      "NEEM DIE VLOOIENBAAL MEE EN GA MEER ENERGIECELLEN HALEN."
    ],
    "sage-village3-introduction-dark-eco": [
      "GEWELDIGE BALLEN VAN ECO!",
      "ER LIJKT EEN GROTE LURKER AANWEZIG TE ZIJN IN DE SPINNENGROTEN!",
      "GEWELDIG. KLINKT ALS EEN ECHTE VROLIJKE PLEK.",
      "LAAT ME RADEN. ER ZIJN SPINNEN IN DE SPINNENGROTTEN, TOCH?",
      "NATUURLIJK ZIJN ER SPINNEN IN SPINNENGROTTEN!",
      "MAAR DAT IS HET MINSTE VAN UW PROBLEMEN!",
      "DE LURKERS ZIJN NA KRISTALLEN VAN GECONCENTREERDE DARK ECO.",
      "JE MOET DE KRISTALLEN VERNIETIGEN VOOR DIE MONSTERS",
      "KRIJG HUN HANDEN OP ZE!",
      "HOP NAAR HET!"
    ],
    "sage-village3-introduction-rams": [
      "IK BEN BLIJ DAT JULLIE TWEE HIER ZIJN. ER IS EEN LURKERBEWEGING IN DE BERGEN.",
      "BLIJKBAAR HEBBEN ZE ONTDEKT, EN PROBEREN ZE NU TE VERWIJDEREN,",
      "ENKELE DONKERE ECO-WINKELS BEVROREN IN DE GLETSJERS.",
      "TERWIJL JULLIE HIER RONDHANGEN VOOR ENERGIECELLEN",
      "STOP DIE LURKERS EN HOUD EEN WEINIG MEER DONKERE ECO UIT GOL'S HANDEN."
    ],
    "sage-village3-reminder-1-dark-eco": [
      "JE MOET DE DONKERE ECO-KRISTALLEN IN SPIDERGROTTEN VERNIETIGEN!"
    ],
    "sage-village3-reminder-1-rams": [
      "WE MOGEN NIET TOELATEN DAT DE LURKERS DE DONKERE ECO-BUSSEN IN HANDEN KRIJGEN.",
      "KOM NAAR DIE BESNEEUWDE PIEKEN EN STOP ZE!"
    ],
    "sculptor-introduction": [
      "HÉ... KLEINE BONTE KEREL!",
      "AWW... IK DACHT EVEN DAT JIJ MIJN MUZE WAS.",
      "JOUW WAT?",
      "HEB JE NOG NOOIT EEN MUSE GEZIEN?",
      "HET IS EEN KLEINE GLOEIENDE EEKHOORN ZO GROOT ALS JIJ, VOL PIT EN GEK ALS EEN LEEUW!",
      "OH, IK SNAP HET! ALS EEN SIDEKICK.",
      "EIGENSCHAP KAN IK ZONDER MIJN MUSE GEWOON NIET BEELDHOUWEN.",
      "MAAR MET HAAR IN DE BUURT... ZIE IK SCHOONHEID IN ALLES, WEET JE?",
      "OP DIT MOMENT KON IK MIJN WEG UIT EEN DOOS NIET BEITELEN.",
      "IK DENK DAT ZE IS WEGGELOPEN NAAR DAT MISTIGE EILAND.",
      "AWW, IK HOOP MAAR DAT HET GOED MET HAAR GAAT.",
      "HET IS EEN POWERCEL WAARD ALS JE HAAR BIJ MIJ TERUG BRENGT!",
      "WACHT EVEN! WE GAAN NIET TERUG NAAR MISTY EILAND!",
      "ZIJN WE?"
    ],
    "sculptor-reminder-1": [
      "AW HEY DUDES! HEB JE MIJN MUSE NOG GEVONDEN?"
    ],
    "sculptor-resolution": [
      "OH, MIJN MUZE! JE HEBT HAAR GERED! AW, JIJ BENT ECHT DE BESTE!",
      "HIER, NEEM DEZE KRACHTCEL. IK HEB HET NIET NODIG NU IK MIJN INSPIRATIE TERUG HEB!"
    ],
    "sidekick-human-intro-sequence-b": [
      "VERDER JE ZOEKTOCHT NAAR ARTEFACTEN EN ECO.",
      "ALS DE LOCALS VOORLOPIGE ITEMS BEZITTEN, WEET U WAT U MOET DOEN.",
      "GA HARD OM MET IEDEREEN DIE HET DORP VERLAAT.",
      "WIJ ZULLEN HET TE TIJDE AANVALLEN."
    ],
    "sidekick-human-intro-sequence-c": [
      "WAT DOEN WE HIER ÜBERHAUPT, JAK? DEZE PLAATS GEEFT ME DE CREEPS!",
      "HUH?",
      "(GROEN) STOMME VOORLOPIGE JUNK!",
      "EK! WAT IS DAT DONKERE SLIJK? HET ZIET ER ZEKER NIET VRIENDELIJK UIT.",
      "DE WIJZE ZEURT DE HELE TIJD OVER DE PRECURSORS DIE DEZE PLEK GEBOUWD HEBBEN.",
      "\"WAAR ZIJN ZE GAAN? WAAROM HEBBEN ZE DEZE CRAP BOUWEN?\"",
      "IK HOU EVENVEEL VAN PRECURSOR ORBS EN ENERGIECELLEN ALS EENDER WIE.",
      "MAAR ALS JE HET MIJ VRAAGT, MOETEN HET ECHTE VERLIEZERS ZIJN GEWEEST.",
      "WAUW! HOE HEB JE DAT GEDAAN?",
      "JAK, IK DENK DAT WE IN DE PROBLEMEN ZITTEN!",
      "MAN, DAT SCHREEUWT.",
      "IK ZEI TOCH DAT WE HIER NIET HADDEN MOETEN KOMEN, EN JE HEBT GELUISTERD?",
      "WAT?",
      "WAAAAAAAAAHHHHHH!!",
      "OKE OKE. MET MIJ GAAT HET GOED, MET MIJ GAAT HET...",
      "WAAAAAAAAAHHHHHH!!"
    ],
    "warrior-introduction": [
      "OHH... MIJN PIJNE HOOFD.",
      "IK BETWIJFEL OF DAT EEN VAN JE BELANGRIJKSTE ORGANEN IS!",
      "LOOP HET UIT, STOERE KEREL!",
      "OH, NATUURLIJK, IK WAS EEN KEER STOER.",
      "MISSCHIEN ZELFS DE STERKSTE VAN ALLEN.",
      "IK HEB IN MIJN EIGEN HAND DIT DORP BIJNA EEN JAAR GEDURENDE HET VEILIGE TIJDPERK VERDEDIGEN TEGEN DIE AFGRIJSELIJKE WEZENS!",
      "TOEN ARRIVEERDE DAT VERSCHRIKKELIJKE MONSTER EN BEGON MET HET BOMBARDEMENT VAN DE ROTSBLOKKEN.",
      "DUS VOL MOED, PANTSER SCHIJNEND IN DE ZON...",
      "IK BEKLIMDE DE HEUVEL OM HET OP TE NEMEN MET HEM...!",
      "MAAR HIJ SLOEG ME ALSOF IEMAND EEN YAKOW-BIEFSTUK MALS MAAKT.",
      "HEB JE GEPROBEERD HEM AAN TE VALLEN MET JE MELODRAMA?",
      "OMDAT HET MIJ DOODT!",
      "NA MIJN LAATSTE VERBLUFFENDE MISLUKKING,",
      "HIJ SLOOT DE DOORGANG NAAR ZIJN SLAAPPLAATS AF MET EEN ROTSBLOK VAN 30 TON,",
      "ZODAT NIEMAND HEM NOG EEN KANS KON UITDAGEN.",
      "DUS BEDACHT ONZE WIJZE, EEN MEESTER IN BLAUWE ECO EN EEN MECHANISCH GENIE, EEN MACHINE",
      "KAN HET STEEN UIT DE WEG OPHEFFEN...!",
      "MAAR HELAAS, HIJ VERDWEEN VOORDAT WE DE KANS HADDEN OM HEM AAN TE ZETTEN.",
      "EN HIJ NAM AL ZIJN ENERGIECELLEN MEE.",
      "IK KON TENMINSTE GENOEG PONTONS UIT ONZE BRUG TREKKEN OM TE VOORKOMEN",
      "DAT MONSTER HIER NAAR BENEDEN KOMT OM MIJ KWETSEN TE DOEN.",
      "JA, GOED, GOEDE BAAN, STOERE KEREL. MAAR, EHM...",
      "WE HEBBEN JE NODIG OM, UH... ZE TERUG TE PLAATSEN, EN ZO.",
      "OH ZEKER! EN MIJN DOOM VERZEGELEN?",
      "(ZUCHT)",
      "AKKOORD. PRIMA.",
      "BRENG ME 90 VOORLOPIGE ORBS EN IK LAAT DE PONTONNEN LOS.",
      "MAAR IK GA NIET NOG EEN KEER TEGEN DAT MONSTER VECHTEN!"
    ],
    "warrior-reminder-1": [
      "NEEM ALLE TIJD DIE JE WILT OM MIJ DE VOORLOPER-ORBS TE BRENGEN",
      "IK BEN NIET VAN PLAN DE PONTONBRUG BINNENKORT TE REPAREREN."
    ],
    "warrior-resolution": [
      "OH.",
      "PRACHTIG.",
      "JE HEBT ME DE VOORLOPER-ORBS GEBRACHT.",
      "OKE.",
      "IK REPAREER DE BRUG.",
      "MAAR VRAAG MIJ NIET OM WEER BETROKKEN TE RAKEN BIJ DAT WEZEN!"
    ],
    "yellowsage-resolution": [
      "WIE DACHT DAT IK DE DAG ZOU LEVEN",
      "TOEN IK GERED MOEST WORDEN DOOR EEN JONGEN EN ZIJN MUSKRAAT!",
      "AHH... IK GAAT GOL EN MAIA",
      "EEN KLEINE TERUGBETALING VOOR DEZE VERGELIJKING!",
      "DAN ZULLEN WE ZIEN OVER HET KOKEN VAN MUSKRAT STOOFHOOFD...",
      "(GULPEN)"
    ]
  },
  "hints": {
    "ASSTLP01": [
      "HMM..."
    ],
    "ASSTLP02": [
      "WE MOETEN DIT HITTESCHILD AAN DE PRAAT KRIJGEN..."
    ],
    "ASSTLP03": [
      "WE HEBBEN ENERGIECELLEN NODIG VOOR HET HITTESCHILD..."
    ],
    "ASSTLP04": [
      "WAAR IS MIJN SPANNER?"
    ],
    "ASSTLP05": [
      "BRAND CANYON IS ZO HEET..."
    ],
    "ASSTLP23": [
      "HOE HEEFT HIJ DIE LEVITATOR AAN DE WERKING GEKREGEN?"
    ],
    "ASSTLP24": [
      "NU, ZELFS MET ENERGIECELLEN,",
      "ZULLEN WE GENOEG KRACHT HEBBEN?"
    ],
    "ASSTLP30": [
      "HM, LATEN WE EENS KIJKEN..."
    ],
    "ASSTLP31": [
      "HM."
    ],
    "ASSTLP32": [
      "OH MIJN..."
    ],
    "ASSTLP33": [
      "AH-HA!"
    ],
    "ASSTLP34": [
      "HUH... WAT ZIJN GOL EN MAIA VAN PLAN?"
    ],
    "ASSTLP35": [
      "HMM... WE MOETEN NAAR PRECURSOR CITY GAAN."
    ],
    "ASSTLP36": [
      "HUH. HET HITTESCHILD HEEFT NOG MEER KRACHT NODIG",
      "OM DE LAVA TE WEERSTAAN."
    ],
    "ASSTLP37": [
      "AW... WE MOETEN DE ANDERE WIJZEN REDDEN..."
    ],
    "BIL-AM01": [
      "IK HOU GEWOON VAN DE MODDER."
    ],
    "BIL-AM02": [
      "VERDOMME MOERARATEN."
    ],
    "BIL-AM03": [
      "IK HEB EEN GOED ONTWERP VAN MAMA'S MEDICIJN NODIG."
    ],
    "BIL-AM04": [
      "GLADIOLA."
    ],
    "BIL-AM05": [
      "IK HEB EEN BRUINE MEDICIJN NODIG."
    ],
    "BIL-AM06": [
      "IK HEB WAT ZOMERKOELVLOEISTOF NODIG."
    ],
    "BIL-AM07": [
      "VERDOMME, VAN DEZE HITTE WORD IK HELEMAAL STEKELIG."
    ],
    "BIL-AM08": [
      "DARN... DEZE HITTE GEEFT ME RASH."
    ],
    "BIL-AM1A": [
      "MM-MM! IK HOU VAN DE MODDER!"
    ],
    "BIL-AM2A": [
      "DARN MOERARATEN!"
    ],
    "BIL-AM2B": [
      "DARN MOERARATEN!"
    ],
    "BIL-LO01": [
      "FARTHIJ!"
    ],
    "BIL-LO02": [
      "SOIEE-SOIEE-SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO03": [
      "SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO1A": [
      "FARTHIJ!"
    ],
    "BIL-LO2A": [
      "SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO2B": [
      "SOJA! SOJA!"
    ],
    "BIL-TA01": [
      "PAK ZE!"
    ],
    "BIL-TA02": [
      "MOOI SCHOT!"
    ],
    "BIL-TA03": [
      "OVER DAAR!"
    ],
    "BIL-TA04": [
      "AW, PRUTS."
    ],
    "BIL-TA05": [
      "RAT HEEFT EEN SNACK."
    ],
    "BIL-TA06": [
      "EN EEN ANDER..."
    ],
    "BIL-TA07": [
      "ER IS ER NOG MAAR ÉÉN..."
    ],
    "BIL-TA08": [
      "HEBBES."
    ],
    "BIL-TA09": [
      "JAAAAA!"
    ],
    "BIL-TA1A": [
      "PAK ZE!"
    ],
    "BIL-TA2A": [
      "MOOI SCHOT!"
    ],
    "BIL-TA3A": [
      "OVER DAAR."
    ],
    "BIL-TA4A": [
      "VERDOMME!"
    ],
    "BIL-TA4B": [
      "VERDOMME!"
    ],
    "BIL-TA5A": [
      "RAT HEEFT EEN SNACK!"
    ],
    "BIR-AM01": [
      "BEN JIJ NOG IN DE BUURT VAN HET EI?"
    ],
    "BIR-AM02": [
      "DAT IS HET, NOG EEN KLEIN VERDER!"
    ],
    "BIR-AM03": [
      "OH, GOED, DRUK HET NU. OH, NU VOORZICHTIG!"
    ],
    "BIR-AM04": [
      "OH, MIJN, DAT WAS NIET ZACHTAARDIG!"
    ],
    "BIR-AM05": [
      "KOM OP, DUW HET EI VAN DE KLIP!"
    ],
    "BIR-AM06": [
      "OHH!"
    ],
    "BIR-AM07": [
      "OH, HIER, VOGEL VOGEL. HIER, VOGELVOGEL."
    ],
    "BIR-AM08": [
      "HIER, VOGELVOGEL."
    ],
    "BIR-AM09": [
      "WEES VOORZICHTIG, HET ZIET DAAR BOVEN NIET VEILIG UIT!"
    ],
    "BIR-AM10": [
      "VOORZICHTIG, GEMAKKELIJK DOET HET!"
    ],
    "BIR-AM11": [
      "GOED GEDAAN! ONTMOET ME NU HIER BIJ HET EI."
    ],
    "BIR-AM12": [
      "JE MOET EEN ECHTE DIERENLOVER ZIJN!"
    ],
    "BIR-AM13": [
      "ZIE JE DAAR NOG ANDERE VOGELS?"
    ],
    "BIR-LO01": [
      "(KUS) (FLUIT)"
    ],
    "BIR-LO02": [
      "OH MIJN, DAT IS EEN MOOIE."
    ],
    "BIR-LO03": [
      "OH KIJK, EEN MUCKY-MUCK."
    ],
    "BIR-am08": [
      "HIER, VOGEL VOGEL..."
    ],
    "BLU-AM01": [
      "EEN KLEIN BEETJE HULP ZOU GOED ZIJN!"
    ],
    "BLU-AM02": [
      "O, DIT IS EEN FIJNE PUINHOOP."
    ],
    "BLU-AM03": [
      "HMM, HET IS EEN ENIG ENIGMA WAAR WE VOOR ZIJN."
    ],
    "CHI-AM01": [
      "DIT IS EEN CATASTROF. EEN CATASTROF ZEG IK!"
    ],
    "CHI-AM02": [
      "ZE WILLEN DAT IK DE JUNGLE IN GA - IK! HO HO OH...",
      "IK ZOU EERDER EEN WOEDENDE FLUIT-FLUT WORSTELEN."
    ],
    "CHI-AM03": [
      "F-EERST IS DE VISSERSBOOT...",
      "HET WORDT AANGEVAL DOOR EEN MONSTER...",
      "EN NU, NU DIT...",
      "WAT KAN ER NOG MEER MISGAAN?"
    ],
    "CHI-AM04": [
      "IK NIET... IK WIL, IK WIL... OOH, MISSCHIEN MOET IK DE BELASTINGEN VERHOGEN...",
      "OM VOOR DEZE PUINHOOP TE BETALEN."
    ],
    "CHI-AM05": [
      "PROBLEMEN... PROBLEMEN... PROBLEMEN!"
    ],
    "CHI-AM06": [
      "(SOBS) IK ZAL NU NOOIT HERKOZEN WORDEN..."
    ],
    "CHI-AM07": [
      "(KREUNT) WAT IS ER GEBEURD MET DE ENERGIESTRAAL VAN HET DORP?"
    ],
    "CHI-AM08": [
      "IK... ZIJ, IK NIET... (MOMPELT)"
    ],
    "CHI-LO01": [
      "...WINDMOLEN, MONSTERS, KRACHT, HERVERKIEZING..."
    ],
    "CHI-LO02": [
      "...DE POLLS, IK... MONSTERS, HM... HERVERKIEZING, OH..."
    ],
    "EXP-AM01": [
      "IK MOET BINNENKORT OP REIS VERTREKKEN.",
      "IK HEB VOORLOPER-ORBS NODIG!"
    ],
    "EXP-AM02": [
      "EENS EENS ZIEN, WAAR MOET IK NU EERST GAAN? EH..."
    ],
    "EXP-AM03": [
      "OH IK MIS DE OPEN WEG."
    ],
    "EXP-AM04": [
      "ZO VEEL PLAATSEN OM TE ZIEN, EN ZO WEINIG TIJD."
    ],
    "EXP-AM05": [
      "IN MIJN TIJD KON JE DOOR DE LANDEN LOPEN",
      "ZONDER TE WORDEN AANGEVAL DOOR MONSTERS!"
    ],
    "EXP-LO02": [
      "IK HEB MEER VOORLOPER-ORBS NODIG."
    ],
    "EXP-LO1A": [
      "(MOMMEL)"
    ],
    "FAR-AM01": [
      "(SNURKT) HIER, BESSIE... HIER, BESSIE BESSIE...",
      "DAT IS EEN GOED MEISJE..."
    ],
    "FAR-AM02": [
      "IK MOET DE GEWASSEN BINNENBRENGEN VÓÓR DE JUNI-INSECTEN..."
    ],
    "FAR-AM2A": [
      "IK MOET DE GEWASSEN BINNENBRENGEN VOORDAT DE INSECTEN IN JUNI KOMEN..."
    ],
    "FAR-LO01": [
      "(SNURT)"
    ],
    "FAR-LO1A": [
      "(SNURT)"
    ],
    "FIS-AM01": [
      "GRR, DEZE VERDOMDE VISSEN...",
      "IK VANG ER NOOIT ÉÉN."
    ],
    "FIS-AM02": [
      "DIE MONSTERS DIE ME SCHIP BETEN",
      "ZAL ME BRAK MAKEN."
    ],
    "FIS-AM03": [
      "DRAT, DEZE BLIGHTERS!",
      "IN MIJ MAND, DARN FISHIES, KOM OP JA...",
      "HEE HIJ HIJ HIJ..."
    ],
    "FIS-AM04": [
      "OH, IK HOU VAN DE GEUR VAN VIS IN DE OCHTEND."
    ],
    "FIS-AM05": [
      "OOH IK ZOU WEL EEN GEZOUTEN VISLIP OP ROGGE KUNNEN GEBRUIKEN."
    ],
    "FIS-AM06": [
      "IK BEN LID VAN DE GROTE DIE WEGKWAM..."
    ],
    "FIS-LO01": [
      "GRR!"
    ],
    "FIS-LO03": [
      "HA HA HA HA HA HA!"
    ],
    "FIS-LO04": [
      "DARN VIS... ZE KOMEN NOOIT IN MIJ NET!"
    ],
    "FIS-LO05": [
      "HA HA HA HA HA HA HA!"
    ],
    "FIS-TA01": [
      "NAAR LINKS!"
    ],
    "FIS-TA02": [
      "JUIST MET JE!"
    ],
    "FIS-TA03": [
      "HIER KOMT EEN GROTE!"
    ],
    "FIS-TA04": [
      "JE HEBT EEN JUMBO GEMIST, LADDIE!"
    ],
    "FIS-TA05": [
      "MIS ZO ZO NIET MEER!"
    ],
    "FIS-TA06": [
      "STABIELE JONGEN."
    ],
    "FIS-TA07": [
      "JE ZEILEN ZWAGEN DOOR DE WIND, JONGEN."
    ],
    "FIS-TA08": [
      "GEMIST."
    ],
    "FIS-TA09": [
      "HET LIJKT EROP DAT JE EEN GROTER NET KUNT GEBRUIKEN..."
    ],
    "FIS-TA10": [
      "WEER GEMIST!"
    ],
    "FIS-TA11": [
      "BLIJF RUSTIG! JE BENT ER BIJNA..."
    ],
    "FIS-TA1A": [
      "LINKS!"
    ],
    "FIS-TA2A": [
      "RECHTS!"
    ],
    "GAM-AM01": [
      "HÉ, EEN KANS VAN TWINTIG OP ÉÉN IS NIET ZO SLECHT!"
    ],
    "GAM-AM02": [
      "NEE, HET WAS ZEKER!"
    ],
    "GAM-AM03": [
      "HEH HEH HEH... IK GA DE VOLGENDE KEER DE JACKPOT!"
    ],
    "GAM-AM04": [
      "HÉ! ALS IK EEN ORB HAD VOOR ELKE GEMIST KANS...!"
    ],
    "GAM-AM05": [
      "HOI! VATTEN KUNNEN TERUGKOMEN IN STIJL!"
    ],
    "GAM-AM06": [
      "OH... IK HEB EEN GELUKSPAAR NODIG."
    ],
    "GAM-AM07": [
      "AW, WAT ZIJN DE KANSEN OM NAAR EEN STAD TE VERHUIZEN DIE WORDT AANGEVALLEN?"
    ],
    "GAM-AM08": [
      "IK DACHT DAT IK EEN GOEDE TIP HAD!"
    ],
    "GAM-AM09": [
      "NOG EEN DAG, NOG EEN WEDDING."
    ],
    "GAM-AM10": [
      "IK WED DAT NIEMAND DAT MONSTER AANKAN."
    ],
    "GAM-AM11": [
      "HUH-HUH... IK MOET UITBETALEN EN VERDER GAAN."
    ],
    "GAM-AM12": [
      "EH, SOMS KUN JE GEWOON NIET WINNEN."
    ],
    "GAM-AM13": [
      "HÉ, WAAR LACH JE OM? AMUSE IK U?"
    ],
    "GEO-AM01": [
      "MM, INTERESSANTE STRATA..."
    ],
    "GEO-AM02": [
      "ARME MOLLETJES..."
    ],
    "GEO-AM03": [
      "INTERESSANT..."
    ],
    "GEO-AM04": [
      "VEEL SUCCES, JONGENS!"
    ],
    "GEO-AM05": [
      "SLECHTE LUIKERAARS..."
    ],
    "GEO-AM06": [
      "ROTSEN HEBBEN OOK GEVOELENS..."
    ],
    "GEO-AM07": [
      "HOUD VOL, KLEINTJES..."
    ],
    "GEO-AM08": [
      "NU KAN IK TERUG NAAR MIJN ONDERZOEK!"
    ],
    "GEO-LO01": [
      "IK MOET TERUGGAAN NAAR MIJN ONDERZOEK."
    ],
    "GEO-LO02": [
      "HM, DEZE STEEN IS HEEL OUD..."
    ],
    "GOL-AM01": [
      "JE GEEFT GEWOON NIET OP, TOCH?"
    ],
    "GOL-AM02": [
      "BINNENKORT ZAL DE DONKERE ECO VAN ONS ZIJN!"
    ],
    "GOL-AM03": [
      "MAAK ZE AF!"
    ],
    "GOL-AM04": [
      "VUUR!"
    ],
    "GOL-AM05": [
      "BLAST ZE!"
    ],
    "GOL-AM06": [
      "WAT? ZIJ WEER!"
    ],
    "GOL-AM07": [
      "HET IS TE LAAT!"
    ],
    "GOL-AM08": [
      "JIJ BENT VAN MIJ!"
    ],
    "GOL-AM09": [
      "IK HEB JE NU!"
    ],
    "GOL-AM10": [
      "HA HA HA HA HA!"
    ],
    "GOL-AM11": [
      "GEEN GENADE!"
    ],
    "GOL-AM12": [
      "NEEM DAT!"
    ],
    "GOL-AM13": [
      "GOED GEPROBEERD!"
    ],
    "GOL-AM14": [
      "BLIJF STAAN!"
    ],
    "GOL-AM15": [
      "ELLENDIG!"
    ],
    "GOL-AM16": [
      "NEE!"
    ],
    "GOL-AM17": [
      "AHHH!"
    ],
    "GOL-AM18": [
      "WIJ GAAN DE SILO HELEMAAL OPENEN EN JULLIE TWEE VERNIETIGEN!"
    ],
    "GOL-AM19": [
      "LICHT ECO! HET BESTAAT WEL!"
    ],
    "GOL-AM20": [
      "WIJ GAAN HET NIET AANNEMEN!"
    ],
    "MAI-AM01": [
      "MAAK ZE BEIDE VOOR EENS EN VOOR ALTIJD AF!"
    ],
    "MAI-AM02": [
      "HAAL ZE ERUIT!"
    ],
    "MAI-AM03": [
      "HA HA HA!"
    ],
    "MAI-AM04": [
      "ECO BESCHERMT U NU NIET!"
    ],
    "MAI-AM05": [
      "DOE IETS!"
    ],
    "MAI-AM06": [
      "AGH!"
    ],
    "MAI-AM07": [
      "NEEOOOO!"
    ],
    "MAI-AM08": [
      "WIJ OPENEN DE SILO HELEMAAL EN VERNIETIGEN JULLIE TWEE!"
    ],
    "MAI-AM09": [
      "ZE MOGEN HET NIET KRIJGEN!"
    ],
    "MIN-LO01": [
      "EEN VAN DEZE DAGEN ZAL IK RIJK ZIJN...",
      "JE BEDOELT DAT WE RIJK ZULLEN ZIJN!",
      "JA. WAT DAN OOK."
    ],
    "MIN-LO03": [
      "GRAF, WILLARD! GRAVEN!",
      "JA, MAAR JE GRAAFT NIET!",
      "DAT IS OMDAT IK AAN HET DENKEN BEN!"
    ],
    "MIN-LO04": [
      "DUH, GORDY? KAN IK EEN PAUZE NEMEN?",
      "OH, IK ZAL IETS BREKEN. GRAAG NU!"
    ],
    "MIN-LO05": [
      "IK HEB HONGER, GORDY!",
      "EET JE VOGEL!"
    ],
    "MIN-LO06": [
      "DUH, GORDY? IK HEB EEN SCHERPERE KEUZE NODIG.",
      "WAT JE NODIG HEBT IS EEN SCHERPER VERSTAND!"
    ],
    "MSH-AM01": [
      "WAH-HA-HA-HA-HA! IK GA RIJK WORDEN!"
    ],
    "MSH-AM02": [
      "JIJ JIJ JIJ!"
    ],
    "MSH-AM03": [
      "WILLARD! WERK HARDER, NIET SLIMMER!"
    ],
    "MSH-AM04": [
      "AH-HAH, IK WORD DE RIJKSTE MAN TER WERELD! AH HA HA..."
    ],
    "MSH-AM05": [
      "OH HO HO! NIEMAND HEEFT ZELFS EEN GEM VAN DEZE GROOT GEZIEN! AH HA HA!"
    ],
    "MSH-AM06": [
      "GEMAKKELIJKE STRAAT, HIER KOM IK!"
    ],
    "MSH-AM07": [
      "MIJN GEMEN! AL MIJN GEMEN!"
    ],
    "MSH-AM08": [],
    "MSH-AM09": [
      "(CHUCKLEND) IK KAN NIET WACHTEN OM DEZE BABY TE VERZILVEREN!"
    ],
    "MSH-AM10": [
      "DIT LIJKT OP EEN ZELDZAME KRISTIET ZLARCONIA! OH-HO-HO!"
    ],
    "MSH-AM11": [
      "WACHT NU EEN MINUUT! ZE ZIJN ALLEMAAL VAN MIJ! DE MIJNE, IK VERTEL HET JE!"
    ],
    "MSH-AM12": [
      "DUS WILLARD. WAT GA JE ERMEE DOEN",
      "UW KWARTAAL, VAN UW HELFT?"
    ],
    "MSH-AM1A": [
      "IK GA RIJK WORDEN!"
    ],
    "MSH-AM2A": [
      "JIJ JIJ JIJ!"
    ],
    "MSH-AM3A": [
      "WERK HARDER, NIET SLIMMER!"
    ],
    "MTA-AM01": [
      "DUH, ZIJN WE BIJNA KLAAR?"
    ],
    "MTA-AM02": [
      "GEE, KUNNEN WE EEN PAUZE NEMEN?"
    ],
    "MTA-AM03": [
      "AWW, IK HEB HONGER..."
    ],
    "MTA-AM04": [
      "DUH... IK DENK DAT DE VOGELKOOI SCHOONGEMAAKT MOET WORDEN..."
    ],
    "MTA-AM05": [
      "GOH, DAT IS EEN VRESELIJK GROOT JUWEELTJE!"
    ],
    "MTA-AM06": [
      "DUH... IK WIL ALTIJD HOUTHAAK WORDEN..."
    ],
    "MTA-AM07": [
      "DUH, GORDY BELOOFDE MIJ DE HELFT TE GEVEN VAN WAT IK KON DRAGEN!"
    ],
    "MTA-AM08": [
      "EH HEH... BIRDIE IS MIJN BESTE VRIEND..."
    ],
    "MTA-AM09": [
      "IK HOU VAN MIJN KLEINE VOGELTJE..."
    ],
    "RED-AM01": [
      "IS DAAR IEMAND?"
    ],
    "RED-AM02": [
      "GOED..."
    ],
    "RED-AM03": [
      "WAT HIELD JE OP?"
    ],
    "SAGELP03": [
      "DEZE TWEE KONDEN HUN OREN NIET DEBLOKKEREN..."
    ],
    "SAGELP04": [
      "HIJ ZAL NOOIT ZO ZIJN ALS ZIJN OOM...",
      "HET MAAKT MIJ NIET UIT WAT DE ANDEREN ZEGGEN."
    ],
    "SAGELP05": [
      "HALLO, BLAUWE WIJZE? HALLO?",
      "WAAR IN GODSNAAM ZOU HIJ ZIJN..."
    ],
    "SAGELP06": [
      "MIJN MIJN MIJN..."
    ],
    "SAGELP11": [
      "IEDEREEN? HELEMAAL IEDEREEN? KOM BINNEN?"
    ],
    "SAGELP20": [
      "HMM..."
    ],
    "SAGELP21": [
      "DE LURKERS MOETEN WORDEN GESTOPT."
    ],
    "SAGELP22": [
      "IK ZIE..."
    ],
    "SAGELP23": [
      "NEE..."
    ],
    "SAGELP24": [
      "WAT KAN ER MET HEN GEBEUREN?"
    ],
    "SAGELP31": [
      "DIT IS NIET GOED."
    ],
    "SAGELP32": [
      "DONKERE ECOKRISTALLEN?"
    ],
    "SAGELP33": [
      "MAIA EN GOL ZIJN ER NIET OVER UITGEKOMEN!"
    ],
    "SAGELP34": [
      "HNG, DE KRACHTEN VAN DARK ECO KUNNEN NIET WORDEN GECONTROLEERD!"
    ],
    "SAGELP35": [
      "DONKER ECO IN DE GLETSJERS?"
    ],
    "SAGELP36": [
      "AH! ER ZIJN LURKER TROEPEN IN DE BERGEN!"
    ],
    "SAGELP37": [
      "WAT IS GOL-PLANNING..."
    ],
    "SAGELP38": [
      "KAN HIJ ECHT...?"
    ],
    "SCU-AM01": [
      "AW... IK KAN HET GEWOON NIET MEER."
    ],
    "SCU-AM02": [
      "AW, IK WENS DAT IK WAT INSPIRATIE HAD."
    ],
    "SCU-AM03": [
      "IK BEN ZO GEÏNSPIREERD ALS... DEZE ROTS."
    ],
    "SCU-AM04": [
      "AW... WAAR IS MIJN MUSE?"
    ],
    "SCU-AM05": [
      "IK KAN ZO NIET WERKEN!"
    ],
    "SCU-AM06": [
      "AW MAN... ZAL ZE OOIT BIJ MIJ TERUGKOMEN?"
    ],
    "SCU-LO01": [
      "VERDORIE..."
    ],
    "SKSP009F": [
      "KRIJG IETS! KRIJG IETS! HA HA HA!"
    ],
    "WAR-LO1A": [
      "(SNIKKEN)"
    ],
    "WAR-LO1B": [
      "(JANKT)"
    ],
    "WAR-LO1C": [
      "(BLAAST NEUS EN SPUTTERT)",
      "(GAAT DOOR MET SNIKKEN)"
    ],
    "YEL-AM01": [
      "DE TIJD IS OP!"
    ],
    "YEL-AM02": [
      "HOI! HAAL ME HIER WEG!"
    ],
    "YEL-AM03": [
      "ALS IK HIER WEG BEGIN, BEGINNEN ER SCHIETEN!"
    ],
    "asstv100": [
      "OK, JULLIE HEBBEN GENOEG CELLEN OM DE KRACHT VAN HET HITTESCHILD TE VERHOGEN.",
      "RIJD MET DE HOUTEN MIJNKART NAAR DE SCHACHT BIJ DE LAVA-GEISER.",
      "IK ONTMOET JE BIJ DE INGANG VAN DE LAVA-BUIS,",
      "ZODAT IK DE ZOOMER KAN WIJZIGEN. HAAST JE!"
    ],
    "asstv101": [
      "HAHA, OKÉ! JE HEBT GENOEG CELLEN OM TE VERHOGEN",
      "DE STROOM OP HET HITTESCHILD.",
      "ONTMOET ME TERUG IN DE VULKANISCHE KRATER.",
      "IK WACHT BIJ DE LAVABUIS LANGS DE SCHACHT BIJ DE LAVAGEISER.",
      "BRENG ME DE ENERGIECELLEN!"
    ],
    "asstv102": [
      "HAAST JE MET DIE ENERGIECELLEN!",
      "IK WACHT BIJ DE HOUTEN MIJNKARSCHACHT, VLAKBIJ DE LAVAGEISER."
    ],
    "asstv103": [
      "VERGEET NIET DE TELEPORTPOORT AAN TE ZETTEN, ZODAT WIJ DOORKUNNEN.",
      "JE MOET NAAR HET LAB VAN DE RODE WIJZE",
      "IN HET CENTRUM VAN DE VULKANISCHE KRATER OM HET AAN TE ZETTEN.",
      "WIJ KUNNEN NIET DOORKOMEN TOTDAT HET WEER ONLINE IS."
    ],
    "asstv104": [
      "HEY, WE ZIJN NOG STEEDS TERUG IN ROCK VILLAGE!",
      "ZET DE TELEPORTPOORT AAN!"
    ],
    "asstv105": [
      "WIJ WILLEN MET JE MEE NAAR DE VULKAANSE KRATER!",
      "GA NAAR HET LAB VAN DE RODE WIJZE EN ZET DE POORT AAN."
    ],
    "asstva73": [
      "HALLO JONGENS! VOLGENS MIJN BEREKENINGEN GAAT HET DUREN",
      "72 ENERGIECELLEN OM HET HITTESCHILD TE DOEN WERKEN.",
      "TEGEN DE LAVA OP WEG NAAR GOL EN MAIA'S CITADEL."
    ],
    "asstva74": [
      "JULLIE HEBBEN NIET GENOEG ENERGIECELLEN OM DOOR DEZE LAVA TE GERAKEN!",
      "JE KUNT NIET DOOR NAAR GOL EN MAIA'S CITADEL",
      "TOT JULLIE 72 ENERGIECELLEN HEBBEN VERZAMELD!"
    ],
    "asstvb02": [
      "WAUW, HEB JE DAT GEZIEN?",
      "BLUE ECO VENTS ZIJN OVER DE HELE WERELD GEACTIVEERD!",
      "IK WIST DAT ER EEN MANIER WAS OM ZE AAN TE ZETTEN.",
      "ER MOETEN OOK PLAATSEN ZIJN OM DE ANDERE ECO-VENTILATOREN AAN TE ZETTEN."
    ],
    "asstvb03": [
      "GOED! JE HEBT ALLE MIJNEN-LUIKERAARS GESTOPT!",
      "ZE BEDREIGEN AL WEKEN DE WATEREN ROND ONS DORP.",
      "BRENG JE ZOOMER TERUG NAAR DE TRANS-PAD EN IK TELEPORTEER HEM TERUG!"
    ],
    "asstvb04": [
      "GOED, JULLIE HEBBEN GENOEG ENERGIECELLEN VERZAMELD OM MIJN HITTESCHILD VAN BRANDSTOF TE VOORZIEN!",
      "ONTMOET MIJ BIJ DE INGANG VAN DE FIRE CANYON",
      "DOOR DE KLIP ACHTER HET BOERENHUIS TE BEKLIMMEN.",
      "BRENG ME DE ENERGIECELLEN EN HAAST JE!",
      "MIJN VADER ZEGT DAT HIJ MEER LURKERS HEEFT GEZIEN!"
    ],
    "asstvb08": [
      "HAAST JULLIE MET DIE ENERGIECELLEN!",
      "IK WACHT AAN HET HOOFD VAN FIRE CANYON",
      "OP DE TOP VAN DE KLIP ACHTER HET BOERENHUIS!"
    ],
    "asstvb09": [
      "JULLIE HEBBEN NIET GENOEG ENERGIECELLEN OM MIJN HITTESCHILD VAN BRANDSTOF TE VOORZIEN.",
      "JE KAN NIET DOOR DE VUURVALLEI TOT JE GENOEG ENERGIECELLEN HEBT VERZAMELD."
    ],
    "asstvb20": [
      "GOED VLIEGEN! DIE LURKERS WAREN GEEN MATCH VOOR JE ZOOMER!",
      "DAT IS NOG EEN POWERCEL!"
    ],
    "asstvb21": [
      "GOED WERK! BEN JULLIE NIET GELUKKIG",
      "HEB JE ONZE KLEINE FLUT-FLUT VRIEND GERED?",
      "ZIJ KAN ER EENS WEER VAN HANDIGE KOMEN.",
      "GA NU TERUG NAAR HET TRANS-PAD, EN IK BEN HAAR NAAR HUIS."
    ],
    "asstvb22": [
      "WAUW! JE HEBT EEN STUK VAN DE ONDERWATERRUÏNES NAAR DE OPPERVLAKTE GEHOOGD!",
      "HET LIJKT DAT JE ECO KUNT GEBRUIKEN OP MANIEREN DIE WE NOG NOOIT EERDER HEBBEN GEZIEN!",
      "ER VERSCHEEN EEN KRACHTCEL IN DE KAMER. KLIM DAAR BOVEN EN KRIJG HET."
    ],
    "asstvb23": [
      "GOED GEDAAN! DE MENSEN VAN ROCK VILLAGE ADEMEN",
      "EEN COLLECTIEVE ZUCHT VAN OPLICHTING!",
      "MAAR ER IS GEEN TIJD OM TE VIEREN! GEBRUIK UW ZOOMER",
      "OM DE BERGPAS VOORUIT TE NAVIGEREN.",
      "WEES VOORZICHTIG, HET LIJKT DAT DE LURKERS HEBBEN GEZET",
      "DE HELE PAS MET EXPLOSIEVEN!",
      "WANNEER JE DE VULKANISCHE KRATER BEREIKT,",
      "ZORG ERVOOR DAT JE HET LAB VAN DE RODE WIJZE BEZOEKT",
      "EN ACTIVEER DE TELEPORTPOORT ZODAT VADER EN IK BIJ JOU KUNNEN KOMEN."
    ],
    "asstvb24": [
      "OH MIJN! DIE LURKERS MOETEN WEG GAAN",
      "VOOR EEN DETONATOR AAN HET EINDE VAN DE CANYON!",
      "ALS ZE HET BEREIKEN VOORDAT JIJ DAT DOET,",
      "ZE GAAN DE HELE PAS OPBLAZEN!",
      "JE MOET ZE DAAR VERSLAAN EN DE ONTSTEKER VERNIETIGEN,",
      "OF HET IS ALLES VOORBIJ!"
    ],
    "asstvb25": [
      "GOED WERK! JE VERSLAAT ZE MET DE ONTSTEKER!",
      "HET LAB VAN DE RODE WIJZE LIGT VERDEROP.",
      "GA DE TELEPORTPOORT AAN ZODAT WIJ MET U KUNNEN KOMEN."
    ],
    "asstvb28": [
      "HEY! VERGEET DE WIJZE EN MIJ NIET!",
      "JE MOET DE TELEPORTPOORT AANZETTEN OM ONS DOOR TE LATEN!",
      "HET IS IN HET LAB VAN DE BLAUWE WIJZE, AAN HET EINDE VAN DE VUURVALLEI.",
      "ALS U ONS NIET DOORLAAT, DAN KUNNEN WIJ U NIET HELPEN!"
    ],
    "asstvb29": [
      "HOI! WIJ WACHTEN NOG STEEDS!",
      "ZET DE TELEPORTPOORT AAN!"
    ],
    "asstvb30": [
      "HOI! WE KUNNEN NIET DOORKOMEN TOT DE TELEPORTPOORT AAN IS!"
    ],
    "asstvb40": [
      "DIT APPARAAT IS EEN COMMUNICATOR. MET HET, MIJN VADER EN IK",
      "KAN U OP ELK MOMENT ADVIES GEVEN TIJDENS UW ZOEKTOCHT."
    ],
    "asstvb41": [
      "DEZE DRIJVENDE EIVORMIGE DINGEN ZIJN VOORLOPIGE ORBS.",
      "VERZAMEL ER GENOEG VAN, EN SOMMIGE DORPEN ZULLEN JE GEVEN",
      "EEN KRACHTCEL IN UITWISSELING."
    ],
    "asstvb42": [
      "DIT IS EEN KRACHTCEL, HET BELANGRIJKSTE VOORLOPIGE ARTIFACT DAT U KUNT VINDEN!",
      "JE MOET 20 HIERVAN VERZAMELEN ZODAT IK HET HITTESCHILD KAN AANZETTEN",
      "VOOR UW A-GRAV ZOOMER."
    ],
    "asstvb44": [
      "HÉ, JE HEBT EEN VAN MIJN VERKENNINGSVLIEGEN GEVONDEN!",
      "IK HAD ER ZEVEN NAAR ELK GEBIED GESTUURD OM ENERGIECELLEN TE ZOEKEN.",
      "MAAR DE LURKERS MOETEN ZE ALLEMAAL HEBBEN GEVANGEN!"
    ],
    "asstvb45": [
      "WAUW! DIE LAATSTE VERKENNINGSVLIEG HAD EEN KRACHTCEL!",
      "IK WED DAT ALS JE ALLE 7 IN ELK GEBIED VERZAMELT",
      "JE KAN NOG MEER ENERGIECELLEN VINDEN."
    ],
    "asstvb46": [
      "WEES VOORZICHTIG IN DE OCEAAN, HET WATER ZIT VOL MET",
      "LURKER SHARKS EN IK HEB NOG NOOIT IEMAND EEN VERSLAG GEZIEN.",
      "BLIJF ER UIT DE BUURT ALS JE WEET WAT GOED VOOR JE IS!"
    ],
    "asstvb47": [
      "ONTHOUD, DAT IS EEN POWERCELL.",
      "JE MOET ZO VEEL DAARVAN VERZAMELEN ALS JE KAN."
    ],
    "asstvb48": [
      "DAT IS EEN BLAUWE ECO-VENT! MEER GECONCENTREERD DAN DE ZWEVENDE CLUSTERS,",
      "DEZE VENTILATIE GEEFT U EEN VOLLEDIGE LADING VAN BLUE ECO,",
      "ZODAT U HET VOOR DE MAXIMALE TIJD KUNT GEBRUIKEN."
    ],
    "asstvb71": [
      "JE HEBT NIET GENOEG ENERGIECELLEN OM DE MACHINE VAN DE BLAUWE WIJZE VAN ENERGIE TE VOORZIEN.",
      "WE KRIJGEN DIE ROTS NIET OMHOOG VOOR JE 45 ENERGIECELLEN HEBT VERZAMELD."
    ],
    "asstvb72": [
      "TOTDAT WE WETEN WAAROM DE BLAUWE SALIE VERDWENEN IS,",
      "JULLIE MOETEN 45 ENERGIECELLEN VERZAMELEN OM ZIJN MACHINE VAN BRANDSTOF TE VOORZIEN.",
      "PAK ZE!"
    ],
    "asstvb75": [
      "DEZE GONDEL LIJKT STOREND TE ZIJN.",
      "IK ZAL PROBEREN ERAAN TE WERKEN EN HET WEER AAN DE PRAAT TE KRIJGEN."
    ],
    "asstvb76": [
      "IK HEB DE GONDEL GEREACTIVEERD. HET KAN JE NAAR SNEEUWBERG BRENGEN!",
      "GEBRUIK HET WANNEER U WILT."
    ],
    "sagevb01": [
      "NOU, IK ZIE DAT JULLIE HET EINDELIJK HEBBEN GEDAAN",
      "BESLIST OM MIJN VERZAMELAARS TE DEBLOKKEREN.",
      "IK ZOU MIJN FELICITATIES AANBIEDEN",
      "MAAR JE HEBT ZOVEEL TE DOEN. IK ZAL JE TIJD NIET VERSPILLEN.",
      "TROUWENS, ALS HET NIET LUKT,",
      "DAXTER KAN ALTIJD EEN BAAN KRIJGEN OM HET DORPRATENPROBLEEM TE CONTROLEREN.",
      "JA HA HA HA HA HA."
    ],
    "sagevb02": [
      "IK MOET TOEGEVEN, IK BEN ONDER DE INDRUK. JULLIE TWEE HEBBEN HET NIET VERPEST!",
      "NU DE LURKERS DIE SILO NIET KUNNEN OPENEN",
      "ZE KUNNEN DE WERELD NIET OVERSPOELEN MET DONKERE ECO",
      "EN VEROORZAKEN ONVERMELDE VERNIETIGING.",
      "VEEG DIE BELACHELIJKE GRIJNS VAN JE GEZICHT, DAXTER!",
      "JULLIE TWEE HEBBEN GENOEG TE DOEN.",
      "GA ERVOOR!"
    ],
    "sagevb03": [
      "JE BLIJFT INDRUK OP MIJ MAKEN. MAAR DAN IS HET MISSCHIEN GEWOON OMDAT",
      "IK HEB LAGE VERWACHTINGEN.",
      "OKÉ, JE MOMENT VAN GLUNDEREN IS VOORBIJ.",
      "GA ERMEE DOOR!"
    ],
    "sagevb04": [
      "GOED WERK, JAK! JE OOM ZOU TROTS ZIJN.",
      "DAT WAS EEN REUZEARM VAN EEN VOORLOPIGE ROBOT.",
      "IK HEB NOG NOOIT ER EEN IN ZO'N GOEDE STAAT GEZIEN!",
      "IK KAN ME NIET VOORSTELLEN WAT DE LURKERS ERMEE WILDEN,",
      "MAAR WE WILDEN ZEKER NIET DAT ZE HET KREGEN.",
      "ALS JE DIT SUCCES VOLHOUDT...",
      "NEE, JE ZULT NOG STEEDS EEN HELD TEKORTSCHIETEN.",
      "MAAR BLIJF PROBEREN. HET IS VERTEDEREND."
    ],
    "sagevb21": [
      "DIE KLEINE GROENE ENERGIEBALLEN OP DE GROND ZIJN EEN SOORT ECO.",
      "PAK 50 KLEINE GROENE ECO'S OP, OF ÉÉN GROTE GROENE OM JE GEZONDHEID TE VERHOGEN."
    ],
    "sagevb22": [
      "DAT IS BLUE ECO, DAT DE ENERGIE VAN BEWEGING BEVAT.",
      "MET BLUE ECO KUNT U SNEL RENNEN, BREAKBOXEN EN ZELFS SOMMIGE PRECURSOR ACTIVEREN",
      "ARTEFACTEN ALS JE IN DE BUURT VAN HEN KOMT."
    ],
    "sagevb23": [
      "LET OP HOE U ELK BLAUW ECO-CLUSTER OPHAALT",
      "VERGROOT DE TIJD DAT U DE KRACHT KUNT GEBRUIKEN."
    ],
    "sagevb24": [
      "DIT IS EEN VOORLOPIGE DEUR.",
      "HET KAN ALLEEN WORDEN GEOPEND DOOR DE DEUR TE BENADEREN",
      "TERWIJL BLAUWE ECO DOOR JE LICHAAM KANALEN."
    ],
    "sagevb25": [
      "GOED WERK, DE BLAUWE ECO ZORGDE ERVOOR DAT DE DEUR OPENGING.",
      "MET BLUE ECO KUNT U ALLE SOORTEN ENERGIE ADEMEN",
      "VAN VOORLOPIGE ARTEFACTEN DIE JAREN IN SLAPEN HEBBEN GELAAGD."
    ],
    "sagevb26": [
      "GEBRUIK JE BRIL OM JE VOORUITGANG TE BEKIJKEN TIJDENS HET AVONTUUR."
    ],
    "sagevb27": [
      "JE KUNT ÉÉN ÉÉN SPRINGEN, DAARNA OPNIEUW IN DE LUCHT SPRINGEN OM NOG HOGERE RANDEN TE BEREIKEN."
    ],
    "sagevb28": [
      "WANNEER JE OMRINGD WORDT DOOR VIJANDEN, GEBRUIK JE SPIN KICK."
    ],
    "sagevb29": [
      "DAT IS GEEN SPIN-KICK! PROBEER HET NOG EENS."
    ],
    "sagevb30": [
      "KOM OP, JAK! DOE EEN SPINKICK."
    ],
    "sagevb31": [
      "GOED WERK. GEBRUIK DE SPIN KICK WANNEER JE EEN GOEDE ALLROUND AANVAL WILT."
    ],
    "sagevb32": [
      "VOOR EEN RECHTE LIJN, BEWEGENDE AANVAL, GEBRUIK JE VUIST OM TE SLAGEN."
    ],
    "sagevb33": [
      "DAT IS GEEN PUNCH-AANVAL! LATEN WE JE AL ZIEN PUNCH."
    ],
    "sagevb34": [
      "HOE! GEBRUIK EN PONS."
    ],
    "sagevb35": [
      "GOED WERK. GEBRUIK DE PUNCH OM AFSTAND SNEL TE SLUITEN OP EEN MOEILIJKE PLEK."
    ],
    "sagevb36": [
      "SOMS WIL JE DINGEN MET EEN GROTERE KRACHT AANRAKEN.",
      "OM EEN VAN DEZE DOZEN TE BREKEN, MOET JE IN DE LUCHT SPRINGEN",
      "EN DUIK ER DAN IN, MET JE HANDEN EERST."
    ],
    "sagevb37": [
      "ALS JE ENIG VERTROUWEN KRIJGT, PROBEER DAN ENKELE VAN JE MOVES IN COMBINATIES TE GEBRUIKEN."
    ],
    "sagevb38": [
      "JE KUNT NIET TERUG KOMEN DOOR DE WARPPOORT",
      "TOT JE DE VIER ENERGIECELLEN OP DIT EILAND VINDT."
    ],
    "sagevb39": [
      "FANTASTISCH! JE HEBT ALLE ENERGIECELLEN OP HET EILAND GEVONDEN!",
      "KOM TERUG NAAR DE WARPPOORT, ZODAT IK JE TERUG KAN BRENGEN NAAR HET LAB. HAAST JE!"
    ],
    "sksp0001": [
      "HOI! DIE LIEF UITZIENDE BABE KEIRA HAD GELIJK! ER ZIJN HIER TRANS-PADS."
    ],
    "sksp0002": [
      "VERTROUW ME, DIE DONKERE ECO-DOZEN ZIJN SLECHT NIEUWS!"
    ],
    "sksp0003": [
      "IK WED DAT ALS WE AL DIE ZIEKELIJKE, SCHATTIGE VERKENNINGSVLIEGEN OP ELK NIVEAU VINDEN",
      "MINSTENS ÉÉN HEEFT EEN POWERCEL!"
    ],
    "sksp0004": [
      "OKÉ, SCHAT!"
    ],
    "sksp0005": [
      "DEZE HOUTEN EN METALEN DOZEN ZIEN ER NIET STOER UIT!",
      "IK WED DAT ZE BREKEN ALS JE ER OP SPRINGT."
    ],
    "sksp0006": [
      "DIE VOLLEDIG METALEN DOZEN ZIJN DIKKER DAN EEN YAKOW-SCHEDEL!",
      "MAAR ER MOET IETS ZIJN DAT ZE OPEN KAN BRENGEN."
    ],
    "sksp0007": [
      "EEN WOORD: ENERGIECELLEN. WE MOETEN ZE VINDEN EN VOORLOPIG ZIJN WE NIET GOED BEZIG."
    ],
    "sksp0008": [
      "WIJ HEBBEN ORBS NODIG. ORBS, JAK! HOE GAAN OOIT KRACHTCELLEN KOPEN ALS WE GEEN ORBS VERZAMELEN!"
    ],
    "sksp0009": [
      "WAT EEN VREEMD DING! IK WED DAT WE DIT OPEN KUNNEN KRIJGEN",
      "ALS JE KRACHTIG BENT MET DAT ZAPPY BLAUWE ECO-STUFF."
    ],
    "sksp0010": [
      "HOI! LATEN WE DE SPEEDBOOT VAN OL' FISH BREATH GAAN BEKIJKEN AAN DE KADE!"
    ],
    "sksp0011": [
      "WE MOETEN DE VISSER BIJ DE JUNGLE RIVIER VRAGEN",
      "OF WE ZIJN SPEEDBOOT KUNNEN LENEN OM NAAR MISTY EILAND TE VAREN!"
    ],
    "sksp0013": [
      "HEB JE DE GROOTTE VAN DE BEET GEZIEN",
      "DIE LURKER-HAAI UIT DE BOOT VAN DE VISSER HEEFT GEHAALD?",
      "WIJ BLIJVEN HET BESTE UIT DE BUURT VAN HEN!",
      "IK DENK NIET DAT WE EEN WEZEN KUNNEN AANPAKKEN DAT SMERIG IS."
    ],
    "sksp0014": [
      "WE HEBBEN GENOEG LICHTBOLLEN VERZAMELD OM TE RUILEN VOOR EEN ENERGIECEL.",
      "LATEN WE TERUGGAAN EN DE OVERSTAP AL MAKEN!"
    ],
    "sksp0015": [
      "DIT MOET ZO'N PRECURSORORAKEL ZIJN WAAR DE WIJZE HET ALTIJD OVER HEEFT.",
      "IK HOOP DAT ZE PERSOONLIJK NIET ZO LELIJK WAREN!"
    ],
    "sksp0017": [
      "WOW! KIJK EENS NAAR DAT FUNKY BEELDHOUWWERK",
      "ZIT DAAR OP DE ROTSEN!"
    ],
    "sksp0018": [
      "WE MOETEN DIE WINDZAK VAN EEN BURGEMEESTER GAAN VERTELLEN DAT HIJ ONS GROTE SCHULDEN HEEFT",
      "VOOR HET AANSLUITEN VAN DE DORPSENERGIESTRAAL!"
    ],
    "sksp0019": [
      "HÉ, ZEEMEEUWEN! LATEN WE ZE ZOEMEN VOOR SCHOPPEN."
    ],
    "sksp0020": [
      "JA HAHA! LATEN WE DAT OPNIEUW DOEN!"
    ],
    "sksp0021": [
      "DAAR ZIJN DIE MEEUWEN WEER. LATEN WE ZE PAKKEN!!"
    ],
    "sksp0022": [
      "JA HA HA HA HA HA!! WOO HO HO HO!"
    ],
    "sksp0023": [
      "WOEHOOO!"
    ],
    "sksp0024": [
      "JA HA HA! JA!"
    ],
    "sksp0025": [
      "WAUW! ZE HEBBEN EEN LAWINE VEROORZAAKT! LATEN WE HET BEKIJKEN."
    ],
    "sksp0026": [
      "HOI! DIE PELIKAAN HEEFT NET EEN KRACHTCEL GEGREPEN!",
      "LATEN WE EEN GROTE VOGELKONT GAAN SCHOPPEN!"
    ],
    "sksp0027": [
      "SNEL! WE MOETEN BIJ DE ENERGIECELLEN ZIJN VOORDAT DE PELIKAAN HEM WEER OPPAKT."
    ],
    "sksp0028": [
      "SCHOP HET EI! HEE HEE! SCHOP HET! SCHOP HET!"
    ],
    "sksp0029": [
      "EH, WE WILLEN MISSCHIEN MET DE VOGELWATCHER PRATEN",
      "EN KIJKEN OF WE DAT FLUT-FLUT EI HEBBEN GEKRUIST."
    ],
    "sksp0030": [
      "HÉ, PROBEER TEGEN DE ROTSEN TE SLAAN OM ZE UIT DE WEG TE RUIMEN!"
    ],
    "sksp0031": [
      "OOO! LATEN WE HET KANON GEBRUIKEN OM DINGEN OP TE BLAZEN!"
    ],
    "sksp0034": [
      "AWOOGA! AWOOGA! DUIK VOOR DIE ORBS, JAK, DUIK!"
    ],
    "sksp0035": [
      "JA, DUS WE HEBBEN HIER EEN PRECURSOR LAUNCHER",
      "MAAR JE BENT NIET KRACHTIG MET HET BLAUWE STUFF. DUS HET GAAT ONS NIET HELPEN!"
    ],
    "sksp0037": [
      "DIE TOREN DOOHICKEYS DIE OVER DE JUNGLE VERSPREID ZIJN, MOETEN DE ECO-STRAL OMLEIDEN.",
      "LATEN WE MET ZE GAAN SPELEN!"
    ],
    "sksp0038": [
      "HMM, ALS BLUE ECO EEN BRUG KAN BOUWEN, DAN WEDDEN DAT HET EEN DEUR OPENT!",
      "LATEN WE TERUGGAAN EN JE WEER SAP LATEN MAKEN."
    ],
    "sksp0039": [
      "HEY, ER ZIJN KLEINE BLIKSEMSCHEUREN OP DIE PALEN",
      "EN ER KOMT BLIKSEM UIT DIE VENTILATIEOPENING DAAR.",
      "DENK JIJ WAT IK DENK?"
    ],
    "sksp0040": [
      "LATEN WE OP DIE MACHINE GAAN STAAN EN DE SPIEGEL BREKEN DIE DE VOORLOPERSTRAAL OMLEIDT!"
    ],
    "sksp0041": [
      "WE MOETEN NAAR DE TOP VAN DIE TOREN KOMEN!"
    ],
    "sksp0043": [
      "MISSCHIEN MOETEN WE DIE VISSER EENS UITROEIEN.",
      "IK HOORDE DAT HIJ IN DE JUNGLE AAN HET VISSEN WAS BIJ DE LOWER RIVER!"
    ],
    "sksp0049": [
      "LIJN DE STRAAL OP EEN LIJN DOOR HEM OP DE VOLGENDE TOREN TE RICHTEN!"
    ],
    "sksp0050": [
      "BREEK DE SPIEGEL, JAK!"
    ],
    "sksp0051": [
      "KRIJG DE INSECTEN, JAK! KRIJG DE INSECTEN!"
    ],
    "sksp0052": [
      "LATEN WE NAAR DE VOLGENDE TOREN GAAN EN DE STRAAL DAAR OPNIEUW AANSLUITEN!"
    ],
    "sksp0053": [
      "HOI! WE KUNNEN DE STRAAL VOLGEN OM DE VOLGENDE TOREN TE VINDEN."
    ],
    "sksp0054": [
      "WE MOETEN JE OPLADEN MET DAT BLAUWE DINGEN OM DIT OPEN TE KRIJGEN!"
    ],
    "sksp0056": [
      "HOI! IK ZIE DE MUZE VAN DE BEELDHOUWER!"
    ],
    "sksp0059": [
      "DEZE PLAATS GEEFT ME DE WILLIES!",
      "LATEN WE JE UIT DE SLIJK HOUDEN, OKÉ?"
    ],
    "sksp0060": [
      "(WHIMPERS) DEZE PLEK GEEFT MIJ DE KRIEBELS!",
      "EN VERTROUW ME, HET IS EEN HELE NIEUWE ERVARING",
      "WANNEER JE BEDEKT BENT MET FUZZ!"
    ],
    "sksp0062": [
      "LATEN WE IN DIE BALLONLOERDERS PLOGEN EN ZE VERSNIJDEN!"
    ],
    "sksp0063": [
      "IK ZEI: \"VERSNIPPER DE LOERKERS\", JAK. NIET DE MIJNEN!",
      "REGEL NUMMER EEN: VERMIJD ALTIJD DE MIJNEN!"
    ],
    "sksp0064": [
      "KIJK UIT! JE HERINNERT WAT ER DE LAATSTE KEER IS GEBEURD DAT WE HIER WAREN."
    ],
    "sksp0067": [
      "VAL NIET IN DE MIST BENEDEN ONS!",
      "WANT IK DENK NIET DAT WE HET TERUGKRIJGEN."
    ],
    "sksp0069": [
      "HET IS EEN HINDERLAAG, JAK! HET IS EEN HINDERLAAG!"
    ],
    "sksp0070": [
      "SPRING, DAN DUIK OP DE WIMPELT."
    ],
    "sksp0071": [
      "KRIJG DE RODE ECO!"
    ],
    "sksp0072": [
      "RED ECO MAAKT JE AANVALLEN KRACHTIGER."
    ],
    "sksp0073": [
      "WE HEBBEN BLUE ECO NODIG OM DIT PLATFORM OP TE LADEN!"
    ],
    "sksp0076": [
      "JAK! MAAK ENKELE SPRONGEN OM ONS VAN DE HETE GROND TE HOUDEN."
    ],
    "sksp0077": [
      "BALLONNEN GOED, BRANDENDE HETE MAGMA SLECHT!"
    ],
    "sksp0078": [
      "RIJD OP DE VERHOOGDE VOORLOPIGE STUFF OM ONS KOEL TE HOUDEN."
    ],
    "sksp0079": [
      "AHH! IK GA DOOD! IK KOM ERAAN, OPA!",
      "JE MOET DIT DING NAAR DE ANDERE KANT KRIJGEN VOORDAT HET OVERVERHITT!"
    ],
    "sksp0080": [
      "GEBRUIK DE HOP-TURN OM HARDER TE STUUREN!"
    ],
    "sksp0081": [
      "AHH! MISSCHIEN MOET IK RIJDEN!"
    ],
    "sksp0082": [
      "JE PROBEERT DIE DONKERE ECOBOXEN TE VERMIJDEN, TOCH?"
    ],
    "sksp0083": [
      "OOO! KIJKEN OF WE DE LUCHT VAN DIE LURKERS KUNNEN OPVANGEN!"
    ],
    "sksp0084": [
      "TE DICHT, TE DICHT!"
    ],
    "sksp0085": [
      "WAUW! DEZE BABY WORDT VEEL TE WARM!"
    ],
    "sksp0086": [
      "NOG EEN PAAR SECONDEN EN WE ZIJN GEBRADEN FLUT-FLUT!"
    ],
    "sksp0087": [
      "SLAAT DIE BALLONNEN OM AF TE KOELEN!"
    ],
    "sksp0088": [
      "HIER KOMT NOG EEN BALLON!"
    ],
    "sksp0089": [
      "IK WOU DAT IK VANOCHTEND HAD GESLAPEN!"
    ],
    "sksp0090": [
      "JE HEBT EEN BALLON GEMIST! WIJ HEBBEN DIE NODIG OF WE ZIJN GEKOOKT!"
    ],
    "sksp0091": [
      "DEZE PUPPY WORDT TE HEET!"
    ],
    "sksp0092": [
      "RUIK JIJ IETS DAT BRANDT?!"
    ],
    "sksp0093": [
      "IK DENK DAT MIJN STAART IN BRAND STAAT!"
    ],
    "sksp0094": [
      "ZE GAAT ONTPLOFFEN!"
    ],
    "sksp0095": [
      "WAUW! WE MAAKTEN HET!"
    ],
    "sksp0096": [
      "ER ZIJN HIER OOK SCOUTVLIEGEN!"
    ],
    "sksp009a": [
      "HA HA! WE LIETEN HEM EEN PAAR DINGEN ZIEN."
    ],
    "sksp009b": [
      "OKÉ, MEER ORBS!"
    ],
    "sksp009c": [
      "DOE MIJ EEN PLEZIER EN BLIJF UIT DE BUURT VAN DIE DONKERE ECODOZEN!"
    ],
    "sksp009d": [
      "JA-HA-HA-HA!"
    ],
    "sksp009e": [
      "WA-HOE!"
    ],
    "sksp009f": [
      "KRIJG WAT, KRIJG WAT! HA HA HA!"
    ],
    "sksp009g": [
      "RECHTS ACHTER JE, JAK!"
    ],
    "sksp009i": [
      "HEBBEN WE ALLE VERKENNINGSVLIEGEN IN DIT GEBIED GEVONDEN?"
    ],
    "sksp009j": [
      "HOI! HET LIJKT DAT VERKENNINGSVLIEGEN ALTIJD IN RODE DOZEN ZIJN."
    ],
    "sksp009k": [
      "AKKOORD! JE HEBT ALLE VERKENNINGSVLIEGEN IN DIT GEBIED GEVONDEN!"
    ],
    "sksp0109": [
      "WOO! WIJ VERSLAAN DE RECORDTIJD!"
    ],
    "sksp0110": [
      "IK HEB HET AL EERDER GEZEGD, IK ZEG HET NOG EEN KEER...",
      "VERMIJD DE DONKERE ECO DOZEN!"
    ],
    "sksp0111": [
      "LATEN WE DIE MOLLEN TERUG ONDERGRONDS ACHTERVOLGEN."
    ],
    "sksp0112": [
      "LATEN WE ONZE ENERGIECEL BIJ DE GEOLOOG HALEN."
    ],
    "sksp0113": [
      "DAT MOETEN DE BESMETTE PLANTEN ZIJN WAAR DE LOG-NOGGIN HET OVER HAD."
    ],
    "sksp0114": [
      "WE MOETEN GROENE ECO GEBRUIKEN OM DIE PLANTEN TE GENEZEN."
    ],
    "sksp0115": [
      "JAK, RIJD DOOR DE GROENE ECO-VENT."
    ],
    "sksp0116": [
      "DAT IS EEN VAN DIE VLIEGENDE LURKERS!",
      "HIJ KAN EEN KRACHTCEL HEBBEN!"
    ],
    "sksp0117": [
      "DAAR IS HET MOLGAT!"
    ],
    "sksp0118": [
      "LATEN WE NU OVER DE BESMETTE PLANTEN VLIEGEN!"
    ],
    "sksp0119": [
      "ÉÉN RING OMLAAG, NOG EEN BOSJE TE GAAN!"
    ],
    "sksp0120": [
      "HAAST JE! ER IS DE VOLGENDE RING!"
    ],
    "sksp0121": [
      "SNEL! JE MOET DOOR ELKE RING VLIEGEN VOORDAT ZE UITSCHAKELEN!"
    ],
    "sksp0122": [
      "HOI! DAT GRAS VERTRAAGT ONS..."
    ],
    "sksp0123": [
      "SNEL! VOLG DIE PIJP!"
    ],
    "sksp0124": [
      "IK HEB HIER EEN SLECHT GEVOEL OVER."
    ],
    "sksp0125": [
      "HET LIJKT DAT DIE DINGEN EEN BLAUWE ECO-LADING NODIG HEBBEN."
    ],
    "sksp0126": [
      "LATEN WE DE KRACHTCEL OP HET DAK VAN DIT DING PLAATSEN!"
    ],
    "sksp0127": [
      "SCHOP DE KLEINE MAN OP DE BOVENKANT!"
    ],
    "sksp0128": [
      "JAK! LOOP! DE DONKERE ECO STIJGT!"
    ],
    "sksp0129": [
      "AHH! DIE DONKERE ECO KOMT DICHTBIJ"
    ],
    "sksp0130": [
      "UH, IK DENK DAT WE AL DIE PLATFORMS OF IETS ANDERS MOETEN INSCHAKELEN."
    ],
    "sksp0131": [
      "HEY! HET LIJKT EROP DAT JE OP DIE KERELS KUNT SPRINGEN!"
    ],
    "sksp0132": [
      "EE-EE! WAUW! WIE-AH! WIE-AHH!"
    ],
    "sksp0133": [
      "IK WED DAT WE AL DIE DINGEN IN ÉÉN KEER IN REKENING KUNNEN KRIJGEN!"
    ],
    "sksp0134": [
      "ZULLEN WE HET RUSTIG AAN DOEN MET DIE HETE PIJPEN?!"
    ],
    "sksp0135": [
      "DAT WATER ZIET GEVAARLIJK UIT ALS HET VAN KLEUR VERANDERT!"
    ],
    "sksp0136": [
      "JE MOET UIT HET WATER KOMEN VOORDAT HET VAN KLEUR VERANDERT!"
    ],
    "sksp0137": [
      "IK WED DAT WE DIE ROTSBLOKKEN KUNNEN NEERSCHIETEN ALS WE ZIJN OPGELADEN MET EEN GELE ECO."
    ],
    "sksp0138": [
      "WE MOETEN DIE GROTE KETTINGEN SCHIETEN DIE DE TAND HOUDEN."
    ],
    "sksp0139": [
      "MISSCHIEN MOETEN WE DIE GEK HELPEN ZIJN HUISDIER TE VINDEN."
    ],
    "sksp0140": [
      "DE FLUT-FLUT KAN VERDER GLIJDEN ALS ZE WEER IN DE LUCHT SPRINGT!"
    ],
    "sksp0141": [
      "RAAK DIE ZWARTE HETE TEER NIET AAN, ANDERS KRIJG JE PERSOONLIJK!"
    ],
    "sksp0142": [
      "HET WATER IS VEILIG OM IN TE WACHTEN."
    ],
    "sksp0143": [
      "WAAH! BREEK DE GREEP VAN DE TONG!"
    ],
    "sksp0144": [
      "SCHIET DIE RATTENNESTEN NEER OM TE VOORKOMEN DAT DE RATTEN NAAR BUITEN KOMEN."
    ],
    "sksp0145": [
      "WAUW! JE KUNT VUURBALLEN SCHIETEN",
      "WANNEER JE KRACHTIG BENT MET GELE ECO."
    ],
    "sksp0146": [
      "HOI! DAT IS GELE ECO!"
    ],
    "sksp0147": [
      "JE KUNT DAAR AAN DIE PAL SLAPEN!"
    ],
    "sksp0148": [
      "PAS OP, DIE BRUSSEL IS STEKELIG!"
    ],
    "sksp0149": [
      "HÉ, DAT ZIET ERUIT ALS EEN KETTING DIE DE DIRIGIBLE OP ZIJN PLAATS HOUDT!"
    ],
    "sksp0150": [
      "KIJK UIT WANNEER DIE KIKKER IS OPGELADEN!"
    ],
    "sksp0151": [
      "REN WEG, JAK!"
    ],
    "sksp0152": [
      "KIJK UIT, JAK! HET IS EEN HINDERLAAG!"
    ],
    "sksp0153": [
      "HÉ, DAT MOET HET VOORLOPERARTEFACT ZIJN WAAR DE LOERKERS NAAR OP ZOEK ZIJN!",
      "HET LIJKT ALS EEN REUZE ROBOTARM!"
    ],
    "sksp0154": [
      "DIE ZWARTE TEER ZIET HEET EN GEVAARLIJK UIT!"
    ],
    "sksp0155": [
      "SCHIET DE VLEERMUIZEN MET DAT GELE ECO STUFF!"
    ],
    "sksp0156": [
      "MISSCHIEN KUNNEN WE DE VLEERMUIZEN ONTWIJKEN!"
    ],
    "sksp0157": [
      "HEB JE DAT GEZIEN? NOG NOG DRIE TETHERS TE GAAN!"
    ],
    "sksp0158": [
      "WAUW! NOG SLECHTS TWEE TETHERS."
    ],
    "sksp0159": [
      "DAT DRIGIBLE KAN NOG MAAR OVERHANGEN! LAAT ONS DE LAATSTE KABEL VINDEN!"
    ],
    "sksp0160": [
      "HOI! ER IS DE FLUT-FLUT!"
    ],
    "sksp0161": [
      "IK HAAT RATTEN! EN IK BEN BIJNA EEN VAN HEN."
    ],
    "sksp018a": [
      "DIE LUIE BOER IS ONS EEN ENERGIECEL SCHULDIG!",
      "LATEN WE MET HEM GAAN PRATEN!"
    ],
    "sksp0300": [
      "WE MOETEN DIE LURKERS VERSLAAN TOT HET EINDE VAN DE PAS!"
    ],
    "sksp0301": [
      "RAAK DEZE EXPLOSIEVEN NIET!"
    ],
    "sksp0302": [
      "BLIJF HEN VOOR EN WE HEBBEN HET GEMAAKT!"
    ],
    "sksp0303": [
      "GEBRUIK DE BLAUWE ECO OM SNELHEIDSVERHOGINGEN TE KRIJGEN!"
    ],
    "sksp0304": [
      "BLIJF JE BEWEGEN DOOR DE BOMEN, JAK! ZE MAKEN ONS TRAGER!"
    ],
    "sksp0305": [
      "HOE MEER BLAUWE ECO WE RAKEN, HOE SNELLER WE GAAN!"
    ],
    "sksp0306": [
      "PAS OP VOOR DEZE EXPLOSIEVEN!"
    ],
    "sksp0307": [
      "BLIJF UIT DE BUURT VAN DE PITS!"
    ],
    "sksp0308": [
      "MISSCHIEN MOET IK RIJDEN!"
    ],
    "sksp0309": [
      "ER IS EEN VAN DE LURKERS!"
    ],
    "sksp0310": [
      "VANG ZE HOE!"
    ],
    "sksp0311": [
      "WIJ ZIJN ER ÉÉN GEPASSEERD!"
    ],
    "sksp0312": [
      "WAH, EEN VAN DE LURKERS GAAT ONS VOOR!"
    ],
    "sksp0313": [
      "ZE ZIJN VER VOORUIT!"
    ],
    "sksp0314": [
      "JA, WIJ STAAN AAN DE LEIDING!"
    ],
    "sksp0315": [
      "SNELLER, ZOALS, SNELLER!"
    ],
    "sksp0316": [
      "GROTE SPRING, GROTE SPRING!"
    ],
    "sksp0317": [
      "WACHT EVEN!"
    ],
    "sksp0318": [
      "JA!"
    ],
    "sksp0319": [
      "HET IS DICHT!"
    ],
    "sksp0320": [
      "ZE GAAN ONS VERSLAAN MET DE ONTSTEKER!"
    ],
    "sksp0321": [
      "WE HEBBEN HET GEDAAN! WIJ HEBBEN HEN ERVAN WEERHOUDEN DE PAS OP TE BLAZEN!"
    ],
    "sksp0327": [
      "IK DENK DAT DAT HET LAATSTE DONKERE ECO-KRISTAL WAS!"
    ],
    "sksp0328": [
      "MISSCHIEN KUN JE BETER SCHIETEN ALS JE DOOR JE BRIL RICHT."
    ],
    "sksp0329": [
      "O, NEE! NOG MEER DONKER ECO!"
    ],
    "sksp0330": [
      "IK DENK NIET DAT WE AL DIE DONKERE ECOKRISTALLEN HEBBEN."
    ],
    "sksp0331": [
      "SCHIET DE LUIKERAARS DIE DE PALEN ETEN!"
    ],
    "sksp0332": [
      "LAAT DE LICHTEN NIET UITDOEN!"
    ],
    "sksp0333": [
      "RAAK EEN KRISTAL OM WAT LICHT TE KRIJGEN."
    ],
    "sksp0334": [
      "REN WEG! DAT KRISTAL GAAT BLAZEN!"
    ],
    "sksp0335": [
      "EWH, ZE HEBBEN EEN VOORLOPIGE ROBOT GEVONDEN!"
    ],
    "sksp0336": [
      "POP DE EIEREN, VOORDAT ZE UITKOMEN!"
    ],
    "sksp0337": [
      "HET IS HIER GRIEZELIG..."
    ],
    "sksp0338": [
      "HET LIJKT EROP DAT SPINNENWEBEN GEBROKEN NA TWEE STUITERS."
    ],
    "sksp0339": [
      "IK HAAT. SPINNEN..."
    ],
    "sksp0340": [
      "BABY SPINNEN KOMEN ERAAN!"
    ],
    "sksp0341": [
      "IK DENK DAT WE HIER IN EEN SPINNENNEST ZITTEN!"
    ],
    "sksp0342": [
      "KIJK UIT, MEER SPINNEN!"
    ],
    "sksp0343": [
      "LATEN WE HIER WEGGAAN!"
    ],
    "sksp0345": [
      "HOE KOMEN WE DIT FORT BINNEN?"
    ],
    "sksp0346": [
      "MISSCHIEN KAN RODE ECO DEZE KEREL VERSLAAN!"
    ],
    "sksp0347": [
      "WIJ MOETEN EEN ROLL-SPRONG DOEN!"
    ],
    "sksp0348": [
      "WE MOETEN EEN MANIER VINDEN OM DEZE OPENING TE OPENEN!"
    ],
    "sksp0349": [
      "DAT LIJKT DAAR ALS EEN ECO-SCHAKELAAR!"
    ],
    "sksp0350": [
      "SLAAT HEM ALS DE SPIKES BINNEN ZIJN!"
    ],
    "sksp0351": [
      "DRUK OP DE KNOP!"
    ],
    "sksp0352": [
      "SNEL! VOORDAT ZE TERUG NALEREN!"
    ],
    "sksp0359": [
      "JE MOET RODE ECO GEBRUIKEN!"
    ],
    "sksp0360": [
      "OKE! WIJ HEBBEN DE GELE ECO-VENTILATOREN MET AFDEKSEL AANGEBRACHT!"
    ],
    "sksp0362": [
      "KIJK! EEN BEVROREN KRACHTCEL!"
    ],
    "sksp0363": [
      "ALLEEN EEN FLUITFLUIT KAN ZO VER SPRINGEN!"
    ],
    "sksp0364": [
      "WE MOET HAAST, OF WE TOASTEN!"
    ],
    "sksp0365": [
      "KIES EEN PAD, ELK PAD!"
    ],
    "sksp0366": [
      "VERMIJD OF BOOT DE MIJNEN, JAK!"
    ],
    "sksp0367": [
      "VIND EEN WEG DOOR DIE DONKERE ECO-VATTEN!"
    ],
    "sksp0368": [
      "BLIJF DIE KOELBALLONNEN SLAAN!"
    ],
    "sksp0369": [
      "HET WORDT TE WARM!"
    ],
    "sksp0370": [
      "ZE GAAT ONTPLOFFEN!"
    ],
    "sksp0371": [
      "GA VOOR DE BLAUWE ECO, JAK!"
    ],
    "sksp0372": [
      "SCHIET JE EEN WEG DOOR!"
    ],
    "sksp0373": [
      "WAUW! WAT EEN RIT!"
    ],
    "sksp0374": [
      "JA! DRAAIEN EN BRANDEN, SCHAT!"
    ],
    "sksp0375": [
      "SCHIET MET DE POWER BOLLETJES OM DE DEUR TE OPENEN!"
    ],
    "sksp0376": [
      "SCHIET DE KRACHTGEBIEDEN VOORDAT WE VERBRANDEN!"
    ],
    "sksp0378": [
      "DE DEUR IS OPEN, LATEN WE GAAN!"
    ],
    "sksp0379": [
      "ZOOMEN!"
    ],
    "sksp0380": [
      "WIJ HEBBEN HET DOORGEBRACHT!"
    ],
    "sksp0381": [
      "BREEK DE GENERATOR OM DE WIJZE TE BEVRIJDEN!"
    ],
    "sksp0382": [
      "HOUD GEWOON AAN DE RAND!"
    ],
    "sksp0383": [
      "WE HEBBEN GEZELSCHAP, JAK. LURKERS VAN LURKERS!"
    ],
    "sksp0384": [
      "VERNIETIG DIE GENERATOREN!"
    ],
    "sksp0385": [
      "DRUK OP DE KNOP!"
    ],
    "sksp0386": [
      "DIE ROBOT MAAKT MIJ NIET BANG!"
    ],
    "sksp0387": [
      "LATEN WE DIE PLATFORMEN BEKLIMMEN!"
    ],
    "sksp0388": [
      "MIS DE VOLGENDE LANCERING NIET!"
    ],
    "sksp0389": [
      "BEKIJK HET!"
    ],
    "sksp0390": [
      "WE MOETEN ALLE WIJZEN REDDEN!"
    ],
    "sksp0391": [
      "DENK JE DAT GOL ME NOG STEEDS TERUG ZAL VERANDEREN?"
    ],
    "sksp0392": [
      "DUS DIT IS GOL EN MAIA'S CITADEL. LEUK EN GEZELLIG."
    ],
    "sksp0393": [
      "LAND OP DE VOLGENDE LAUNCHER!"
    ],
    "sksp0394": [
      "PAK DE GELE ECO!"
    ],
    "sksp0395": [
      "SCHIET DE ROBOT, JAK!"
    ],
    "sksp0396": [
      "SCHIET ZIJN ARM!"
    ],
    "sksp0397": [
      "SCHIET ZIJN PISTOOL!"
    ],
    "sksp0398": [
      "SCHIET ZIJN HOOFD!"
    ],
    "sksp0399": [
      "KIJK UIT VOOR DE BLAST!"
    ],
    "sksp0400": [
      "HIJ IS AAN HET OPLADEN!"
    ],
    "sksp0401": [
      "KRIJG DE BLAUWE ECO!"
    ],
    "sksp0402": [
      "KRIJG DE RODE ECO!"
    ],
    "sksp0403": [
      "IK HEB EEN SLECHT GEVOEL HIEROVER!"
    ],
    "sksp0404": [
      "GEBRUIK DE LAUNCHER, SNEL!"
    ],
    "sksp0405": [
      "NU HEB JE HET DIER GEK GEMAAKT!"
    ],
    "sksp0406": [
      "WIJ KUNNEN DEZE JONGENS NIET AANRAKEN!"
    ],
    "sksp0407": [
      "GEBRUIK DE GELE ECO!"
    ],
    "sksp0408": [
      "SCHIET DIE JONGENS!"
    ],
    "sksp0409": [
      "KRIJG HET LICHT ECO, JAK!"
    ],
    "sksp0410": [
      "HIJ KIJKT BOOS!"
    ],
    "sksp0411": [
      "SPRING OM DE EXPLOSIES TE VOORKOMEN!"
    ],
    "sksp0412": [
      "NU ZORGEN WIJ VOOR ZAKEN!"
    ],
    "sksp0413": [
      "GOED GESCHIET, PARTNER!"
    ],
    "sksp0414": [
      "DAT DEED HEM PIJN!"
    ],
    "sksp0415": [
      "HIER KOMT HIJ!"
    ],
    "sksp0416": [
      "JA! JE HEBT HET GEDAAN!"
    ],
    "sksp0417": [
      "ZEG \"GOEDE NACHT\", GOL EN MAIA!"
    ],
    "sksp0435": [
      "KLOP OM DIE BOTTEN!"
    ],
    "sksp0443": [
      "SLA DIE PALEN VAN ONDERAAN OMHOOG!"
    ],
    "sksp0444": [
      "WE ZIJN AAN HET WACHTEN. HALLO?"
    ],
    "sksp0449": [
      "DRUK OP START OM TE SPELEN."
    ],
    "sksp0450": [
      "WILT U STOPPEN MET SPELEN?"
    ],
    "sksp0451": [
      "DAT DACHT IK NIET."
    ],
    "sksp0452": [
      "OKÉ, TOT ZIENS."
    ],
    "sksp0455": [
      "MAN, WIE ZIJN AL DEZE MENSEN?"
    ],
    "sksp0466": [
      "IK WAS GOED. WAS IK DAT NIET, MEISJES?"
    ],
    "sksp0b42": [
      "MIS NIETS DE GELE VISSEN, ZE WEGEN ELK VIJF PONDEN!",
      "EN DAT IS VEEL VIS, JAK."
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "VOGELAAR",
    "BLUE SAGE": "BLAUWE WIJZE",
    "DAXTER": "DAXTER",
    "FARMER": "BOER",
    "FISHERMAN": "VISSER",
    "FLUT-FLUT": "OVERSTROMING-OVERSTROMING",
    "GAMBLER": "GOKKER",
    "GEOLOGIST": "GEOLOOG",
    "GOL": "GOL",
    "GORDY": "GORDIE",
    "JAK": "HOE",
    "JAK'S UNCLE": "JAK'S OOM",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "BURGEMEESTER",
    "MINER": "MIJNWERKER",
    "OLD MAN": "OUDE MAN",
    "ORACLE": "ORAKEL",
    "RED SAGE": "RODE WIJZE",
    "SAMOS": "SAMOS",
    "SCULPTOR": "BEELDHOUWER",
    "WARRIOR": "STRIJDER",
    "WILLARD": "WILLARD",
    "WOMAN": "VROUW",
    "YELLOW SAGE": "GELE WIJZE"
  }
}
