{
  "cutscenes": {
    "assistant-firecanyon-resolution": [
      "SNYGGT! NI HAR DE 20 ENERGI CELLERNA SOM BEHÖVS FÖR ATT GE ENERGI ÅT MIN VÄRME SKÖLD!",
      "VAR FÖRSIKTIGA NU, FÖR SKÖLDEN KOMMER BARA ATT SKYDDA ER ZOOMER",
      "ILL ATT DEN NÅR 500 GRADER, SÅ FÖRSÖK ATT HÅLLA DEN NEYKYLD.",
      "OM NI FLYGER ÖVER ÖPPEN LAVA SÅ KOMMER NI DEFINITIVT ATT VÄRMAS UPP SNABBT.",
      "OM NI LYCKAS KOMMA UPP TILL 500 GRADER, SÅ KOMMER DET VARA KÖRT.",
      "KÖRT?! PRECIS SOM BRINNANDE SMÄLTEN METALL KÖRT?!",
      "ELD FLODBÄDDEN KAN BLI GANSKA VARM, SÅ HÅLL UTKIK EFTER HOPP",
      "SÅ ATT NI HÅLLER ER BORTA FRÅN DEN VARMA MARKEN.",
      "JAG HAR DESSUTOM SLPPT IVÄG FLERA BLÅ NERKYLNINGS BALLONGER SOM NI KAN ANVÄNDA FÖR ATT SNABBT FÅ NER",
      "SKÖLDENS TEMPERATUR.",
      "ÅH! OCH NÄR NI VÄL KOMMER TILL ANDRA SIDAN, GLÖM INTE BORT ATT AKTIVERA",
      "TELEPORTER PORTEN I DEN BLÅ VISE MANNENS LABB.",
      "VI KOMMER DÅ KUNNA TELEPORTERA BORT DIT OCH MÖTA UPP ER!",
      "LYCKA TILL!"
    ],
    "assistant-introduction-blue-eco-switch": [
      "HALLÅ DÄR SÖTNOS. VAD SÄGS OM ATT DU OCH JAG TAR EN ÅKTUR PÅ DEN HÄR GRAV ZOOMER?",
      "REGEL NUMMER ETT: JAG DEJTAR INTE DJUR.",
      "ÅH DU VET INTE RIKTIGT VAD DU GÅR MIST OM, HE HE.",
      "HÖR HÄR, OM NI BEHÖVER NÅGOT ATT UPPEHÅLLA ER MED, MIN FAR PRATAR ALLTID",
      "OM EN URÅLDIRG PREKURSOR RÖRSYSTEM SOM FANNS DOLD LÅNGT NER UNDER MARKEN.",
      "NÅGRA AV DE HÄR RÖREN SLUTAR VID KÄLLOR DÄR ECO FÅR FLYTA FRITT,",
      "OCH NÅGRA HAR BLIVIT AVSTÄNGDA SÅ ATT ECO HÅLLS TILLBAKA.",
      "DET MÅSTE FINNAS ETT SÄTT ATT SLÅ PÅ DE AVSTÄNGDA KÄLLORNA.",
      "JAG LYCKADES SPÅRA DELAR AV RÖRSYSTEMET HELA VÄGEN TILLBAKA TILL DET FÖRBJUDNA TEMPLET.",
      "KANSKE BORDE DU BÖRJA LETA DÄR EFTER NÅGON SLAGS KNAPP."
    ],
    "assistant-introduction-race-bike": [
      "HALLÅ DÄR, SÖTNOS. VAD ÄR DET DÄR DU ARBETAR MED?",
      "VAR FÖRSIKTIG MED DET DÄR! JAG FÖRSÖKER FUNGERA UT ETT SÄTT ATT TRANSPORTERA ZOOMERN",
      "GENOM ATT ANVÄNDA TRANSPORT PLATTORNA SOM PREKURSORS LÄMNADE EFTER SIG ÖVER HELA VÄRLDEN.",
      "OM NI SKULLE RÅKA SNUBBLA ÖVER EN AV DESSA PLATTORNA SÅ SKULLE JAG KUNNA ZOOMA IN PÅ ER KOMMUNIKATÖRS PLATS",
      "OCH SKICKA ÖVER ZOOMERN TILL ER!",
      "HÅLL UTKIK EFTER EN TRANSPORT PLATTA NÄR NI ÄR UTE OCH UTFORSKAR DIMMIGA ÖN, OCH PÅ ALLA ANDRA STÄLLEN NI KOMMER TILL!"
    ],
    "assistant-lavatube-end-resolution": [
      "HÖRRU! VAR ÄR DEN DÄR GAMLA IDIOTEN?",
      "DET HÄR ÄR FRUKTANSVÄRT! MIN PAPPA ÄR FÖRSVUNNEN!",
      "JAG TROR ATT GOL OCH MAIA KAN HA KIDNAPPAT HONOM OCKSÅ!",
      "TA DET LUGNT, SÖTNOS. JAG HAR ALLTING UNDER KONTROL.",
      "UNDER KONTROL?!",
      "LURKER ARMEER FORTSÄTTER ATT VÄXA RUNT OM HELA LANDET,",
      "DE VISE MÄNNEN HAR BLIVIT KIDNAPPADE,",
      "GOL OCH MAIA HAR LYCKATS SAMLA IHOP TILLRÄCKLIGT MED ECO",
      "FÖR ATT KUNNA SLUTFÖRA SIN HEMSKA PLAN,",
      "OCH FÖR ATT KUNNA STOPPA DEM, SÅ MÅSTE NI TA OCH",
      "SLÅ ER FRAM HELA VÄGEN GENOM DERAS CITADELL!",
      "EH... JA. DET KAN MAN, EH... NOG SAMMANFATTA DET HELA.",
      "NI MÅSTE TA OCH RÄDDA MIN FAR INNAN DET ÄR FÖR SENT!",
      "OCH JAK...",
      "VAR FÖRSIKTIG.",
      "JAPP. VI KOMMER ATT VARA FÖRSIKTIGA!"
    ],
    "assistant-lavatube-start-resolution": [
      "HA HA! OK DÅ!",
      "MED DE HÄR YTTERLIGA ENERGI CELLERNA, SÅ SKULLE JAG KUNNA TILLÄMPA TILLRÄCKLIGT MED ENERGI ÅT VÄRMESKÖLDEN",
      "FÖR ATT KUNNA STÅ EMOT DEN HÄR LAVAN.",
      "MEN SKÖLDEN HAR FORTFARANDE EN GRÄNS.",
      "DEN KAN NU STÅ EMOT TEMPRATURER UPP EMOT 800 GRADER, MEN INTE MER.",
      "SÅ FÖRSÖK ATT HÅLLA ETT ÖGA PÅ ER MÄTARE.",
      "JAG VÅGAR NÄSTAN INTE TÄNKA MIG VAD DE DÄR TEMPRATURERNA SKULLE KUNNA GÖRA MED ER ZOOMER",
      "IFALL SKÖLDEN SKULLE GER VIKA.",
      "JUST DET, HETTAN...",
      "VAD DÅ? ZOOMERN? HÖRRU! VAD KOMMER ATT HÄNDA MED OSS?!",
      "TROR DU INTE ATT SKULLE KUNNA LETA EFTER EN SÄKRARE RUTT TILL GOL'S CITADELL?",
      "LUGNA ER NU, FÖR JAG HAR SLÄPPT UT FLER NERKYLNINGSBALLONGER INNE I TUNNELN.",
      "SÅ NI SKULLE KUNNA ANVÄNDA DEM FÖR ATT HÅLLA NERE TEMPRATURERNA.",
      "OCH GLÖM INTE BORT ATT AKTIVERA TELEPORTER PORTEN I DEN GULE VISE MANNENS LABB.",
      "VI RÄKNAR MED ER."
    ],
    "assistant-reminder-1-blue-eco-switch": [
      "JAG ÄR SÄKER PÅ ATT OM NI KOLLAR INUTI PREKURSOR FÖRBJUDNA TEMPLET",
      "SÅ SKULLE NI KUNNA HITTA ETT SÄTT ATT AKTIVERA DEN AVSTÄNGDA BLÅ ECO KÄLLAN PÅ SENTINEL STRANDEN."
    ],
    "assistant-reminder-1-generic": [
      "HALLÅ DÄR KILLAR! FORSÄTT ATT SAMLA IHOP ENERGI CELLER.",
      "DE ÄR NYCKELN TILL ATT VI SKA KUNNA FORSÄTTA VÅR RESA NORRUT."
    ],
    "assistant-reminder-1-race-bike": [
      "JAG HAR DEFINITIVT LYCKATS KOMMA PÅ HUR MAN BÖR ANVÄNDA DE HÄR TRANSPOR PLATTORNA.",
      "STICK IVÄG NU TILL DIMMIGA ÖN OCH JAG KOMMER ATT SKICKA ÖVER ZOOMERN TILL ER."
    ],
    "assistant-village2-introduction": [
      "JISSES!",
      "JAG TROR INTE ATT JAG ALDRIG KOMMER ATT VÄNJA MIG VID DEN HÄR KITTLANDE KÄNSLAN AV ATT BLI TELEPORTERAD.",
      "NÄMEN TITTA!",
      "DET VERKAR SOM DEN BLÅ VISE MANNEN HADE EN FEST.",
      "NÄMEN KÄRA NÅN! STENBYN BRINNER!",
      "EN RIKTIK BRAKFEST.",
      "NEJ, NEJ! JAG MENAR ATT STENBYN HÅLLER PÅ ATT BOMBARDERAS MED BRINNANDE STENAR!",
      "ÅH! OCH DET SER UT SOM ATT DEN BLÅ VISE MANNEN ARBETAR PÅ EN SVÄVARMASKING FÖR ATT KUNNA FLYTTA DEM.",
      "OM VI ANTAR ATT DEN FUNGERAR, SÅ KOMMER VI BEHÖVA ENERGI CELLER FÖR ATT KUNNA GE ENERGI ÅT DEN.",
      "JAG ANTAR ATT NI TVÅ BEHÖVER SAMLA IN NÅGRA FLER.",
      "VI BORDE VERKLIGEN TA OSS EN TITT PÅ HANS ANTECKNINGAR.",
      "JAK, GÅ OCH SE HUR BYBORNA HAR DET, OCH KOM SEDAN TILLBAKA HIT OCH GE OSS EN UPPDATERING.",
      "OCH TA MED DIG PÄLSBOLLEN!"
    ],
    "assistant-village2-introduction-flutflut": [
      "SÅ NI ÄR REDAN TILLBAKA, KILLAR?",
      "POJK?",
      "HÖRRU DU SÖTNOS, JAG ÄR FAKTISKT EN FULLVUXEN...",
      "EH...",
      "NÅNTING... NÅNTING PÄLSAKTIGT.",
      "HEJ, VET NI VAD? MED TILLÅTELSE FRÅN VÅR BYS FÅGELSKÅDARE,",
      "SÅ HAR JAG UTRUSTAD BÄBIS FLUT-FLUT MED EN RYTTARSADEL.",
      "DET VERKAR SOM DET FINNS EN PREKURSOR TRANSPOR PLATTA I SUMPIGA TRÄSKET.",
      "OM NI SKULLE KUNNA HITTA DEN, SÅ SKULLE JAG KUNNA SKICKA ÖVER FLUT-FLUT I FULL RYTTAR MUNDERING.",
      "HENNES LÅNGA HOPP SKULLE NOG KOMMA VÄL TILL PASS NÄR NI SKA FÖRSÖKA TA ER ÖVER LERAN."
    ],
    "assistant-village2-introduction-robbers": [
      "ALLÅ DÄR, NI TVÅ!",
      "JAG VET VAR NI KAN HITTA YTTERLIGARE EN ENERGI CELL!",
      "ENLIGT HANS ANTECKNINGAR,",
      "NÅGRA DAGAR SEDAN SÅ STAL NÅGRA FLYGANDE LURKERS EN FRÅN DEN BLÅ VISE MANNEN,",
      "OCH FLÖG IVÄG TILL PREKURSOR DALEN.",
      "JAG SLÅR VAD OM ATT NI SKULLE KUNNA MEJA NER LURKERS MED ER ZOOMER",
      "TILLS NI HITAR DEN SOM HAR ENERGI CELLEN.",
      "NI KOMER ATT HITTA ZOOMERN PÅ TRANSPORT PLATTAN VID INGÅNGEN TILL PREKURSOR DALEN."
    ],
    "assistant-village2-introduction-room": [
      "DET VERKAR SOM ATT PREKURSOR STRUKTUREN INTE LÅNGT FRÅN KUSTEN",
      "LEDER TILL EN FÖRLORAD UNDERVATTENSSTAD.",
      "DEN BLÅ VISE MANNEN HAR FÖRSÖKT KOMMA PÅ ETT SÄTT",
      "FÖR ATT HUR HAN SKULLE KUNNA FÅ UPP EN AV KAMRARNA TILL YTAN.",
      "MEN HAN LYCKADES ALDRIG.",
      "NI BORDE GÅ DIT OCH KOLLA PÅ DET!",
      "UH... FINNS DET INTE MÅNGA, UH...",
      "LURKER HAJAR I VATTNEN?",
      "HUR SÅ? ÄR DU RÄDD?",
      "JAG? SÅ KLART INTE!",
      "JAG ÄR BARA OROLIG FÖR JAK!",
      "DU VET, EH, ASSÅ...",
      "DU VET VILKEN FEGIS HAN KAN VARA.",
      "NÄVÄL, OM NI SIMMAR UT ÖVER KORRALREVEN, SÅ TVIVLAR JAG PÅ ATT LURKER HAJARNA SKULLE BRY SIG OM ER.",
      "DE TYCKER INTE OM GRUNT VATTEN."
    ],
    "assistant-village2-reminder-1-flutflut": [
      "JAG ÄR SÄKER PÅ ATT FLUT-FLUT SKULLE KOMMA VÄL TILL PASS FÖR ER I TRÄSKET.",
      "OM NI HITTAR TRANSPORT PLATTAN SÅ KAN JAG TELEPORTERA ÖVER HENNE DIT."
    ],
    "assistant-village2-reminder-1-robbers": [
      "JAG KOMMER ATT TELEPORTERA ÖVER ER ZOOMER TILL ER VID PREKURSOR DALEN,",
      "SÅ ATT NI KAN JAGA IKAPP DE DÄR FLYGANDE LURKERS SOM VI PRATADE OM."
    ],
    "assistant-village2-reminder-1-room": [
      "HAR NI SIMMAT UT TILL DEN FÖRLORADE PREKURSOR STADEN ÄN?",
      "NI SKULLE VERKLIGEN TA OCH FÖRSÖKA LYFTA UPP RUMMET SOM DEN BLÅ VISE MANNEN VAR UTE EFTER."
    ],
    "assistant-village2-resolution": [
      "PERFEKT, NI MED ER CELLERNA TILL MASKINEN!",
      "DE BORDE NOG TILLFÖRA TILLRÄCKLIGT MED ENERGI FÖR ATT KUNNA LYFTA UPP DEN DÄR STENEN.",
      "SÅ DÄR JA!",
      "VAR FÖRSIKTIG NU, NÄR NI MÖTER DEN DÄR MONSTER LURKER UPPE VID TOPPEN.",
      "VÄNTA LITE! ÖH...",
      "JAG KOMMER ATT STANNA HÄR OCH SKYDDA KEIRA!",
      "JAK, JAG TROR ATT DU ÄR REDO FÖR ATT KUNNA HANTERA DET DÄR MONSTRET UTAN MIG.",
      "ÅH, SÅ HIMLA HJÄLTEDÅDIGT AV DIG."
    ],
    "assistant-village3-reminder": [
      "HALLÅ DÄR KILLAR! FORTSÄTT ATT SAMLA PÅ ER ENERGI CELLER.",
      "DE ÄR NYCKELN TILL ATT VI SKA KUNNA FORSÄTTA VÅR RESA NORRUT."
    ],
    "billy-accept": [
      "PERFEKT! DE DÄR RÅTTORNA KOMMER ATT KOMMA TILLBAKA NÄR SOM HELST.",
      "SKJUT ALLA RÅTTORNA, OCH HÅLL DE BORTA",
      "FRÅN ATT ÄTA MINST EN AV DE DÄR SNACKSEN."
    ],
    "billy-introduction": [
      "TJENA, VÄNNER! TYCKER NI OM MIT TRÄSK?",
      "DET ÄR JAG SOM ÄGER DE HÄR MARKERNA.",
      "ALLT SOM INTE SJUNKER NER I LERAN, SÅ ATT SÄGA! HA HA HA...",
      "ATT DÖMA AV DIN LUKT, SÅ MISSTÄNKER JAG ATT DITT",
      "BADKAR SJÖNK NER I LERAN FÖR LÄNGE SEDAN.",
      "VAD ÄR ETT BADKAR?",
      "I ALL AFALL SÅ HAR JAG STÖRRE PROBLEM NU...",
      "DET VERKAR SOM ATT NÅGRA RIKTIGT ELAK LURKER KRYP LÖPER OMKRING HÄR,",
      "OCH ROFFAR ÅT SIG ALLT VAD DERAS GIRIGA SMÅ TASSAR ORKAR BÄRA.",
      "OCH SKRÄMT IVÄG MIN TAMA HIPHOG, FARTHY.",
      "HAN HAR VARIT BORTA I EVIGHETER.",
      "JAG HAR FÖRSÖKT ATT PLACERA UT HANS FAVORITSNACK,",
      "MEN DE DÄR FRUKTANSVÄRT ELAKA TRÄSKRÅTTORNA STJÄLER DEM HELA TIDEN!",
      "IFALL NI SKULLE KUNNA HÅLLA DE DÄR IRITERANDE SMÅKRYPEN BORTA TILRRÄCKLIGT LÄNGE,",
      "SÅ ÄR JAG SÄKER PÅ ATT FARTHY SKULLE KÄNNA DOFTEN AV MAT OCH KOMMA TILLBAKA!",
      "SKULLE NI VARA VILLIGA ATT HJÄLPA MIG?"
    ],
    "billy-reject": [
      "NÄVÄK, OM NI SKULLE ÄNDRA ER, SÅ VET NI VAR NI KAN FÅ TAG PÅ MIG!",
      "HI HI HI HI HI..."
    ],
    "billy-reminder-1": [
      "ÅH, SÅ NI HAR KOMMIT TILLBAKA FÖR ATT HJÄLPA TILL OCH STOPPA DE DÄR RÅTTORNA?"
    ],
    "billy-resolution": [
      "NÄMEN DRA MIG BAKLÄNGES! NI VET VERKLIGEN HUR MAN GÖR FÖR ATT SKJUTA!",
      "TACK SÅ HEMSKT MYCKET FÖR HJÄLPEN."
    ],
    "bird-lady-beach-resolution": [
      "ÅH KÄRA NÅN, JAG HOPPAS DEN STACKARS LILLE HAR KLARAT SIG.",
      "HÄR HAR NI EN ENERGI CELL FÖR ERT MOD.",
      "MAMMA!",
      "MAMMA!",
      "ÅH NEJ! NEJ, NEJ, NEJ, NEJ!",
      "MEN HAR MAN SETT... ÄR DET INTE SÅ SÖTT? DEN TROR ATT DU ÄR DESS MAMMA.",
      "VA? JAG ÄR INTE DIN MAMMA! SER DU NÅGRA FJÄDRAR HÄR?",
      "ÅH, KÄRLEK VID FÖRSTA ÖGONKASTET! ÅH...",
      "HÖR NI, POJKAR, JAG KOMMER TA MED MIG DEN HÄR LILLA KYCKLIGNE TILLBAKA TILL BYN",
      "OCH KOMMA ÖVERENS MED DEN VISE MANNEN OM ATT TA HAND OM HENNE."
    ],
    "bird-lady-introduction": [
      "MEN KÄRA NÅN, VILKEN FÖRSKRÄCKLIG LITEN SJUK FÅGEL VI HAR HÄR.",
      "VA! DU SER INTE HELLER SÅ BRA UT, DAMEN!",
      "ÅH, FÖRLÅT MIG. JAG TRODDE DU VAR EN FLÄCKIG",
      "ORANGE-BUKAD REGNSTRID.",
      "VET DU VAD, IGÅR SÅG JAGNÅGRA",
      "FRUKTANSVÄRT ELAKA VARELSER FÅNGA",
      "EN VUXEN FLUT FLUT NÄRA STRANDEN.",
      "SÅ NU FINNS DET ETT STACKARS LITET ÖVERGIVET ÄGG",
      "SOM SITTER I ETT BO VID TOPPEN AV KLIPPAN",
      "OCH JAG KAN INTE NÅ DET.",
      "OM DU SKULLE KUNNA KLÄTTRA UPP DÄR OCH KNUFFA NER DET, SÅ HAR JAG PACKAT",
      "LITE HÖ NERE VID BOTTEN FÖR ATT FÅNGA IN DET SÄKERT.",
      "GÖR EN GAMMAL DAM EN TJÄNST, OCH JAG KOMMER GE ER EN ENERGI CELL."
    ],
    "bird-lady-reminder-1": [
      "NÄMEN, HALLÅ DÄR IGEN. LYCKADES NI POJKAR HITTA DET BLÅ ÄGGET PÅ KLIPPAN?",
      "KNUFFA NER DET ÖVER KANTEN OCH JAG KOMMER GE ER EN ENERGI CELL!"
    ],
    "bird-lady-reminder-2": [
      "ÄR NI POJKAR FORTFARAND KVAR OCH HÄNGER HÄR? HO HO HO.",
      "JAG SKULLE SLÅ VAD OM ATT DET DÄR STACKARS LILLA BLÅ ÄGGET PÅ KLIPPAN",
      "HÅLLER PÅ ATT BLI VÄLDIGT KALLT VID DET HÄR LAGET.",
      "GÅ DIT OCH RÄDDA DET GENOM ATT KNUFFA NER DET FRÅN KANTEN AV KLIPPAN,",
      "OCH JAG KOMMER ATT GE ER EN ENERGI CELL."
    ],
    "bluesage-resolution": [
      "BRA JOBBAT, KILLAR! GAMLE SAMOS HADE RÄTT OM ER!",
      "HERREJÖSES!",
      "DEN DÄR LÖMSKA MEKANISKA SKAPELSEN",
      "MÅSTE INTE TILLÅTAS ATT SKAPA HEMSK FÖRSTÖRELSE!",
      "JAG SKA FÖRSÖKA AKTIVERA SKÖLD DÖRREN",
      "GENOM ATT LEDA EN STRÅLE AV ENERGI",
      "MELLAN MIG SJÄLV OCH DEN VIDA PORTALEN DÄR NERE!",
      "EH... VISST. GÖR DU SÅ. VI KOMMER EH... BARA GÅ OCH SKAFFA MER HJÄLP.",
      "KNÄPPJÖK!"
    ],
    "death-0181": [
      "GÅ INTE IN I LJUSET, JAK! GÅ INTE IN I LJUSET!"
    ],
    "death-0182": [
      "HEJ, JAK! KAN JAG...",
      "FÅ DIN INSEKSAMLING?"
    ],
    "death-0184": [
      "MEDAN DU ÄR DÄR NERE, EH...",
      "SKULLE DU KUNNA GNUGGA MINA FÖTTER?"
    ],
    "death-0186": [
      "VAR INTE OROLIG! JAG KOMMER HÄMNAS DIG!",
      "...INTE."
    ],
    "death-0187": [
      "NÅ, EH...",
      "HELLRE DU ÄN MIG."
    ],
    "death-0191": [
      "DET DÄR SÅG UT ATT GÖRA ONT.",
      "SKA JAG KALLA PÅ FÖRSTÄRKNING?"
    ],
    "death-0193": [
      "STEG 1: HÅLL DIG VID LIV!",
      "STEG TVÅ...",
      "TÄNK PÅ ATT INTE GÖRA NÅGOT SÅDANT IGEN!"
    ],
    "death-0195": [
      "JAG VAR PRECIS BAKOM DIG, JAK!",
      "...SÄKERT. DET VAR JAG."
    ],
    "death-0197": [
      "GÖR HEIMLICH! EH... HÄMTA EN BÅR!",
      "USCH...LUKT MINT?"
    ],
    "death-0199": [
      "JAG KOMMER ATT SÄGA NÅGOT RIKTIGT SORGLIGT VID BEGRAVNINGEN, SOM...",
      "...HUR SKA JAG KUNNA BLI ÄNDRAD TILLBAKA NU?"
    ],
    "death-0202": [
      "SÄG GOD NATT, JAK!"
    ],
    "evilbro-misty-end": [
      "THOSE TWO COULD PROVE TO BE TROUBLE.",
      "DON'T WORRY DEAR BROTHER, I'LL DISPATCH MY LURKER ARMY TO DEAL WITH THEM.",
      "JUST MAKE SURE THEY DON'T GET TOO CLOSE TO OUR NORTHERN OPERATIONS.",
      "I DOUBT THEY'LL GET THAT FAR...",
      "BUT IF THEY DO, A SURPRISE WILL BE WAITING FOR THEM IN ROCK VILLAGE.",
      "SO...YOU'RE GOING TO LET...KLAWW OUT OF HIS CAGE?",
      "I THINK IT'S WORTH THE RISK.",
      "INDEED..."
    ],
    "explorer-introduction": [
      "'S FARBROR NÄMEN, HALLÅ DÄR MIN KÄRA POJKE.",
      "'S FARBROR NI HAR LCYKATS ATT STÖTA PÅ MIG I ETT MYCKET OPASSANDE TILLFÄLLE.",
      "'S FARBROR JAG SKULLE HA BEGETT MIG AV PÅ MINA RESOR IGÅR",
      "'S FARBROR MEN DET VERKAR SOM JAG HAR LITE ONT OM PREKURSOR KULOR.",
      "'S FARBROR JAG SKULLE HA SVURIT VID MITT ORD ATT JAG SKULLE BEHÖVA 90 STYCKEN,",
      "'S FARBROR MEN JAG MISSTÄNKER ATT DIN UNGA VÄN, DU VET, DEN",
      "'S FARBROR DÄR LILLA IRRITERANDE VÄRDELÖSA ÄCKLIGA VARELSEN",
      "'S FARBROR SKULLE KUNNA HAR TAGIT DE ALLA SOM NÅGON SLAGS KUL GREJ.",
      "'S FARBROR I ALLA FALL, SKULLE DU KUNNA VARA SÅ SNÄLL ATT LÅNA UT TILL DIN KÄRA GAMLA FARBROR",
      "'S FARBROR 90 PREKURSOR KULOR SÅ ATT HAN SKULE KUNNA BEGE SIG IVÄG?",
      "'S FARBROR JAG SKULLE KUNNA ERBJUDA DIG EN ENERGI CELL I UTBYTE."
    ],
    "explorer-reminder-1": [
      "'S FARBROR VAD ÄR DETTA? DU HAR FORTFARANDE INTE RÄTT MÄNGD MED DIG? HMPF!",
      "'S FARBROR NÅ, ALLT UNDER 90 PREKURSOR KULOR",
      "'S FARBROR OCH JAG KOMMER INTE HA NÅGON CHANS ATT BEGE MIG IVÄG, KÄRA POJKE."
    ],
    "explorer-reminder-2": [
      "'S FARBROR VÄNTA HÄR NU LITE, VI KOM ÖVERENS OM 90 PREKURSOR KULOR FÖR ATT KUNNA FÅ EN ENERGI CELL.",
      "'S FARBROR ETT GANSKA BRA UTBYTE."
    ],
    "explorer-resolution": [
      "'S FARBROR JAG SER ATT NI TVÅ HAR KOMMIT TILLBAKA FÖR ATT GENOMFÖRA UTBYTET. BRA, BRA, MYCKET BRA!",
      "'S FARBROR ÄH, DU HAR MED DIG EH, DE PREKURSOR KULOR SOM VI KOM ÖVERENS OM?",
      "'S FARBROR JAG HOPPAS ATT DU KOMER ATT ANVÄNDA DEN HÄR VÄL-FÖRTJÄNTA ENERGI CELLEN TILL ETT GOTT SYFTE.",
      "'S FARBROR TACK SÅ MYCKET, HEJSAN SVEJSAN, ADJÖ!"
    ],
    "farmer-introduction": [
      "MÅSTE MJÖLKA DE DÄR YAKOW, MÅSTE MJÖLKA DE DÄR YAKOW...",
      "ÅH! DET ÄR NI... JAG SKULLE BARA VILA MINA TRÖTTA BEN.",
      "JAG HAR FÖRSÖKT ATT FÅ DE DÄR ENVISA YAKOW",
      "ATT GÅ TILLBAKA IN I FÅLLAN HELA DAGEN!",
      "NÅGRA MÄRKLIGA VARELSER FÖRSÖKTE STJÄLA DEM TIDIGARE.",
      "TROR DU ATT DU SKULLE KUNNA HJÄLPA EN GAMMAL MAN ATT FÖRSÖKAATT FÅ DE ATT GÅ TILLBAKA IN I FÅLLAN?"
    ],
    "farmer-reminder-1": [
      "HALLÅ DÄR! MINA YAKOW ÄR FORTFARANDE HELT LÖSA!",
      "ÄH, SKULLE DU KUNNA FÅ DE ATT GÅ TILLBAKA NÅGON GÅNG?"
    ],
    "farmer-reminder-2": [
      "DE DÄR JÄKLA YAKOW LÖPER FORFTARANDE RUNT.",
      "SKA DU INTE TA OCH JAGA IN DE I FÅLLAN NÅGON GÅNG?"
    ],
    "farmer-resolution": [
      "AH, BRA JOBBAT MIN POJKE. DU LCYKADES FAKTISKT FÅ DENDÄR RYMLINGSBARA FLOCKEN ATT GÅ TILLBAKA IN I FÅLLAN.",
      "NU KAN JAG SOVA I LUGN OCH RO. VAR SNÄLL OCH TA EMOT DEN HÄR ENERGI CELLEN FÖR DIN FÖRTJÄNST."
    ],
    "finalbosscam-white-eco": [
      "LJUS ECO! DEN EXISTERAR FAKTISKT!",
      "DE FÅR INTE TILLÅTAS ATT FÅ TAG PÅ DET!"
    ],
    "fisher-accept": [
      "DET FINNS TVÅ BRA SORTERS FISK ATT FÄNGA:",
      "1 KG FISKAR, OCH 5 KG FISKAR.",
      "HÖR PÅ HÄR. OM NI SKULLE MISSA 20 KG FÄRSK FISK",
      "SÅ KOMER JAG ATT TA TILLBAKA MITT NÄT FRÅN ER!",
      "DET FINNS GIFTIGA ÅLAR I DEN HÄR FLODEN.",
      "OM NI FÅNGAR BARA EN AV DE KRYPEN",
      "SÅ KOMMER NI ATT FÖRGIFTA HELA JÄKLA FÅNGSTEN!"
    ],
    "fisher-introduction": [
      "VAD HAR DU DÄR I KORGEN?",
      "INGET ATT SKRYTA OM.",
      "MONSTREN SOM PATRULLERAR HAVEN",
      "TOG ETT BETT AV MIN FISKERIGG.",
      "OCH NU HÅLLER DE PÅ ATT ÄTA UPP MIN FÅNGST!",
      "VAD JAG ÄN FÖRSÖKDER GÖRA, SÅ KAN JAG INTE LYCKAS FÅNGA EN ENDA FISK I DEN HÄR FLODEN.",
      "JÖSSES! KANSKE... SÅ ÄR DET DIN ANDEDRÄKT.",
      "TROR NI ATT NI SKULLE LYCKAS BÄTTRE?",
      "FÖRSÖK ATT FÅNGA UPP FISK FRÅN FLODEN MED ETT LITET NÄT!",
      "JAG KOMMER ATT GE ER EN ENERGI CELL",
      "OM NI SKULLE LYCKAS FÅNGA 200 KG AV DE DÄR SMÅ KRYPEN!",
      "OCH JAG KOMMER ATT TILLÅTA ATT DU OCH DEN LILLA RÄKAN HÄR",
      "FÅR ANVÄNDA MIN MOTORBÅT FÖR ATT TA ER TILL DIMMIGA ÖN.",
      "SKULLE NI VILJA FÖRSÖKA ER PÅ UTMANINGEN?"
    ],
    "fisher-reject": [
      "NÅ, OM NI VILL FÖRSÖKA VINNA DEN HÄR ENERGI CELLEN NÅGON ANNAN GÅNG",
      "SÅ VET NI VAR NI KAN HITTA MIG."
    ],
    "fisher-reminder-1": [
      "VILL NI FÖRSÖKA SLÅ FLODEN, ELLER?"
    ],
    "fisher-resolution": [
      "NI GJORDE DET! NI LYCKADES FÅNGA 200 KG FISK!",
      "INTE ILLA FÖR ATT VARA ET PAR LANDKRABBOR!",
      "HÄR HAR NI ENERGI CELLEN JAG LOVADE ER",
      "OCH NI KAN ANVÄNDA MIN BÅT I HAMNEN I BYN",
      "NÄR SOM HELST!"
    ],
    "fishermans-boat-ride-to-village1-alt": [
      "THOSE TWO COULD PROVE TO BE TROUBLE.",
      "DON'T WORRY, DEAR BROTHER. I'LL DISPATCH MY LURKER ARMY TO DEAL WITH THEM.",
      "JUST MAKE SURE THEY DON'T GET TOO CLOSE TO OUR NORTHERN OPERATIONS.",
      "I DOUBT THEY'LL GET THAT FAR.",
      "BUT IF THEY DO, A SURPRISE WILL BE WAITING FOR THEM IN ROCK VILLAGE.",
      "SO... YOU'RE GOING TO LET KLAWW OUT OF HIS CAGE?",
      "I THINK IT'S WORTH THE RISK.",
      "INDEED."
    ],
    "gambler-introduction-1": [
      "ÅH, NEJ. INTE EN TILL HJÄLTE.",
      "JAG FÖRLORADE MITT VAD PÅ DEN HÄR SÅ KALLADE HJÄLTENS STORA FIGHT",
      "MOT MONSTRET DÄR UPPE.",
      "OM NI TROR MIG, SÄ VORE DET KLOKT ATT SATSA PENGAR PÅ MONSTRET.",
      "DEN DÄR SATSNINGEN KOSTADE MIG ALLT!",
      "SÅ JAG HAR ETT FÖRSLAG.",
      "KOM HIT MED 90 KULOR FÖR ATT FÅ MIG UPP PÅ FÖTTER IGEN OCH FÖR ATT KUNNA TA MIG UT UR DEN HÄR TUNNAN,",
      "OCH JAG KOMMER ATT GE ER EN ENERGI CELL I UTBYTE.",
      "OCH OM NI ÄR SUGNA, SÅ HAR JAG EN ANNAN SATSNING PÅ GÅNG.",
      "MIN STORA ÅTERKOMST!",
      "SLÅ VÄRLDSREKORDTIDEN GENOM ATT RACA IGENOM DÖD MANS KLYFTA I PREKURSOR DALEN,",
      "OCH JAG KOMMER ATT FÅ EN GANSKA SNYGG BELÖNING!",
      "OM NI GÖR DET, SÅ KOMMER JAG ATT GE ER YTTERLIGARE EN ENERGI CELL."
    ],
    "gambler-reminder-money": [
      "HÖRRU NI. GLÖM INTE BORT DE DÄR KULORNA SOM JAG BEHÖVER.",
      "90 KOMMER ATT GE ER EN. NI FÅR EN ENERGI CELL, RÄTTARE SAGT!"
    ],
    "gambler-reminder-race": [
      "NÄ, VAD VÄNTAR NI PÅ?",
      "DEN HÄR TUNNAN BÖRJAR BLI KLIBBIG!",
      "SLÅ DEN BÄSTA TIDEN NERE PÅ DÖD MANS KLYFTA,",
      "OCH VI KOMMER BÅDA ATT BLI VINNARE!"
    ],
    "gambler-resolution-money": [
      "HI HI HI! ÅH, JA!",
      "DE HÄR KULORNA KOMMER ATT FÅ MIG ATT LYCKAS TA MIG TILLBAKA OCH UT UR DEN HÄR TUNNAN!",
      "HÄR HAR NI ENERGI CELLEN SOM JAG LOVADE ER!"
    ],
    "gambler-resolution-race": [
      "ÅH, BRA TEKNIKER, BARN! JAG VISSTE ATT DET DÄR VÄRLDSREKORDET SKULLE KROSSAS.",
      "HÄR HAR NI ER ENERGI CELL, OCH JAG KAN GÅ OCH SAMLA MIN STORA BELÖNING!"
    ],
    "geologist-introduction": [
      "NI TVÅ SER UT SOM ETT PAR PÅLITLIGA PERSONER.",
      "JAG HAR ETT PÅGÅENDE FORSKNINGSPROJEKT,",
      "OCH NI SKULLE KANSKE KUNNA HJÄLPA MIG.",
      "HÖR UPP HÄR, VI ÄR DE SOM ÄR UTE PÅ ETT STORT UPPDRAG.",
      "VI BER DIG OM HJÄLP.",
      "I SÅ FALL, SÅ SKULLE VI KANSKE KUNNA HJÄLPA VARANDRA.",
      "JAG HAR HÅLLT PÅ MED ATT STUDERA TÄNDA MULLVADARS GRÄVNINGSSÄTT",
      "I PREKURSOR DALEN BREDVID VÅR BY UNDER MÅNGA ÅR.",
      "MEN NU HAR DE DÄR HEMSKA LURKERS SKRÄMT UPP MULLVADARNA TILL YTAN!",
      "OCH EFTERSOM DE ÄR BLINDA SOM FLADDERMÖSS, SÅ KAN DE INTE HITTA VÄGEN TILLBAKA NER UNDER MARKEN.",
      "OM NI SKULLE KUNNA FÖSA TILLBAKA DE NER I SINA UTGRÄVDA TUNLAR,",
      "SÅ SKULLE NI KANSKE KUNNA RÄDDA DERAS LIV.",
      "JAG HAR EN ENERGI CELL HÄR SOM SÄGER ATT NI KAN LYCKAS GÖRA DET.",
      "VISST, TÄNDA MULLVADAR... OM VI BRYR OSS.",
      "KANSKE FÖR TVÅ ENERGI CELLER!",
      "BRA FÖRSÖK. MEN JAG SKULLE VARA VILLIG ATT GÖRA MIG AV MED YTTERLIGARE EN ENERGI CELL",
      "IFALL NI SKULLE KOMMA HIT MED 90 PREKURSOR KULOR FÖR MIN FORSKNINGS UTRUSTNING.",
      "LÅTER DET RÄTTVIST?"
    ],
    "geologist-reminder-moles": [
      "HAR NI LYCKATS FÖSA DE BLIXTANDE MULLVADARNA TILLBAKA NER UNDER MARKEN?",
      "NI BORDE SKYNDA PÅ – DIREKT SOLLJUS ÄR INTE RIKTIGT BRA FÖR DEM!"
    ],
    "geologist-reminder-money": [
      "JAG BEHÖVER DE DÄR KULORNA OM JAG SKA KUNNA FORSÄTTA MED MIN FORSKNING!"
    ],
    "geologist-resolution-moles": [
      "TACK SÅ MYCKET FÖR ATT NI RÄDDADE LIVET PÅ DE DÄR MULLVADARNA, DET VAR VÄLDIGT SNÄLLT AV ER.",
      "HÄR HAR NI EN ENERGI CELL FÖR ATT KUNNA HJÄLPA ER.",
      "NU KAN JAG ÅTERGÅ TILL MIN FORSKNING!"
    ],
    "geologist-resolution-money": [
      "ÅH, SÅ NI HAR MED ER KULORNA!",
      "HÄR HAR NI EN ERGI CELL SOM VI KOM ÖVERENS OM."
    ],
    "green-sagecage-daxter-sacrifice": [
      "LJUS ECO! DET SKULLE KUNNA VARA GREJEN SOM SKULLE KUNNA ÄNDRA TILLBAKA MIG!!",
      "ELLER... SÅ SKULLE DET KUNNA STOPPA DEN DÄR ROBOTEN.",
      "ATT FÖRBLI PÄLSIG, ELLER ATT RÄDDA VÄRLDEN... BESLUT...",
      "OK, VISST, VI KOMMER ATT RÄDDA VÄRLDEN.",
      "MEN GÖR DET SNABBT INNAN JAG ÄNDRAR MIG!"
    ],
    "green-sagecage-introduction": [
      "DET ÄR PÅ TIDEN ATT NI TVÅ BESTÄMDE ER FÖR ATT DYKA UPP!",
      "TREVLIGT ATT SE DIG OCKSÅ!",
      "HAR DE FÅTT DIG ATT BÖRJA MOPPA GOLVEN NU?",
      "DET ÄR INTE TID FÖR SKÄMT NU, DAXTER. GOL OCH MAIA KIDNAPPADE OSS",
      "FÖR ATT KUNNA DRÄNKA VÅRA KRAFTER FÖR ATT KUNNA GE ENERGI ÅT DERAS FÖRFÄRLIGA MASKIN.",
      "DET VERKAR SOM ATT DE HAR KOMBINERAT DE FUNGERANDE RESTERNA AV EN PREKURSOR ROBOT",
      "MED UPPHITTADE ARTIFAKTER ÖVERALLT ÖVER HELA LANDET.",
      "SEDAN SÅ LAD DE TILL NÅGRA AV DERAS EGNA HEMSKA TILLÄGG,",
      "VILKET SKAPADE DET ENDA TING SOM ÄR KAPABELT TILL ATT ÖPPNA UPP DE MÖRKA ECO SILONA.",
      "IFALL NI SKULLE KUNNA FRIGÖRA OSS FYRA, SÅ KAN VI ANVÄNDA VÅRA SAMLADE KRAFTER",
      "TILL ATT BRYTA KRAFTFÄLTET SOM OMGER ROBOTEN",
      "INNAN DE ANVÄNDER DEN TILL ATT FÖRSTÖRA VÄRLDEN."
    ],
    "green-sagecage-outro-beat-boss-a": [
      "GÖR NÅGOT DÅ!",
      "NEJ!"
    ],
    "green-sagecage-outro-beat-boss-b": [
      "NÅ, DET VERKAR SOM ATT JAG KANSKE VAR LITE FÖR HÅRD MOT ER KILLAR!",
      "NI HAR VERKLIGEN VAD SOM KRÄVS FÖR ATT BLI HJÄLTAR!",
      "MEN, DAXTER, VI KAN INTE ÄNDRA TILLBAKA DIG NU.",
      "VAR INTE OROLIG FÖ RMIG, SÖTNOS.",
      "DU VET VAD DE SÄGER: STORA SAKER KOMMER OFTA I SMÅ FÖRPACKNINGAR.",
      "JAK, DU HAR EN OTROLIG FÖRMÅGA ATT KUNNA KANNALISERA ECO!",
      "SAMOS, DET VERKAR SOM ATT DU KAN HA HAFT RÄTT OM DEN HÄR TROTS ALLT!",
      "OCH KEIRA, UTAN DIN HJÄLP OCH GENIALITET",
      "SÅ SKULLE INGET AV DETTA KUNNA HA SKETT.",
      "HM-HM-HM. KANSKE SÅ HAR VI FUNNITE ÄNNUU EN VIS MAN",
      "SÄRSKILT SOM GOL OCH MAIA VERKAR HA GÅTT FÖRLORADE NU...",
      "JA, GOL OCH MAIA... DEN MÖRKA ECON LÄR NOG HA FÖRSTORT DEM.",
      "EH, FÖRMODLIGEN...",
      "ÄH VEM BRYR SIG? HIT MED DE BARA, FÖR VI KAN HANDSKAS MED DE IGEN! ELLER HUR JAK?",
      "JAG SA, ELLER HUR, JAK?",
      "WOW! LÄGG NER DET, TUFFING!"
    ],
    "green-sagecage-outro-beat-boss-enough-cells": [
      "MILDA MAKTER! VAD KAN DET DÄR VARA FÖR NÅGOT?",
      "WOW, DET ÄR EN URÅLDRIG PREKURSOR DÖRR!",
      "DET VERKAR SOM ATT DEN KOMMER BARA ÖPPNAS IFALL VI FYLLER ALLA 100 HÅLEN MED ENERGI CELLER!",
      "EH, VÄR HJÄLTAR, HAR NI GLÖMT? VI HAR FAKTISKT 100 ENERGI CELLER!"
    ],
    "green-sagecage-outro-beat-boss-need-cells": [
      "MILDA MAKTER! VAD KAN DET DÄR VARA FÖR NÅGOT?",
      "WOW, DET ÄR EN URÅLDRIG PREKURSOR DÖRR!",
      "DET VERKAR SOM ATT DET BARA KOMMER ATT ÖPPNAS IFALL VI FYLLER ALLA 100 HÅLEN MED ENERGI CELLER!",
      "ÅH JÖSSES... HÄR KÖR VI IGEN!"
    ],
    "green-sagecage-outro-big-finish": [
      "WOW! VAD ÄR DET DÄR FÖR NÅGOT?",
      "DET ÄR SÅ VACKERT...",
      "HAR MAN SETT PÅ MAKEN..."
    ],
    "green-sagecage-outro-preboss": [
      "DU ÄR FÖR SENT UTE, SAMOS.",
      "SÅ FORT JAG BESITTER OBEGRÄNSAD MÖRK ECO",
      "SÅ KOMMER JAG ATT HA NYCKELN TIL SJÄLVA SKAPELSEN!",
      "DET HÄR ÄR VANSINNE!",
      "ATT SKÖPPA LÖS SÅ MYCKET MÖRK ECO KOMMER ATT FÖRSTÖRA ALLT VI KÄNNER TILL!",
      "SE BARA VAD DET HAR GJORT MED ER!",
      "DET HAR GETT OSS EN SKÖNHET BORTOM ALLT DU SKULLE KUNNA FÖRSTÅ.",
      "SKÖNHET? HAR NI TVÅ KOLLAT ER I SPEGELN PÅ SISTA TIDEN?",
      "VÄNTA BARA TILL VI ÖPPNAR UPP SILONA, LILLA VÄN.",
      "DU TROR ATT VARA KORT OCH PÄLSIG ÄR ILLA NOG?",
      "OCH TÄNKA SIG, ATT NI TVÅ RESTE HELA VÄGEN HIT FÖR ATT BE OM MIN HJÄLP.",
      "DÅRAR! NJUT AV FÖRSTA PAKETT PLATSERNA TILL ATT SKÅDA VÄRLDENS ÅTERSKAPELSE!",
      "JAK! ÅK UPP MED HISSEN OCH STOPPA DEN DÄR ROBOTEN!"
    ],
    "green-sagecage-resolution": [
      "BRA JOBBAT, POJKAR! NU ÄR NI VERKLIGA HJÄLTAR.",
      "JAG KOMMER ATT KOMBINERA MIN GRÖNA ECO KRAFT MED DE TRE ANDRA VISE MÄNNEN",
      "OCH TILLSAMMANS KOMMER VI ATT ÖPPNA SKÖLD DÄRREN SOM OMGER PREKURSOR ROBOTEN.",
      "JA JA DET DÄR LÅTER SOM EN BRA BÖRJAN.",
      "OCH SEN EFTER ATT NI HAR ÖPPNAT SKÖLDEN",
      "VAD KOMMER NI ATT GÖRA MED ROBOTEN?",
      "INGENTING ALLS, DAXTER. VI MÅSTE FORSÄTTA ATT HÅLLA SKÖLDEN ÖPPEN.",
      "DET ÄR UPP TILL ER TVÅ ATT FÖRSÖKA KOMMA PÅ ETT SÄTT ATT FÖRSTÖRA DEN DÄR ROBOTEN.",
      "ÅH, PERFEKT. JAG KOMER ATT FÅ HJÄLPA DEN SOM FÖRVANDLADE MIG TILL EN PÄLSBOLL",
      "TILL ATT FÖRSTÖRA DEN ENDA PERSON SOM SKULLE KUNNA ÄNDRA TILLBAKA MIG!",
      "FÖRST, SÅ MÅSTE NI RÖDDA VÄRLDEN!",
      "SEN SÅ KAN VI FÖRSÖKA ÖVERTYGA GOL ATT HJÄLPA DAXTER."
    ],
    "mayor-introduction": [
      "NEJ... (MUMLAR) SÄG INTE ATT NI TVÅ OCKSÅ HAR PROBLEM PRECIS SOM JAG!",
      "DET FÖRSTA JAG HÖR TALAS OM ÄR ATT MONSTER HAR SKÅDATS NÄRA BYN, OCH NU DETTA.",
      "KAN NI SE KUGGHJULEN DÄR UPP, KILLAR? SER NI DEM? SER NI ATT DE INTE RÖR PÅ SIG?",
      "DET BETYDER ATT VÅR BY INTE HAR NÅGON ENERGI!",
      "ECO STRÅLEN SOM KOMMER FRÅN JUNGELTEMPLET HAR BLIVIT AVBRYTEN!",
      "OCH HÖR NI POJKAR, ATT ALLA ÄR FÖR RÄDDA FÖR ATT GÅ UT OCH TA REDA PÅ VAD SOM HÄNDER.",
      "HAR DU BETALAT RÄKNINGEN?",
      "VISST-ELLER? ÅH-HA-ÅH, DU ÄR ROLIG.",
      "MEN LYSSNA NU, OM NI POJKAR LYCKAS LAGA ECO STRÅLEN, SÅ SKULLE JAG VILJA GE ER EN ENERGI CELL.",
      "ÅH ÅH ÅH OCH-OCH EN ANNAN SAK, EH...",
      "OM DET SKULLE VARA SÅ ATT NI SKULLE VARA INTRESSERADE AV ATT GÖRA ETT BIDRAG TILL MIN KAMPANJ ATT BLI OMVALD,",
      "SÅ-SÅ SKULLE JAG VARA VILLIG ATT GE ER YTTERLIGARE EN ENERGI CELL!",
      "DET MINSTA BIDRAGET SKULLE VARA, FÅ SE, EN VÄLDIGT GENERÖS SUMMA AV...",
      "90 PREKURSOR KULOR."
    ],
    "mayor-reminder-beams": [
      "ÄR NI REDAN TILLBAKA? OCH UTAN ATT HA LAGAT ECO STRÅLARNA?",
      "(SNYFTAR) ERAN BY BEHÖVER ER, POJKAR!"
    ],
    "mayor-reminder-donation": [
      "NÄMEN, ÄR NI HÄR FÖR ATT LÄMNA EN DONATION TILL MIN KAMPANJ, ÅH HO HO HO.",
      "90 PREKURSOR KULOR FÖR ATT KÖPA EN ENERGI CELL, TACK SÅ MYCKET."
    ],
    "mayor-resolution-beams": [
      "ÅH HO HO, VILKEN UNDERBAR SYN! JAG SKULLE VILJA TACKA ER SÅ MYCKET!",
      "OCH HELA BYN KOMMER ATT TACKA MIG-",
      "HÖR NI, POJKAR, NI HAR ÅTERSTÄLLT ENERGIN TILL BYN OCH GARANTERAT ATT JAG BLIR OMVALD!",
      "OCH FÖR DETTA, MIN POJKE, SÅ HAR DU FÖRTJÄNAT EN ENERGI CELL."
    ],
    "mayor-resolution-donation": [
      "SÅ EH, NI EH, SKULLE VILJA GÄMNA ETT BIDRAG? BRA... EN-EN-EN MYCKET STOR EN HOPPAS JAG.",
      "JISSES! AH HA HA, DET HÄR ÄR, ÅH, DET HÄR ÄR EN MYCKET STORT BIDRAG!",
      "DET ÄR VARFÖR JAG HOPPAS ATT DEN HÄR ENERGI CELLEN UPPRIKTIGT KOMMER ATT REPRESENTERA MIN TACKSAMHET."
    ],
    "minershort-introduction-gnawers": [
      "SKULLE INTENI KUNNA TA OCH GÖRA LITE NYTTA?",
      "LURKERS HAR HÅLLT PÅ ATT GRÄVA UT DEN MÖRKA GROTTAN DÄR BORTA.",
      "DET VERKAR SOM ATT DE ÄR UTE EFTEER ATT HITTA PREKURSOR ARTIFAKTER.",
      "DE KAN FÅ ARTIFAKTERNA, FÖR ALLT I HELA VÄRLDEN.",
      "FÖR ALLT I VÄRLDEN!",
      "WILLARD, KAN DU HÅLLA TRUTEN.",
      "DET ENDA JAG BRYR MIG OM ÄR ÄDELSTENAR!",
      "MEN JAG SKULLE INTE KUNNA FÅ TAG PÅ GROTTANS ÄDELSTENAR",
      "FÖR NÄR DE ÄR FÄRDIGA, SÅ TÄNKER DE KOLLAPSA STÄLLET!",
      "IFALL NI SKULLE TA HAND OM DE LURKERS SOM GNAGER PÅ STÖTTE PELARNA,",
      "SÅ SKULLE NI KUNNA RÄDDA GROTTAN ÅT MIG.",
      "STICK IVÄG MED ER NU!"
    ],
    "minershort-introduction-orbs": [
      "HÖRRU GORDU, EH, VI VERKAR HA BESÖKARE.",
      "TROR DU DET, WILLARD? HALLÅ DÄR, FRÄMLINGAR, EH, ÄR NI BARA PÅ GENOMRESA?",
      "EH, SAMMA SAK FÖR OSS, FAKTISKT. ASSÅ, VI MÅSTE BÖRJA RÖRA PÅ OSS, DET FINNS INGET ATT SE HÄR.",
      "EH, JAG TRODDE ATT DU SA ATT DET HÄR VAR EN OVÄRDERLIG ÄDELSTEN VÄRD-",
      "WILLARD!",
      "FAKTISKT, SÅ SKULLE VI BEHÖVA ENERGI CELLER. INTE ÄDELSTENAR.",
      "VI HAR FAKTTISKT FYRA STYCKEN. EH, VILL NI HA DE?",
      "DET SOM FÄGELHJÄRNAN HÄR FÖRSÖKER SÄGA ÄR,",
      "ATT VI KANSKE HAR NÅGRA ENERGI CELLER LIGGANDE HÄR NÅGONSTANS,",
      "OCH VI SKULLE NOG KUNNA GÖRA OSS AV MED DE FÖR...",
      "90 KULOR PER STYCK.",
      "VAR HAR JAG HÖRT DET FÖRR?",
      "HÖRRU, HUR HAR NI GENIER TÄNKT ER ATT FÅ DEN HÄR STORA ÄDELSTENEN UT HÄRIFRÅN I SÅ FALL?",
      "ASSÅ, SMARTSKALLE, SÅ HAR VI FAKTISKT TOLV ÅR TILL AV ATT GRÄVA FÖR ATT FÖRSÖKA KOMMA PÅ DET.",
      "EH... GORDY, SKULLE DET INTE TA KORTARE TID OM DU OCKSÅ BÖRJADE GRÄVA, FAKTISKT?"
    ],
    "minershort-introduction-switch": [
      "PSST, KILLAR. EH...",
      "PIPPIN OCH JAG HÖLL PÅ MED ATT UTFORSKA EN GROTTA SOM NI SKULLE TYCKA OM!",
      "DEN VAR FYLLD MED VACKER ORANGE METALL,",
      "OCH  DEN VAR VÄLDIGT VÄL DOLD BAKOM NÅGRA TRÄD I SNÖIGA BERGEN!",
      "JAG BERÄTTAD OM DET FÖR GORDY, MEN HAN SKREK BARA ÅT MIG FÖR ATT JAG INTE GRÄVDE!",
      "VARFÖR GRÄVER DU INTE?!",
      "FÖRLÅT!"
    ],
    "minershort-reminder-1-gnawers": [
      "SKULLE NI KUNNA TA HAND OM DE DÄR LURKERS",
      "SOM GNAGER PÅ DEN MÖRKA GROTTANS STOTTEPELAR NÅGON GÅNG!",
      "DE DÄR PELARNA KAN INTE STÅ EMOT HUR MYCKET STRYK SOM HELST!"
    ],
    "minershort-reminder-1-orbs": [
      "GLÖM INTE BORT VÅR ÖVERENSKOMMELSE. KOM HIT TILL OSS MED 100 KULOR.",
      "EH... DU SA JU 90.",
      "WILLARD!",
      "OK DÅ. 90 KULOR PER ENERGI CELL."
    ],
    "minershort-reminder-1-switch": [
      "HAR NI LYCKATS HITTA GROTTAN BAKOM TRÄDEN I SNÖIGA BERGEN ÄN?",
      "JAG TÄNKER GÅ DIT SNART, FÖR ATT GÖMMA MIG FRÅN GORDY, FÖR HAN HÅLLER PÅ ATT SKRIKER PÅ MIG IGEN!",
      "WILLARD!!"
    ],
    "minershort-reminder-2-orbs": [
      "EH, GORDY?",
      "90 KULOR PER ENERGI CELL! JISSES!"
    ],
    "minershort-resolution-1-orbs": [
      "ÅH, OK DÅ.",
      "HÄR HAR NI EN ENERGI CELL FÖR ERA KULOR."
    ],
    "minershort-resolution-2-orbs": [
      "ÅH! ÅH, JAG FIXAR DET DEN HÄR GÅNGEN! EH...",
      "HÄR HAR NI EN...",
      "EH... HÄR HAR NI EN...!",
      "EN ENERGI CELL!",
      "JA, JA... PRECIS SOM HAN SA.",
      "DET VAR DET. NI HAR HELT RENSAT UT OSS.",
      "INGA! FLER! ENERGI! CELLER!"
    ],
    "oracle-intro-1": [
      "VEM VÄCKER ORAKLET?",
      "VÄNTA, EN AV ER HAR LJUSET INUTI.",
      "FRÅN TIDEN FÖRE TIDEN, SÅ HAR JAG SETT PÅ OCH VÄNTAT",
      "PÅ ATT DEN SANNA HJÄLTEN SKA ÅTERVÄNDA.",
      "VISA MIG 120 PREKURSOR KULOR",
      "FÖR AT FÅ VARJE ENERGI CELL JAG BESITTER."
    ],
    "oracle-intro-2": [
      "VAR FÖRSIKTIG INFÖR DET MÖRKA LJUSET,",
      "EFTERSOM DET HAR SKAKAT OM ÖDET FÖR EN AV ER.",
      "KOM HIT MED 120 PREKURSOR KULOR",
      "FÖR ATT FÅ VARJE ENERGI CELL JAG BESITTER."
    ],
    "oracle-intro-3": [
      "LETA REDA PÅ DET RENA LJUSET, FÖR INUTI DESS STARKA FLAMMA LIGGER SVAREN.",
      "DU KAN FÖRTJÄNA MINA ENERGI CELLER",
      "GENOM ATT KOMMA HIT MED 120 PREKURSOR KULOR FÖR VARJE."
    ],
    "oracle-left-eye-1": [
      "DU HAR VISAT DIG VARA VÄRDIG. HÄR ÄR EN ENERGI CELL."
    ],
    "oracle-left-eye-2": [
      "FÖR DIN OFFERGÅVA, SÅ ERBJUDER JAG EN ENERGI CELL."
    ],
    "oracle-left-eye-3": [
      "FÖR DIN FÖRTJÄNST, SÅ ÄR EN ENERGI CELL DIN BELÖNING."
    ],
    "oracle-reminder-1": [
      "KOM HIT MED 120 PREKURSOR KULOR",
      "OCH JAG KOMER ATT BELÖNA DIG MED EN ENERGI CELL."
    ],
    "oracle-reminder-2": [
      "VIS MIG 120 PREKURSOR KULOR",
      "OCH EN ENERGI CELL KOMMER ATT BLI ER BELÖNING."
    ],
    "oracle-reminder-3": [
      "NI MÅSTE KOMMA HIT MED 120 PREKURSOR KULOR",
      "TILL MIG FÖR ATT FÅ VARJE ENERGI CELL JAG BESITTER."
    ],
    "oracle-right-eye-1": [
      "FÖR ER GÅVA, SÅ ÄR EN TILL ENERGI CELL ERAN."
    ],
    "oracle-right-eye-2": [
      "HÄR ÄR YTTERLIGARE EN ENERGI CELL FÖR ERT UPPDRAG."
    ],
    "oracle-right-eye-3": [
      "NI HAR YTTERLIGARE FÅTT EN TILL ENERIG CELL."
    ],
    "redsage-resolution": [
      "HI-HI-HI... NI HAR ÄNTLIGEN KOMMIT FÖR ATT RÄDDA MIG.",
      "VET NI ENS HUR LÄNGE JAG HAR VARIT HÄR INNE?",
      "VARÖFR TOG DET SÅ LÅNG TID? OCH EH, HI-HI-HI...",
      "VAD ÄR ERA NAMN?",
      "JAG HETER DAXTER! HAN HETER JAK, OCH HAN ÄR MED MIG.",
      "BRA JOBBAT, DAXTER. DU ÄR EN VERKLIG HJÄLTE.",
      "NI MÅSTE TA OCH STOPPA GOL FRÅN ATT AVFYRA ROBOTEN.",
      "JAG KOMMER ATT ANVÄNDA MINA ECO KRAFTER TILL ATT HJÄLPA TILL ATT ÖPPNA SKÖLD DÖRREN."
    ],
    "sage-bluehut-introduction-crop-dusting": [
      "NÅ, SITUATIONEN HÄR LUKTAR VÄRRE ÄN EN LURKERS ARMHÅLA.",
      "INNAN DEN BLÅ VISE MANENS FÖRSVINNANDE,",
      "SÅ SKREV HAN NER OMFATTANDE PROBLEM I ALLA OMKRINGLIGGANDE OMRÅDENA.",
      "DET SOM INTRESSERAR MIG MEST ÄR MÖRK ECO SOM HAR INFEKTERAT",
      "NÅGRA OSKYLDIGA VÄXTER I PREKURSOR DALEN.",
      "KEIRA KOMMER ATT TELEPORTERA ER A-GRAV ZOOMER TILL DEN NÄRMASTE TRANSPORT PLATTAN.",
      "KÖR ZOOMERN TILL EN GRÖN ECO KÄLLA,",
      "OCH FÖR MED ER DEN GRÖNA ECO TILL DE INFEKTERADE VÄXTERNA.",
      "DET SKULLE NOG KUNNA LÄKA DEM.",
      "MISSA INTE EN ENDA VÄXT, FÖR I SÅ FALL SÅ KOMMER DE INFEKTERADE VÄXTERNA ATT SAKTA INFEKTERA DE FRISKA VÄXTERNA PÅ NYTT.",
      "OCH, DAXTER...",
      "BÖRJA TA OCH RENSA UPP HÄR!",
      "OCH GLÖM INTE BORT ATT TA HÖRNEN!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "NÅ, JAG HOPPAS ATT NI HAR PACKAT NÅGON LUNCH. FÖR VI ÄR VI HAR JUST PRECIS BÖRJAT.",
      "ENLIGT DEN BLÅ VISE MANNENS ANTECKNINGAR,",
      "SÅ VERKAR DET SOM ATT LURKERS HAR INFILTRERAT TRÄSKET TVÄRS ÖVER BUKTEN.",
      "TYDLIGEN, SÅ VERKAR DET SOM ATT DE PLANERAR ATT ANVÄNDA ETT LUFTSKEPP",
      "FÖR ATT KUNNA LYFTA UPP NÅGON VIKTIG PREKURSOR ARTIFAKT FRÅN LERAN.",
      "NI KOMMER BEHÖVA BEGE ER BORT DIT FÖR ATT KUNNA FÅ LOSS DERAS GREPP.",
      "VEM VET VAD DE VIL MED DEN DÄR ARTIFAKTEN,",
      "MEN PRECIS SOM ANDRÄKTEN FRÅN DEN HÄR ORANGA SAKEN, SÅ KAN DET INTE VARA NÅGOT BRA."
    ],
    "sage-bluehut-reminder-1-crop-dusting": [
      "MINA ÖGON MÅSTE SPELA MIG ETT SPRATT!",
      "EFTERSOM JAG VET ATT NI TVÅ ÄR DJUPT INNE I PREKURSOR DALEN,",
      "OCH FÖRSÖKER RÄDDA VÄXTERNA SOM HAR BLIVIT INFEKTERADE AV MÖRK ECO."
    ],
    "sage-bluehut-reminder-1-prec-arm": [
      "VAD GÖR NI HÄR REDAN TILLBAKA?",
      "JAG KAN SE FRÅN BALKONGEN",
      "ATT LURKER SKEPPET FORTFARANDE SVÄVAR OVANFÖR TRÄSKET.",
      "NI VERKAR UPPENBART INTE HA KLARAT AV ERT UPPDRAG ÄNNU.",
      "RÖR PÅ ER!"
    ],
    "sage-intro-sequence-a": [
      "JAG HAR SPENDERAT MITT LIV SÖKANDE EFTER SVAREN SOM MIN FAR,",
      "OCH MIN FARFAR MISSLYCKADES ATT HITTA.",
      "VILKA VAR PREKURSORS?",
      "VARFÖR SKAPADE DE DEM MÅNGA MONOLITERNA SOM OMGER VÅR PLANET?",
      "HUR TÄMDE DE ECO, VÄRLDENS LIVSENERGI?",
      "VAD VAR DERAS SYFTE? OCH VARFÖR FÖRSVANN DE?",
      "JAG HAR FRÅGAT VÄXTERNA, MEN DE MINNS INTE.",
      "VÄXTERNA HAR FRÅGAT STENARNA, MEN STENARNA KOMMER INTE IHÅG.",
      "TILL OCH MED STENARNA KOMMER INTE IHÅG.",
      "VARJE BEN I MIN KROPP SÄGER MIG ATT SVAREN VILAR",
      "PÅ AXLARNA AV EN UNG POJKE",
      "OVETANDE OM HANS ÖDE, OINTREWSSERAD I SÖKANDET EFTER SANNINGEN",
      "OCH LYSSNAR INTE PÅ MIN VÄGLEDNING!",
      "OCH VARFÖR SKULLE HAN VILJA LYSSNA PÅ GAMLA SAMOS DEN VISE ANNARS?",
      "JAG ÄR BARA MÄSTAREN AV GRÖN ECO, EN AV DE VISASTE MÄNNEN PÅ PLANETEN!",
      "SÅ DET VERKAE SOM ATT SVARET INTE BÖRJAR MED FÖRSIKTIG EFTERFORSKNING",
      "ELLER FÖRNUFTIGT TÄNKANDE.",
      "NEJ! SOM MED MÅNGA AV ÖDET'S MYSTERIER",
      "BÖRJAR DET MED BARA EN BIT AV OLYDNAD.",
      "HALLÅ! EH, JAK? GAMLA GRÖNA TOKSTOLLEN SA TILL OSS ATT INTE KOMMA HIT!"
    ],
    "sage-intro-sequence-d1": [
      "VAD I HELA FRIDEN VILL NI TVÅ?",
      "VI- VI- VI VAR- DE VAR- JAG ÄR- JAG VAR-",
      "SÄG INTE! ISTÄLLET FÖR ATT BRY SIG OM MIN VIDHET",
      "NI TVÅ GICK OCH DRÄLLDE OMKRING",
      "I DEN ENDA PLATS SOM JAG SA TILL ER ATT INTE GÅ TILL: DIMMIGA ÖN!",
      "DET STÄMMER! OCH SEN-",
      "OCH, DAXTER, DU TOG ÄNTLIGEN ETT VÄL-BEHÖVLIGT BAD",
      "MEN I ET BADKAR FYLLT MED MÖRK ECO.",
      "HÖRRU DU, GAMLA MAN, SKA DU BARA FORTSÄTTA BABBLA",
      "ELLER SKA DU KUNNA HJÄLPA MIG UT UR DEN HÄR RÖRAN!?",
      "JAG KOMMER FORTSÄTTA BABBLA! FÖR ENLIGT MIN PROFESSIONELLA ÅSIKT",
      "ÄNDRINGEN ÄR EN FÖRBÄTTRING.",
      "OCH DESSUTOM… JAK SKULLE INTE KUNNA HJÄLPA DIG ÄVEN OM JAG KUNDE DET.",
      "VA!?",
      "DET FINNS BARA EN PERSON SOM HAR STUDERAT MÖRK ECO TILLRÄCKLIGT LÄNGE",
      "FÖR ATT KUNNA HA EN CHANS ATT ÄNDRA DIG TILLBAKA TILL DIN FÖRRA FORM:",
      "GOL ACHERON, DEN VISE MANNEN.",
      "MEN HAN BOR LÅNGT NORRUT. LÅNGT, LÅNGT NORRUT.",
      "INGEN HAR PRATAT MED HONOM I ÅRATAL.",
      "JAG SKULLE KUNNA TELEPORTERA DIG DIT, MEN JAG KAN INTE GÖRA DET HELLER.",
      "INGEN AV DE TRE VISE MÄN SOM UPPRÄTTHÅLLER DE ANDRA TELEPORTER PORTARNA",
      "HAR VERKAT VILLIGA ATT DRA DERAS STRÅ TILL STACKEN UNDER GANSKA LÅNG TID!"
    ],
    "sage-intro-sequence-d2": [
      "DEN ENDA ANDRA VÄGEN NORRUT ÄR TILL FOTS GENOM ELD FLODBÄDDEN",
      "MEN DESS VULKANISKA JORD ÄR TILLRÄCKLIGT VARM FÖR ATT SMÄLTA PREKURSOR METALL.",
      "DU KAN INTE BARA GÅ IGENOM DET.",
      "MEN DU SKULLE KUNNA FLYGA ÖVER DET",
      "OM DU HADE EN ZOOMER UTRUSTAD MED EN VÄRMESKÖLD.",
      "JAG RÅKAR FAKTISKT HÅLLA PÅ MED ATT ARBETA PÅ JUST EN SÅDAN SAK JUST FÖR TILLFÄLLET.",
      "ALT JAG SKULLE BEHÖVA ÄR 20 ENERGI CELLER FÖR ATT GE DEN TILLRÄCKLIGT MED ENERGI",
      "FÖR ATT KUNNA MOTSTÅ FLODBÄDDENS HETTA. VISST ÄR DET VÄL SÅ, PAPPA?",
      "JA, KEIRA, DET SKULLE NOG FUNGERA. MEN VAR SKULLE EN POJKE",
      "OCH EN LITEN RÅTTA!",
      "LYCKAS HITTA 20 ENERGI CELLER?",
      "FRÅN BYBORNA! FLESTA AV DE HAR EN ENERGI CELL ELLER TVÅ",
      "LIGGANDE RUNT NÅGONSTANS.",
      "OCH ÄVEN OM DE INTE ÄR JUST VILLIGA ATT GE BORT DEM",
      "MUTA DE MED NÅGRA PREKURSOR KULOR SKULLE NOG UNDERLÄTTA SAKEN.",
      "OCH JAG SKULLE SLÅ VAD OM ATT DET FINNS ÄNNU FLER AV DE UTE I DET VILDA SOM BARA VÄNTAR PÅ NÅGON",
      "MODIG ÄVENTYRARE ATT HITTA.",
      "TJA VI HAR DEN MODIGE ÄVENTYRAREN, I ALLA FALL.",
      "MODIG ÄVENTYRARE?",
      "NI TVÅ SKULLE INTE ENS KUNNA HITTA ER VÄG UT UR BYN UTAN TRÄNING!",
      "INNAN NI GÖR NÅGONTING ANNAT, VORE DET BÄST OM NI GÅR IGENOM PORTALEN OCH FÅ",
      "NÅGON ÖVNING PÅ GEJSER ÖN.",
      "ÖH, VI KOMMER VÄL INTE HITTA NÅGOT MER AV DET DÄR MÖRKA SLIMIGA ECO SAKEN, KOMMER VI?",
      "FÖR JAG SKULLE INTE TYCKA OM ATT RAMLA I IGEN OCH FÖRVANDLAS TILL DIG!",
      "HOPPA IN DÄR! INNAN JAG FÖRVANDLAR ER BÅDA TILL VÄXTER!"
    ],
    "sage-intro-sequence-e": [
      "BRA TRÄNING, POJKAR, MEN DET ÄR INGENTING JÄMFÖRT MED DE UTMANINGAR SOM LIGGER FRAMFÖR ER.",
      "ÄSCH, DET FINNS INGA PROBLEM. VI HAR TEKNIKERNA, ELLER HUR JAK?",
      "VI SKULLE GÄRNA STANNA OCH SMÅPARTA, STORA VISE, MEN VI ÄR EH..",
      "SUGNA PÅ ATT FORSÄTTA MED VÅRA ÄVENTYR.",
      "VISST, VISST, IVÄG DÅ OCH ÄVENTYRA DÅ.",
      "OCH NÄR NI VÄL ÄR UTE PÅ ERA ÄVENTYR, SKULLE NI INTE KUNNA GÖRA ER SJÄLVA ANVÄNDBARA?",
      "MINA JÄKLA GRÖNA ECO SAMLARE ÄR IGENTÄPPTA IGEN.",
      "STICK UT TILL BORTESTA SIDAN AV STRANDEN OCH RENSA UT DEM ÄR NI SNÄLLA.",
      "FÖLJ LAMPORNA, DE KOMMER ATT LEDA ER RAKT DIT.",
      "OCH NU, ALLESAMMANS..",
      "STICK HÄRIFRÅN!"
    ],
    "sage-introduction-misty-cannon": [
      "AH, OM DET INTE ÄR DE SEGRANDE HJÄLTARNA.",
      "BRA, JAG SKULLE BEHÖVA PRATA MED ER TVÅ OM NÅGOT ALLVARLIGT.",
      "DET VERKAR SOM DET PÅGÅR GANSKA MYCKET LURKER AKTIVITET PÅ DIMMIGA ÖN.",
      "JAG KAN SE ATT DE BOMBARDERAR PREKURSOR SILON FRÅN MITT UTKIKSTORN.",
      "OM LURKERS ÖPPNAR UPP DEN OCH SLÄPPER UT ALL MÖRK ECO, SÅ SKULLE VI ALLA SLUTA MED ATT",
      "VI SPRINGER RUNT OCH SER LIKA PINSAMA UT SOM DEN HÄR IRRITERANDE LILLA EXEMPLARET.",
      "JAK, DET ÄR DAGS FÖR DIG ATT VISA VAD DU GÅR FÖR.",
      "FÖRSÖK ATT FÅ FISKAREN ATT TILLÅTA DIG ATT TA HANS BÅT TILLBAKA TILL DIMMIGA ÖN",
      "OCH BEGE DIG UPP TILL TOPPEN AV PREKURSOR SILON OCH TA HAND OM DEN DÄR KANONEN.",
      "OCH... VAD SKA JAG GÖRA DÅ?",
      "DU? VARFÖR TAR DU INTE OCH BÖRJAR SKRUBBA MINA GOLV? DE VERKAR HA SLUTAT ATT SE RENA NU PÅ SISTA TIDEN."
    ],
    "sage-reminder-1-ecorocks": [
      "VILKA MODIGA ÄVNETURARE NI TVÅ VERKAR VARA.",
      "REDAN TILLBAKA OCH UTAN ATT HA RENSAT UT MINA BLOCKERADE ECO SAMLARE!",
      "DE ÄR LÄNGST BORT PÅ STRANDEN, KILLAR.",
      "NU...",
      "RÖR PÅ ER!"
    ],
    "sage-reminder-1-generic": [
      "VAD GÖR NI TVÅ HÄR? NI HAR ENERGI CELLER ATT SAMAL!",
      "LÄMNA MIG I FRED... INNAN NI HAR DE!"
    ],
    "sage-reminder-1-misty-cannon": [
      "BOMBARDEMANGET HÅLLER PÅ ATT FÖRVÄRRAS!",
      "FÅ TAG PÅ FISKAREN I JUNGELN, FÅ TILLÅTELSE ATT ANVÄNDA HANS BÅT",
      "OCH BEGE DIG BORT TILL DIMMIGA ÖN FÖR ATT STOPPA KANONEN.",
      "OCH DU DAXTER, DÅ MÅSTE BÖRJA MOPPA GOLVEN. DET HÄR STÄLLET ÄR EN ENDA RÖRA!"
    ],
    "sage-reminder-2-generic": [
      "NI TVÅ VERKAR INTE RIKTIGT FÖRSTÅ ALLVARET I DEN HÄR SITUATIONEN.",
      "DET HÄR HANDLAR OM MER ÄN ATT EN POJKE BLIVIT PÄSIG. DET HÄR HANDLAR MER OM VÅRT LIV SOM VI KÄNNER TILL DET.",
      "SESÅ, BEGE ER NU UT DÄR OCH UPPFYLL ERT ÖDE."
    ],
    "sage-village3-introduction": [
      "ÅH! JAG UNDRAR ALLTID OM JAG HÅLLER PÅ ATT BLI AV MED NÅGRA KROPPSDELAR INNE I DE DÄR SAKERNA!",
      "MILDA MAKTER! DEN RÖDE VISE MANNENS LABB SER VÄRRE UT ÄN HUR DEN BLÅ VISE MANNENS VAR!",
      "NÄ, DET VERKAR DEFINITVT SE UT SOM OM DET HADE FÖREKOMMIT MOTSTÅND HÄR.",
      "HA HA HA HA HA!",
      "JAG SKULLE VERKLIGEN INTE KALLA DET FÖR MOTSTÅND",
      "ELLER SKULLE DU SÄGA SÅ, KÄRA SYSTER?",
      "VERKLIGEN INTE. DEN RÖDE VISE MANNEN GAV UP ALLDELES FÖR ENKELT.",
      "INTE ROLIGT ALLS.",
      "GOL? ÄR DET VERKLIGEN DU?",
      "DU VERKAR ÄNTLIGEN HA TAPPAT FÖRSTÅNDET, ELLER?",
      "OCH DU, MAIA! JAG SA JU ÅT ER ATT DEN MÖRKA ECON SKULLE PÅVERKA ER BÅDA!",
      "HMPH, INGEN LYSSNAR LÄNGRE PÅ SAMOS...",
      "VAD HAR NI GJORT MED DEN BLÅ VISE MANEN OCH RÖDE VISE MANEN?",
      "VAR INTE OROLIG FÖR DINA FÄRGGLADA VÄNNER, DIN GAMLA DÅRE.",
      "MÅR ALLDELES UTMÄRKT I VÅRT CITADELL. DE ÄR VÅRA SPECIELLA GÄSTER.",
      "DE HAR TACKSAMT ERBJUDIT SIG ATT HJÄLPA OSS MED ETT LITET PROJEKT.",
      "DU HADE FEL, SAMOS. MÖRK ECO KAN KONTROLLERAS!",
      "VI HAR LÄRT OSS DESS HEMLIGHETER, OCH NU KAN VI FORMA OM VÄRLDEN PRECIS SOM VI VILL.",
      "NI KAN INTE KONTROLLERA MÖRK ECO SJÄLV! TILL OCH MED PREKURSORS KUNDE INTE-",
      "FRAM TILLS NU, SÅ VAR VI TVUNGNA ATT HANKA OSS FRAM MED DET LILLA MÖRK ECO",
      "SOM VI KUNE KOMMA ÅT UPPE VID YTAN.",
      "MEN SNART, SÅ KOMMER VI HA TILLGÅNG TILL OFANTLIGA MÄNGDER",
      "AV MÖRK ECO SOM FINNS LAGRAD DJUPT UNDER MARKEN.",
      "INTE SILONA!",
      "JO, JUST SILONA!",
      "DE KOMMER ATT ÖPPNAS, OCH ALL MÖRK ECO I HELA VÄRLDEN KOMMER ATT BLI VÅR!",
      "MEN DET ÄR JU OMÖJLIGT! BARA EN PREKURSOR ROBOT-",
      "ÅH, SE INTE SÅ UPPRÖRD UT, SAMOS.",
      "VI HAR STORA PLANER ÅT DIG MED.",
      "AH HA HA HA HA HA HA! ÅH...",
      "VÄNTA HÄR LITE NU!",
      "DET DÄR VAR GOL?",
      "SAMMA GOL SOM PÅSTÅS SKLLE KUNNA ÄNDRA TILBAKA MIG?",
      "GOL ÄR DEN PERSON SOM FÖRSÖKER DÖDA OSS ALL?!",
      "JAG ÄR DÖDSDÖMD.",
      "VI ÄR KANSKE ALLA DÖDSDÖMDA.",
      "OM DE ÖPPNAR SILONA, SÅ KOMMER DEN MÖRKA ECON ATT",
      "RÖR OM OCH FÖRSTÖRA ALLT SOM DEN VIDRÖR!",
      "VI MÅSTE HELT ENKELT TA OSS TILL DERAS CITADELL, FÖR ATT KUNNA STOPPA DEM!",
      "SNABBASTE VÄGEN ATT KOMMA DIT ÄR GENOM LAVA TUNNELN",
      "SOM FINNS VID BOTTEN AV DEN HÄR KRATERN.",
      "BARA NÅGRA FÅ ENERGI CELLER TILL, SÅ SKULLE ER ZOOMERS VÄRMESKÖLD",
      "KUNNA TA ER SÄKERT ÖVER TILL ANDRA SIDAN LAVAN.",
      "OK DÅ, MIN POJKE. DU VET VAD SOM MÅSTE GÖRAS.",
      "TA MED DIG HÅRBOLLEN OCH GÅ OCH SAMLA IN FLER ENERGI CELLER."
    ],
    "sage-village3-introduction-dark-eco": [
      "HERREJÖSSES!",
      "DET VERKAR SOM ATT DET FINNS EN STOR NÄRVARO AV LURKERS I SPINDEL GROTTORNA!",
      "PERFEKT. DET LÅTER SOM ETT RIKTIGT HÄRLIGT STÄLLE.",
      "LÅT MIG GISSA. DET FINNS SPINDLAR I SPINDEL GROTTORNA, ELLER HUR?",
      "SÅKLART ATT DET FINNS SPINDLAR I SPINDEL GROTTORNA!",
      "MEN DET ÄR DET MINSTA AV ERA PROBLEM!",
      "LURKERS ÄR UTE EFTER KRISTALLER SOM ÄR GJORDA AV KONCENTRERAD MÖRK ECO.",
      "NI MÅSTE FÖRSTÖRA DE DÄR KRISTALLERNA INNAN MONSTREN",
      "FÅR TAG PÅ DE!",
      "SÄTT FART!"
    ],
    "sage-village3-introduction-rams": [
      "JAG ÄR GLAD ATT SE ER HÄR. DET VERKAR VARA LURKER AKTIVITET UPP I BERGEN.",
      "TYDLIGEN SÅ HAR DE UPPTÄCKT, OCH FÖRSÖKER ATT TA BORT,",
      "NÅGRA FÖRVAR AV MÖRK ECO SOM HAR VARIT NERFRUSEN I GLACIÄREN.",
      "MEDAN NI ÄR DÄR UPP OCH LETAR RUNT EFTER ENERGI CELLER",
      "SÅ KAN NI SE TILL ATT STOPPA DE DÄR LURKERS, OCH SE TILL ATT MINDRE MÖRK ECO FALLER I GOLS HÄNDER."
    ],
    "sage-village3-reminder-1-dark-eco": [
      "NI MÅSTE TA OCH FÖRSTÖRA DE MÖRKA ECO KRISTALLERNA I SPINDEL GROTTORNA!"
    ],
    "sage-village3-reminder-1-rams": [
      "VI KAN INTE LÅTA LURKERS FÅ TAG PÅ DE MÖRKA ECO FÖRVAREN.",
      "BEGE ER UPP TILL DE SNÖIGA TOPPARNA OCH SE TILL ATT STOPPA DEM!"
    ],
    "sculptor-introduction": [
      "HALLÅ DÄR... LILLA PÄLSIGA KOMPIS!",
      "ÅH... JAG TRODDE FÖR EN STUND ATT DU VAR MIN MUSA.",
      "DIN VAD DÅ?",
      "HAR NI ALDRIG SETT EN MUSA INNAN?",
      "DET ÄR EN LYSANDE EKORRE RUNT DIN STORLEK, FULL AV ENERGI, OCH LIKA GALEN SOM EN LÄRKA!",
      "ÅH, JAG FÖRSTÅR! PRECIS SOM EN HJÄLPREDA.",
      "SOM DET FAKTISKT SKULLE VARA PRECIS NU, UTAN MIN MUSA, SÅ KAN JAG INTE SKULPTERA.",
      "MEN MED HENNE RUNT MIG... SÅ SER JAG SKÖNHET I ALLT RUNT OMKRING, FÖRSTÅR NI?",
      "JUST NU SKULLE JAG INTE ENS KUNNA MEJSLA MIG UT UR EN LÅDA.",
      "JAG TROR ATT HON STACK IVÄG TILL DEN DÄR DIMMIGA ÖN.",
      "AH, JAG HOPPAS BARA ATT HON MÅR BRA.",
      "DET ÄR VÄRT EN ENERGI CELL OM NI KAN FÖRA HENNE TILLBAKA TILL MIG!",
      "VÄNTA BARA EN STUND! VI TÄNKER INTE GÅ TILLBAKA TILL DIMMIGA ÖN!",
      "ELLER SKA VI?"
    ],
    "sculptor-reminder-1": [
      "NÄMEN HALLÅ DÄR KOMPISAR! HAR NI LYCKATS HITTA MIN MUSA ÄN?"
    ],
    "sculptor-resolution": [
      "ÅH, MIN MUSA! NI RÖDDADE HENNE! ÅH, NI ÄR VERKLIGEN BÄST!",
      "HÄR, TA DEN HÄR ENERGI CELLEN. JAG KOMMER INTE BEHÖVA DEN NU NÄR JAG HAR FÅTT MIN INSPIRATION TILLBAKA!"
    ],
    "sidekick-human-intro-sequence-b": [
      "FORSÄTT DIT LETANDE EFTER ARTIFAKTER OCH ECO.",
      "DU VET VAD SOM BEHÖVS GÖRA OM DEN LOKALA BEFOLKNINGEN BESITTER PREKUSOR FÖREMÅL.",
      "SLÅ TILL HÅRT MOT VEM SOM HELST SOM STRÄVAR BORT FRÅN BYN.",
      "VI KOMMER ATT ATTACKERA DEN I RIMLIG TID."
    ],
    "sidekick-human-intro-sequence-c": [
      "VAD GÖR VI HÄR I ALLA FALL, JAK? DET HÄR STÄLLET GER MIG RYSNINGAR!",
      "HUH?",
      "(STÖNAR) DUMMA PREKURSOR SKRÄP!",
      "AH! VAD ÄR DET DÄR MÖRKA GEGGAN? DET SER VISST INTE VÄNLIGT UT.",
      "DEN VISE MANNEN HÅLLER PÅ ATT TJATA OM PREKURSORS SOM BYGGDE DEN HÄRPLATSEN HELA TIDEN.",
      "VART TOG DE VÄGEN? VARFÖR BYGGDE DE DEN HÄR SKITEN?",
      "ASSÅ JAG GILLAR PREKURSOR KULOR OCH ENERGI CELLER PRECIS LIKA MYCKET SOMVEM SOM HELST",
      "MEN OM DU FRÅGAR MIG, SÅ MÅSTE DE HA VARIT RIKTIGA SOPOR.",
      "WOW! HUR GJORDE DU DET DÄR?",
      "JAK, JAG TROR ATT VI ÄR I TRUBBEL!",
      "JISSES, DET DÄR STACK.",
      "JAG SA JU TILL DIG ATT VI INTE SKULLE HA KOMMIT HIT, OCH LYSSNADE DU ELLER?",
      "VAD ÄR DET?",
      "AAAAHH!!",
      "OK, OK. JAG ÄR OK, JAG ÄR OK..",
      "AAAHHH!!"
    ],
    "warrior-introduction": [
      "ÅH... MITT ÖMMA HUVUD.",
      "JAG TVIVLAR PÅ ATT DET ÄR NÅGOT AV DINA KÄNSLIGA ORGAN!",
      "STRUNTA BARA I DET, TUFFING!",
      "ÅH, VISST, JAG HAR VARIT TUFF EN GÅNG I TIDEN.",
      "JAG VAR KANSKE EN AV DE TUFFASTE SOM FANNS.",
      "JAG FÖRSVARADE DEN HÄR BYN HELT PÅ EGEN HAND MOT DE HÄR HEMSKA VARELSERNA UNDER NÄSTAN ETT HELT ÅR!",
      "SEN KOM DET DÄR HEMSKA MONSTRET OCH STARTADE STENBOMBARDEMANGET.",
      "OCH SÅ, STÄRKT AV SJÄLVFÖRTROENDE, OCH MED EN RUSTNING SOM SKEN I SOLEN...",
      "KLÄTTRADE JAG UPP FÖR KULLEN FÖR ATT TA MIG AN HONOM...!",
      "MEN HAN HAMRADE MIG PÅ SAMMA SÄTT SOM OM NÅGON SKULLE PLATTA TILL EN YAKOWSTEK.",
      "HAR DU FÖRSÖKT ATT ATTACKERA HONOM MED DIN MELANKOLIK?",
      "FÖR DEN HÅLLER PÅ ATT TA KÅL PÅ MIG!",
      "EFTER MITT FÖRRA FÖRBLUFFANDE MISSLYCKANDE,",
      "SÅ STÄNGDE HAN AV PASSAGEN TILL SITT NÄSTE MED HJÄLP AV EN 30 TON TUNG STEN,",
      "VILKET RESULTERADE I ATT INGEN KUNDE UTMANA HONOM IGEN.",
      "SÅ, VÅR VISE MAN, EN MÄSTARE AV BLÅ ECO OCH ETT MEKANISKT GENI, KOM PÅ EN MASKIN",
      "SOM SKULLE VARA KAPABEL ATT KUNNA FLYTTA STENEN UR VÄGEN...!",
      "MEN TYVÄRR, SÅ FÖRSVANN HAN INNAN VI HADE EN CHANS ATT AKTIVERA DEN.",
      "OCH HAN TOG MED SIG ALLA SINA ENERGI CELLER.",
      "JAG LYCKADES ÅTMINSTONE DRA UT TILLRÄCKLIGT MÅNGA PONTONER FRÅN VÅR BRO FÖR ATT FÖRHINDRA",
      "ATT MONSTRET SKA KUNNA KOMMA NER HIT OCH GÖRA MIG NÅGON SKADA.",
      "VISST, BRA, BRA JOBBAT, TUFFING. MEN, EM...",
      "VI SKULLE BEHÖVA BE DIG AT, EH... SÄTTA TILLBAKA DE, SÅ ATT SÄGA.",
      "ÅH, VISST! OCH BESEGLA MIN UNDERGÅNG?",
      "(SUCKAR)",
      "OK DÅ. VISST.",
      "KOM HIT MED 90 PREKURSOR KULOR OCH JAG KOMMER ATT SLÄPPA LÖS PONTONERNA.",
      "MEN JAG TÄNKER INTE SLÅSS MOT DET DÄR MONSTRET IGEN!"
    ],
    "warrior-reminder-1": [
      "TA ALL TID NI BEHÖVER PÅ ER ATT KOMMA HIT MED PREKURSOR KULORNA",
      "FÖR JAG SER INTE FRAM EMOT ATT LAGA PONTONBRON NÄR SOM HELST."
    ],
    "warrior-resolution": [
      "ÅH.",
      "UNDERBART.",
      "NI HAR FÖRT MED ER  PREKURSOR KULORNA.",
      "OK DÅ.",
      "JAG SKA TA OCH LAGA BRON.",
      "MEN FRÅGA MIG INTE ATT BLI INVOLVERAD MED DEN DÄR VARELSEN IGEN!"
    ],
    "yellowsage-resolution": [
      "VEM HADE KUNNA ANA ATT JAG SKULLE FÅ SKÅDA DAGEN",
      "DÅ JAG BEHÖVDE BLI RÖDDAD AV EN POJKE OCH HANS MUSKRÅTTA!",
      "ÅH... JAG KOMMER ATT GE GOL OCH MAIA",
      "EN LITEN ÅTERBETALNING FÖR DEN HÄR PINSAMHETEN!",
      "SEDAN TAR VI EN TITT PÅ HUR MAN KAN TILAGA EN MUSKRÅTTA STUVNING...",
      "(GASPAR)"
    ]
  },
  "hints": {
    "ASSTLP01": [
      "HMM..."
    ],
    "ASSTLP02": [
      "JAG MÅSTE FÖRSÖKA FÅ DEN HÄR VÄRMESKÖDEN ATT FUNGERA..."
    ],
    "ASSTLP03": [
      "VI BEHÖVER ENERGI CELLER FÖR ATT KUNNA GE ENERGI TILL VÄRMESKÖDEN..."
    ],
    "ASSTLP04": [
      "VAR ÄR MIN SKIFTNYCKEL?"
    ],
    "ASSTLP05": [
      "ELD FLODBÄDDEN ÄR SÅ VARM..."
    ],
    "ASSTLP23": [
      "FÅ SE NU, HUR LYCKADES HAN FÅ SVÄVAREN TILL ATT FUNGERA?"
    ],
    "ASSTLP24": [
      "NU, ÄVEN OM VI HAR ENERGI CELLER,",
      "KOMMER VI HA TILLRÄCKLIGT MED ENERGI?"
    ],
    "ASSTLP30": [
      "HM, FÅ SE NU..."
    ],
    "ASSTLP31": [
      "HM."
    ],
    "ASSTLP32": [
      "ÅH, KÄRA NÅN..."
    ],
    "ASSTLP33": [
      "A-HA!"
    ],
    "ASSTLP34": [
      "HMM... VAD HÅLLER GOL OCH MAIA PÅ MED?"
    ],
    "ASSTLP35": [
      "HMM... VI MÅSTE TA OSS TILL PREKURSOR STAN."
    ],
    "ASSTLP36": [
      "HMM. VÄRMESKÖLDEN KOMMER ATT BEHÖVA MYCKET FLER ENERGI",
      "FÖR ATT KUNNA STÅ EMOT LAVAN."
    ],
    "ASSTLP37": [
      "ÅH... VI MÅSTE TA OCH RÖDDA DE ANDRA VISE MÄNNEN..."
    ],
    "BIL-AM01": [
      "JAG BARA ÄLSKAR LERAN."
    ],
    "BIL-AM02": [
      "JÄKLAR TRÄSKRÅTTOR."
    ],
    "BIL-AM03": [
      "JAG SKULLE VERKLIGEN BEHÖVA EN DOS AV MAMMAS MEDICIN."
    ],
    "BIL-AM04": [
      "GLADIOLA."
    ],
    "BIL-AM05": [
      "JAG SKULLE BEHÖVA LITE BRUN MEDICIN."
    ],
    "BIL-AM06": [
      "JAG SKULLE BEHÖVA LITE SOMMARKYLA."
    ],
    "BIL-AM07": [
      "ATTANS, DEN HÄR HETTAN GER MIG FRÄKNAR."
    ],
    "BIL-AM08": [
      "TUSAN OCKSÅ... DEN HÄR HETTAN HÅLER PÅ ATT GÖRA MIG GALEN."
    ],
    "BIL-AM1A": [
      "UH-HM! JAG BARA ÄLSKAR LERAN!"
    ],
    "BIL-AM2A": [
      "JÄKLAR TRÄSKRÅTTOR!"
    ],
    "BIL-AM2B": [
      "JÄKLA TRÄSKRÅTTOR!"
    ],
    "BIL-LO01": [
      "FARTHY!"
    ],
    "BIL-LO02": [
      "HIHA-HIHA-HIHA-JIHA-JIHA!"
    ],
    "BIL-LO03": [
      "JIHA-JIHA-JIHA!"
    ],
    "BIL-LO1A": [
      "FARTHY!"
    ],
    "BIL-LO2A": [
      "JIHA-JIHA-JIHA!"
    ],
    "BIL-LO2B": [
      "JIHA! JIHA!"
    ],
    "BIL-TA01": [
      "TA DEM!"
    ],
    "BIL-TA02": [
      "SNYGGT SKOTT!"
    ],
    "BIL-TA03": [
      "DÄR BORTA!"
    ],
    "BIL-TA04": [
      "ÅH, ATTANS OCKSÅ."
    ],
    "BIL-TA05": [
      "EN RÅTTA FICK TAG PÅ ETT SNACKS."
    ],
    "BIL-TA06": [
      "OCH YTTERLIGARE EN..."
    ],
    "BIL-TA07": [
      "DET FINNS BARA EN KVAR..."
    ],
    "BIL-TA08": [
      "FICK DEM."
    ],
    "BIL-TA09": [
      "JIHA!"
    ],
    "BIL-TA1A": [
      "PÅ DE BARA!"
    ],
    "BIL-TA2A": [
      "SNYGGT SKOTT!"
    ],
    "BIL-TA3A": [
      "DÄR BORTA."
    ],
    "BIL-TA4A": [
      "ATTANS OCKSÅ!"
    ],
    "BIL-TA4B": [
      "ATTANS OCKSÅ!"
    ],
    "BIL-TA5A": [
      "EN RÅTTA TOG ETT SNACKS!"
    ],
    "BIR-AM01": [
      "HAR NI KOMMIT NÄRA ÄGGET ÄN?"
    ],
    "BIR-AM02": [
      "PRECIS SÅ, BARA EN LITEN BIT LÄNGRE!"
    ],
    "BIR-AM03": [
      "OK, BRA, KNUFFA DEN NU. ÅH, OCH TA DET FÖRSIKTIGT NU!"
    ],
    "BIR-AM04": [
      "NÄMEN, KÄRA NÅN, DET DÄR VAR INTE SÄRSKILT FÖRSIKTIGT!"
    ],
    "BIR-AM05": [
      "KOM IGEN NU, OCH PUTTA NER ÄGGET FRÅN KLIPPAN!"
    ],
    "BIR-AM06": [
      "ÅH!"
    ],
    "BIR-AM07": [
      "ÅH, KOM HIT NU, LILLA FÅGEL.  KOM HIT, LILLA FÅGEL."
    ],
    "BIR-AM08": [
      "KOM HIT, LILLA FÅGEL."
    ],
    "BIR-AM09": [
      "VAR FÖRSIKTIG, FÖR DET SER INTE SÅ SÄKERT UT DÄR UPPE!"
    ],
    "BIR-AM10": [
      "VAR FÖRSIKTIG, SAKTA MEN SÄKERT!"
    ],
    "BIR-AM11": [
      "BRA JOBBAT! KOM NU OCH MÖT MIG HÄR NERE VID ÄGGET."
    ],
    "BIR-AM12": [
      "NI MÅSTE VARA EN SANN DJURÄLSKARE!"
    ],
    "BIR-AM13": [
      "SER DU NÅGRA ANDRA FÅGLAR DÄR UPPE?"
    ],
    "BIR-LO01": [
      "(GER EN KYSS) (VISSLAR LITE)"
    ],
    "BIR-LO02": [
      "MÄMEN KÄRA NÅN, DET DÄR ÄR EN SÖT EN."
    ],
    "BIR-LO03": [
      "NÄMEN TITTA HÄR, EN SVARTMYLLA."
    ],
    "BIR-am08": [
      "KOM HIT, LILLA FÅGEL..."
    ],
    "BLU-AM01": [
      "LITE HJÄLP SKULLE VARA BRA!"
    ],
    "BLU-AM02": [
      "ÅH, DET HÄR ÄR EN RIKTIG RÖRA."
    ],
    "BLU-AM03": [
      "HMM, EN GANSKA STORT MYSTERIUM VI STÅR INFÖR."
    ],
    "CHI-AM01": [
      "DET HÄR RÄ EN KATASTROF. DET HÄR ÄR EN KATASTROF SÄGER JAG!"
    ],
    "CHI-AM02": [
      "DE VILL ATT JAG SKA GÅ IN I JUNGELN-JAG! HO HO ÅH...",
      "JAG SKULLE MYCKET HELLRE VILJA BROTTAS MED EN FÖRARGAD FLUT FLUT."
    ],
    "CHI-AM03": [
      "SÅ F-FÖRST ÄR FISKARENS BÅT...",
      "N DEN BLIR ATTACKERAD AV ETT MONSTER...",
      "OCH NU, SÅ SKER NU DETTA...",
      "VAD SKULLE ANNARS GÅ FEL NU?"
    ],
    "CHI-AM04": [
      "JAG KAN INTE... JAG SKULLE KUNNA, JAG SKULLE KUNNA... ÅH, KANSKE SKA JAG TA OCH HÖJA SKATTEN...",
      "FÖR ATT KUNNA BETALA FÖRR ALL DEN HÄR RÖRAN."
    ],
    "CHI-AM05": [
      "BARA PROBLEM... BARA PROBLEM... BARA PROBLEM!"
    ],
    "CHI-AM06": [
      "(SNYFTAR) JAG KOMMER ALDRIG ATT BLI OMVALD NU..."
    ],
    "CHI-AM07": [
      "(STÖNAR) VAD ÄR DET SOM HAR HÄNT MED BYNS ENERGISTRÅLE?"
    ],
    "CHI-AM08": [
      "JAG... DE, JAG VET INTE... (MUTTRAR)"
    ],
    "CHI-LO01": [
      "...VÄDERKVARNAR, MONSTER, ENERGI, OMVAL..."
    ],
    "CHI-LO02": [
      "...OMRÖSTNINGEN, JAG... MONSTER, HM... OMVAL, ÅH..."
    ],
    "EXP-AM01": [
      "'S FARBROR JAG MÅSTE GE MIG AV PÅ MIN RESA SNART.",
      "'S FARBROR JAG BEHÖVER PREKURSOR KULOR!"
    ],
    "EXP-AM02": [
      "'S FARBROR FÅ SE NU, VART SKA JAG BEGE MIG FÖRST? EH..."
    ],
    "EXP-AM03": [
      "'S FARBROR JAG SAKNAR FAKTISKT DEN ÖPPNA LANDSVÄGEN."
    ],
    "EXP-AM04": [
      "'S FARBROR SÅ MÅNGA PLATSER ATT SE, MEN INTE SÅ MYCKET TID."
    ],
    "EXP-AM05": [
      "'S FARBROR NÅ UNDER MIN TID, SÅ VAR DET MÖJLIGT ATT GÅ TILL FOTS ÖVER LANDET.",
      "'S FARBROR UTAN ATT BLI ÖVERFALLEN AV MONSTER!"
    ],
    "EXP-LO02": [
      "'S FARBROR JAG BEHÖVER FLER PREKURSOR KULOR."
    ],
    "EXP-LO1A": [
      "'S FARBROR (MUMLAR)"
    ],
    "FAR-AM01": [
      "(SNARKAR) KOM HIT, BESSIE... KOM HIT, BESSIE BESSIE...",
      "DET ÄR EN BRA FLICKA..."
    ],
    "FAR-AM02": [
      "JAG MÅSTE TA IN GRÖDORNA TILL OLLONBORRARNA..."
    ],
    "FAR-AM2A": [
      "JAG MÅSTE TA IN GRÖDORNA TILL OLLONBORRARNA SÅ ATT..."
    ],
    "FAR-LO01": [
      "(SNARKAR)"
    ],
    "FAR-LO1A": [
      "(SNARKAR)"
    ],
    "FIS-AM01": [
      "GRR, DE HÄR JÄKLA FISKARNA...",
      "JAG LYCKAS ALDRIG FÅNGA EN ENDA."
    ],
    "FIS-AM02": [
      "DE HÄR MONSTREN SOM SLET SÖNDER MITT SKEPP",
      "KOMER ATT RUINERA MIG."
    ],
    "FIS-AM03": [
      "ATTANS, DE HÄR PLÅGOANDARNA!",
      "IN I MIN KORG NU MED ER, STÖRIGA FISKAR, KOM IGEN NU...",
      "AH HA HA HA HA..."
    ],
    "FIS-AM04": [
      "ÅH JAG BARA ÄLSKAR LUKTEN AV FISK PÅ MORGONEN."
    ],
    "FIS-AM05": [
      "ÅH JAG SKULLE VERKLIGEN KUNNA BEHÖVA EN SALTAD FISK LÄPPAR PÅ RÅG."
    ],
    "FIS-AM06": [
      "JAG KOMMER IHÅG DEN DÄR BJÄSSEN SOM SMET IVÄG..."
    ],
    "FIS-LO01": [
      "GRR!"
    ],
    "FIS-LO03": [
      "HA HA HA HA HA HA!"
    ],
    "FIS-LO04": [
      "JÄKLA FISK... DE KOMMER ALDRIG IN I MITT NÄT!"
    ],
    "FIS-LO05": [
      "HA HA HA HA AHA HA HA!"
    ],
    "FIS-TA01": [
      "MER ÅT VÄNSTER!"
    ],
    "FIS-TA02": [
      "TILL HÖGER MED ER!"
    ],
    "FIS-TA03": [
      "HÄR KOMMER EN BJÄSSE!"
    ],
    "FIS-TA04": [
      "NI MISSADE EN RIKTIGT STOR EN, KILLAR!"
    ],
    "FIS-TA05": [
      "MISSA INTE EN LIKADAN IGEN!"
    ],
    "FIS-TA06": [
      "HÅLL STADIGT NU PJK."
    ],
    "FIS-TA07": [
      "DINA SEGEL SLAKAR I VINDEN, POJK."
    ],
    "FIS-TA08": [
      "NI MISSADE EN."
    ],
    "FIS-TA09": [
      "DET SER UT SOM ATT NI SKULLE BEHÖVA ETT STÖRRE NÄT..."
    ],
    "FIS-TA10": [
      "NI MISSADE IGEN!"
    ],
    "FIS-TA11": [
      "HÅLL DET STADIGT NU! DU ÄR NÄSTAN DÄR..."
    ],
    "FIS-TA1A": [
      "VÄNSTER!"
    ],
    "FIS-TA2A": [
      "HÖGER!"
    ],
    "GAM-AM01": [
      "HÖRRU, TJUGO-MOT-TT ODDS ÄR INTE SÅ PASS DÅLIGT!"
    ],
    "GAM-AM02": [
      "NEJ, DET VAR EN SÄKER SAK!"
    ],
    "GAM-AM03": [
      "HI HI HI... JAG KOMER ATT FÅ JACKPOT NÄSTA GÅNG!"
    ],
    "GAM-AM04": [
      "HÖRRU! OM JAG HADE EN KULA FÖR VARJE MISSAT TILLFÄLLE...!"
    ],
    "GAM-AM05": [
      "HÖRU! TUNNOR SKULLE KUNNA TRENDA IGEN!"
    ],
    "GAM-AM06": [
      "ÅH... JAG SKULLE BEHÖVA EN CHANS."
    ],
    "GAM-AM07": [
      "ÅH, VAD ÄR ODDSEN FÖR ATT FLYTTA TILL EN STAD SOM ÄR UNDER ATTACK?"
    ],
    "GAM-AM08": [
      "JAG TRODDE ATT JAG HADE ETT BRA TIPS!"
    ],
    "GAM-AM09": [
      "YTTERLIGARE EN DAG, OCH YTTERLIGARE EN SATSNING."
    ],
    "GAM-AM10": [
      "JAG SLÅR VAD OM ATT INGEN KAN UTMANA DET DÄR MONSTRET."
    ],
    "GAM-AM11": [
      "UH-HUH... JAG BORDE TA UT STÅLARNA OCH GÅ VIDARE."
    ],
    "GAM-AM12": [
      "ÄSCH, IBLAND KAN MAN INTE VINNA ALLT."
    ],
    "GAM-AM13": [
      "HALLÅ DÄR, VAD GLOR NI PÅ? ROAR JAG ER?"
    ],
    "GEO-AM01": [
      "HMM, INTRESSANT STRATA..."
    ],
    "GEO-AM02": [
      "STACKARS SMÅ MULLVADAR..."
    ],
    "GEO-AM03": [
      "INTRESSANT..."
    ],
    "GEO-AM04": [
      "LYCKA TILL, POJKAR!"
    ],
    "GEO-AM05": [
      "ELAKA LURKERS..."
    ],
    "GEO-AM06": [
      "STENAR HAR OCKSÅ KÄNSLOR, FAKTISKT..."
    ],
    "GEO-AM07": [
      "HÅLL UT BARA, SMÅTTINGAR..."
    ],
    "GEO-AM08": [
      "JAG KAN ÅTERVÄNDA TILL MIN FORSKNING NU!"
    ],
    "GEO-LO01": [
      "JAG MÅSTE ÅTERGÅ TILL MIN FORSKNING."
    ],
    "GEO-LO02": [
      "HMM, DEN HÄR STENEN VERKAR VARA GANSKA GAMMAL..."
    ],
    "GOL-AM01": [
      "NI TÄNKER VISST INTE GE UPP, ELLER HUR?"
    ],
    "GOL-AM02": [
      "SNART, SÅ KOMMER DEN MÖRKA ECON ATT VARA VÅR!"
    ],
    "GOL-AM03": [
      "GÖR SLUT PÅ DEM!"
    ],
    "GOL-AM04": [
      "SKJUT!"
    ],
    "GOL-AM05": [
      "SPRÄNG DE I SMÅBITAR!"
    ],
    "GOL-AM06": [
      "VAD NU? INTE DEM NU IGEN!"
    ],
    "GOL-AM07": [
      "DET ÄR FÖR SENT!"
    ],
    "GOL-AM08": [
      "NU ÄR NI FAST!"
    ],
    "GOL-AM09": [
      "NU HAR JAG ER!"
    ],
    "GOL-AM10": [
      "AH HA HA HA HA!"
    ],
    "GOL-AM11": [
      "INGEN HÄNSYN!"
    ],
    "GOL-AM12": [
      "HÄR FÅR NI!"
    ],
    "GOL-AM13": [
      "BRA FÖRSÖK!"
    ],
    "GOL-AM14": [
      "STÅ STILLA!"
    ],
    "GOL-AM15": [
      "PATETISKT!"
    ],
    "GOL-AM16": [
      "NEJ!"
    ],
    "GOL-AM17": [
      "ÅHHH!"
    ],
    "GOL-AM18": [
      "VI KOMMER ATT ÖPPNA SILON HELA VÄGEN OCH KROSSA ER OCKSÅ!"
    ],
    "GOL-AM19": [
      "LJUS ECO! DEN EXISTERAR FAKTISKT!"
    ],
    "GOL-AM20": [
      "VI KOMMER INTE ATT ACCEPTERA DET!"
    ],
    "MAI-AM01": [
      "GÖR SLUT PÅ DE BÅDA TVÅ EN GÅNG FÖR ALLA!"
    ],
    "MAI-AM02": [
      "TA KÅL PÅ DE!"
    ],
    "MAI-AM03": [
      "HA HA HA!"
    ],
    "MAI-AM04": [
      "ECO KOMMER INTE ATT SKYDDA ER NU!"
    ],
    "MAI-AM05": [
      "GÖR NÅGOT DÅ!"
    ],
    "MAI-AM06": [
      "ÄH!"
    ],
    "MAI-AM07": [
      "NEJ!"
    ],
    "MAI-AM08": [
      "VI KOMMER ATT ÖPPNA SILON HELA VÄGEN OCH KROSSA ER OCKSÅ!"
    ],
    "MAI-AM09": [
      "DE FÅR INTE TILLÅTAS ATT FÅ TAG I DET!"
    ],
    "MIN-LO01": [
      "EN AV DE HÄR DAGARNA KOMMER JAG ATT VARA RIK...",
      "DU MENAR ATT VI KOMMER ATT BLI RIKA!",
      "SÄKERT. SKIT SAMMA."
    ],
    "MIN-LO03": [
      "GRÄV, WILLARD! GRÄV!",
      "VISST, MEN DU GRÄVER INTE!",
      "DET ÄR FÖR ATT DET ÄR JAG SOM SKÖTER ALLT TÄNKANDE!"
    ],
    "MIN-LO04": [
      "EH, GORDY? KAN JAG TA EN PAUS?",
      "ÅH, JAG KOMMER ATT BRYTA NÅGOT SÄKERT. GRÄV NU!"
    ],
    "MIN-LO05": [
      "JAG ÄR HUNGRIG, GORDY!",
      "ÄT DIN PIPPI!"
    ],
    "MIN-LO06": [
      "EH, GORDY? JAG SKULLE BEHÖAVA EN VASSARE YXSKAFT.",
      "VAD DU SKULLE BEHÖVA ÄR EN SKARPARE HJÄLRNA!"
    ],
    "MSH-AM01": [
      "OH-HA-HA-HA! JAG KOMMER ATT BLI RIK!"
    ],
    "MSH-AM02": [
      "GRÄV, GRÄV, GRÄV!"
    ],
    "MSH-AM03": [
      "WILLARD! ARBETA HÅRDARE, INTE SMARTARE!"
    ],
    "MSH-AM04": [
      "A-HA, JAG KOMMER ATT BLI VÄRLDENS RIKASTE MAN! A HA HA..."
    ],
    "MSH-AM05": [
      "ÅH HO HO! INGEN HAR NÅGONSIN SETT EN SÅ HÄR STOR ÄDELSTEN! AH HA HA!"
    ],
    "MSH-AM06": [
      "LUGNA GATAN, HÄR KOMMER JAG!"
    ],
    "MSH-AM07": [
      "MINA ÄDELSTENAR! ALLA MINA ÄDELSTENAR!"
    ],
    "MSH-AM08": [],
    "MSH-AM09": [
      "(SKRATAR) JAG KAN INTE VÄNTA FÖR ATT CASHA IN DENHÄR LILLA SÖTNOSEN!"
    ],
    "MSH-AM10": [
      "DET HÄR SER UT SOM EN SÄLLSYNT CRYSTITE ZLARCONIA! ÅH-HO-HO!"
    ],
    "MSH-AM11": [
      "VÄNTANU LITE! DE ÄR ALLA MINA! DE ÄR ALLA MINA, SÄGER JAG JU!"
    ],
    "MSH-AM12": [
      "SÅ, WILLARD. VAD SKA DU GÖRA MED",
      "DIN KVARTS HÄLFT?"
    ],
    "MSH-AM1A": [
      "JAG KOMMER ATT BLI RIK!"
    ],
    "MSH-AM2A": [
      "GRÄV, GRÄV, GRÄV!"
    ],
    "MSH-AM3A": [
      "DU MÅSTE ARBETA HÅRDARE, INTE TÄNKA SMARTARE!"
    ],
    "MTA-AM01": [
      "EH, ÄR VI NÄSTAN FÄRDIGA?"
    ],
    "MTA-AM02": [
      "SNÄLLA, KAN VI INTE TA EN PAUS?"
    ],
    "MTA-AM03": [
      "ÅH, JAG ÄR HUNGRIG..."
    ],
    "MTA-AM04": [
      "EH... JAG TROR ATT PIPPINS BUR BEHÖVER RENGÖRAS..."
    ],
    "MTA-AM05": [
      "JÖSSES, DET DÄR ÄR EN RIKTIGT STOR ÄDELSTEN!"
    ],
    "MTA-AM06": [
      "EH... JAG VILLE ALLTID BLI EN SKOGSHUGGARE..."
    ],
    "MTA-AM07": [
      "EH, GORDY LOVADE MIG HÄLFTEN AV VAD SOM HELST JAG KUNDE BÄRA!"
    ],
    "MTA-AM08": [
      "A-HA... PIPPIN ÄR MIN BÄSTA VÄN..."
    ],
    "MTA-AM09": [
      "JAG ÄLSKAR MIN LILLA PIPPI..."
    ],
    "RED-AM01": [
      "ÄR DET NÅGON DÄR?"
    ],
    "RED-AM02": [
      "NÅ..."
    ],
    "RED-AM03": [
      "VAD HÖLL ER TILLBAKA?"
    ],
    "SAGELP03": [
      "DE HÄR TVÅ SKULLE INTE ENS KUNNA DRA UR VAXET UR SINA ÖRON..."
    ],
    "SAGELP04": [
      "HAN KOMMER ALDRIG BLI PRECIS SOM SIN FARBROR...",
      "JAG BRYR MIG INTE OM VAD DE ANDRA SÄGER."
    ],
    "SAGELP05": [
      "HALLÅ DÄR, BLÅ VISE MANNEN? HALLÅ DÄR?",
      "VAR I HELA FRIDEN KAN HAN HA TAGIT VÄGEN..."
    ],
    "SAGELP06": [
      "OJ, OJ, OJ..."
    ],
    "SAGELP11": [
      "NÅGON? VEM SOM HELST? SOM KAN KOMMA?"
    ],
    "SAGELP20": [
      "HMM..."
    ],
    "SAGELP21": [
      "LURKERS MÅSTE STOPPAS."
    ],
    "SAGELP22": [
      "JAG FÖRSTÅR..."
    ],
    "SAGELP23": [
      "NEJ..."
    ],
    "SAGELP24": [
      "VAD SKULLE KUNNA HA HÄNT MED DEM?"
    ],
    "SAGELP31": [
      "DET HÄR ÄR INTE BRA."
    ],
    "SAGELP32": [
      "MÖRK ECO KRISTALLER?"
    ],
    "SAGELP33": [
      "MAIA OCH GOL HAR TAGIT SIG VATTEN ÖVER HUVUDET!"
    ],
    "SAGELP34": [
      "HMPH, DEN MÖRKA ECONS ENERGI GÅR INTE ATT KONTROLLERA!"
    ],
    "SAGELP35": [
      "MÖRK ECO I GLACIÄRERNA?"
    ],
    "SAGELP36": [
      "ÅH! DET FINNS LURKER TRUPPER UPPE I BERGEN!"
    ],
    "SAGELP37": [
      "VAD HÅLLER GOL PÅ MED ATT PLANERA..."
    ],
    "SAGELP38": [
      "SKULLE HAN FAKTISKT KUNNA HA...?"
    ],
    "SCU-AM01": [
      "ÅH... JAG KAN INTE BARA GÖRA DET LÄNGRE."
    ],
    "SCU-AM02": [
      "ÅH, JAG BARA ÖNSKADE ATT JAG HADE LITE INSPIRATION."
    ],
    "SCU-AM03": [
      "JAG ÄR PRECIS LIKA INSPIRERAD... SOM DEN HÄR STENEN."
    ],
    "SCU-AM04": [
      "ÅH... VAR ÄR MIN MUSA?"
    ],
    "SCU-AM05": [
      "JAG KAN INTE ARBETA SÅ HÄR!"
    ],
    "SCU-AM06": [
      "ÅH SNÄLLA... KOMMER HON NÅGONSIN ATT VILJA KOMMA TILLBAKA TILL MIG?"
    ],
    "SCU-LO01": [
      "ÅH SNÄLLA NÅN..."
    ],
    "SKSP009F": [
      "HÄR FÅR NI! HÄR FÅR NI! HA HA HA!"
    ],
    "WAR-LO1A": [
      "(SNYFTAR)"
    ],
    "WAR-LO1B": [
      "(SNYFTAR)"
    ],
    "WAR-LO1C": [
      "(SNYTER SIG OCH SPTTAR)",
      "(FORTSÄTTER ATT GRÅTA)"
    ],
    "YEL-AM01": [
      "TIDEN HÅLLER PÅ ATT RUNNA UT!"
    ],
    "YEL-AM02": [
      "HÖRRU! SE TILL ATT FÅ UT MIG HÄRIFRÅN!"
    ],
    "YEL-AM03": [
      "NÄR JAG VÄL KOMMER UT HÄRIFRÅN, SÅ KOMMER DET ATT BÖRJA SKJUTAS!"
    ],
    "asstv100": [
      "OK, NI HAR TILLRÄCKLIGT MED CELLER FÖR ATT ÖKA STYRKAN PÅ VÄRMESKÖLDEN.",
      "ÅK MED TRÄJÄRNVÄGEN NER FÖR GRUVSCHAKTET VID LAVA GEJSERN.",
      "JAG KOMMER ATT MÖTA ER VID INGÅNGEN TILL LAVA TUNNELN,",
      "SÅ ATT JAG KAN MODIFIERA ZOOMERN. SKYNDA!"
    ],
    "asstv101": [
      "HA HA, OK! NI HAR TILLRÄCKLIGT MED CELLER FÖR ATT KUNNA ÖKA",
      "ENERGIN PÅ VÄRMESKÖLDEN.",
      "MÖT MIG TILLBAKA VID DEN VULKANISKA KRATERN.",
      "JAG KOMMER ATT VÄNTA VID LAVA TUNNELN VID GRUVSCHAKTET VID LAVA GEJSERN.",
      "TA MED ER ENERGI CELLERNA!"
    ],
    "asstv102": [
      "SKYNDA PÅ MED DE DÄR ENERGI CELLERNA!",
      "JAG VÄNTAR VID TRÄJÄRNVÄGSSCHAFTET NÄRA LAVA GEJSERN."
    ],
    "asstv103": [
      "GLÖM INTE BORT ATT AKTIVERA TELEPORTER PORTEN FÖR ATT LÅTA OSS KOMMA IGENOM.",
      "NI MÅSTE GÅ IN I DEN RÖDE VISE MANNENS LABB",
      "SOM FINNS I MITTEN AV DEN VULKANISKA KRATERN FÖR ATT KUNNA AKTIVERA DEN.",
      "VI KAN INTE TA OSS IGENOM FÖRRÄN DEN ÄR UPPE IGEN."
    ],
    "asstv104": [
      "HALLÅ DÄR, VI ÄR FORTFARANDE KVAR I STENBYN!",
      "AKTIVERA TELEPORTER PORTEN!"
    ],
    "asstv105": [
      "VI SKULLE GÄRNA VILJA MÖTA UPP ER I DEN VULKANISKA KRATERN!",
      "GÅ IN I DEN RÖDE VISE MANNENS LABB OCH AKTIVERA PORTEN."
    ],
    "asstva73": [
      "HALLÅ DÄR KILLAR! ENLIGT MINA UTRÄKNINGAR, SÅ KOMMER DET ATT KRÄVA",
      "72 ENERGI CELLER FÖR ATT GE TILRÄCKLIGT MED ENERGI ÅT VÄRMESKÖLDEN",
      "FÖR ATT KUNNA STÅ EMOT LAVAN PÅ VÄGEN MOT GOL OCH MAIAS CITADELL."
    ],
    "asstva74": [
      "NI HAR FORTFARANDE INTE TILLRÄCKLIGT MED ENRGI CELLER FÖR ATT TA ER IGENOM DEN HÄR LAVAN!",
      "NI KAN INTE TA ER IGENOM TILL GOL OCH MAIAS CITADELL",
      "FÖRRÄN NI HAR SAMLAT IHOP 72 ENERGI CELLER!"
    ],
    "asstvb02": [
      "WOW, SÅG NI DET DÄR?",
      "BLÅ ECO KÄLLOR HAR AKTIVERATS RUNT OM HELA VÄRLDEN!",
      "JAG VISSTE ATT DET FANNS ETT SÄTT ATT AKTIVERA DEM.",
      "DET MÅSTE FINNAS ANDRA PLATSER FÖR ATT AKTIVERA DE ANDRA ECO KÄLLORNA OCKSÅ."
    ],
    "asstvb03": [
      "SNYGGT! NI LYCKADES STOPPA ALLA LURKERS SOM SLPTE NER MINORNA!",
      "DE HAR HÅLLT PÅ ATT HOTA VATTNEN RUNT VÅR BY UNDER FLERA VECKOR.",
      "TA MED ER ZOOMER TILLBAKA TILL TRANSPORT PLATTAN OCH JAG KOMMER ATT TELEPORTERA DEN TILLBAKA!"
    ],
    "asstvb04": [
      "BRA, NI HAR LYCKATS SAMLA IHOP TILLRÄCKLIGT MÅNGA ENERGI CELLER FÖR ATT GE ENERGI ÅT MIN VÄRMESKÖLD!",
      "MÖT MIG VID INGÅNGEN TILL ELD FLODBÄDDEN",
      "GENOM ATT KLÄTTRA UPP FÖR KLIPPAN BAKOM BONDENS HUS.",
      "TA MED ER ENERGI CELLERNA, OCH SKYND HIT!",
      "MIN FAR SÄGER ATT HAN HAR SETT FLER LURKERS RUNOMKRING HÄR!"
    ],
    "asstvb08": [
      "SKYNDA PÅ MED DE DÄR ENERGI CELLERNA.",
      "JAG VÄNTAR PÅ ER VID MYNNIGEN TILL ELD FLODBÄDDEN",
      "VID TOPPEN AV KLIPPAN BAKOM BONDENS HUS!"
    ],
    "asstvb09": [
      "NI HAR INTE RIKTIGT TILLRÄCKLIGT MED ENERGI CELLER FÖR ATT GE ENERGI ÅTMIN VÄRMESKÖLD.",
      "NI KAN INTE PASSERA IGENOM ELD FLODBÄDDEN FÖRRÄN NI HAR SAMLAT IHOP TILLRÄCKLIGT MÅNGA ENERGI CELLER."
    ],
    "asstvb20": [
      "SNYGG FLYGNING! DE DÄR LURKERS VAR INGEN MATCH FÖR ER ZOOMER!",
      "DET ÄR EN TILL ENERGI CELL!"
    ],
    "asstvb21": [
      "BRA JOBBAT! ÄR NI INTE GLADA",
      "ATT NI RÄDDADE VÅR LILLA FLUT-FLUT VÄN?",
      "HON KOMMER KANSKE ATT KOMMA VÄL TILL PASS NÅGON ANNAN GÅNG.",
      "NU, TA MER DER HENNE TILLBAKA TILL TRANSPORT PLATTAN, SÅ KAN JAG TELEPORTERA HEM HENNE."
    ],
    "asstvb22": [
      "WOW! NI LYCKADES ATT LYFTA UPP EN BIT AV UNDERVATENSRUINEN TILL YTAN!",
      "DET VERKAR SOM ATT NI KAN ANVÄNDA ECO PÅ SÄTT SOM VI ALDRIG SETT FÖRRUT!",
      "EN ENERGI CELL KOM UPP TILL YTAN M ED RUMMET. KLÄTTRA UPP DÄR OCH TA DEN."
    ],
    "asstvb23": [
      "SNYGGT JOBBAT! STENBYNS BEFOLKNING KAN ANDAS",
      "UT MED LÄTTNAD!",
      "MEN DET FINNS INTE NÅGON TID FÖR ATT FIRA! TA MED DIG DIN ZOOMER",
      "FÖR ATT KUNNA NAVIGERA IGENOM BERGSPASSET SOM LIGGER FRAMFÖR ER.",
      "VAR FÖRSIKTIGA, FÖR DET VERKAR SOM LURKERS HAR RIGGAT",
      "HELA PASSET MED SPRÄNGMEDEL!",
      "SÅ FORT NI KOMMER TILL DEN VULKANISKA KRATERN,",
      "SÅ FÅR NI INTE GLÖMA BORT ATT BESÖKA DEN RÖDE VISE MANNENS LABB",
      "OCH AKTIVERA TELEPORTER PORTEN SÅ ATT FAR OCH JAG KAN KOMMA DIT OCH MÖTA UPP ER."
    ],
    "asstvb24": [
      "ÅH KÄRA NÅN! DE DÄR LURKSERS MÅSTE VARA PÅ VÄG",
      "TILL EN AVTRYCKARE VID SLUTET AV PASSET!",
      "IFALL DE LYCKAS KOMMA FRAM FÖRE ER,",
      "SÅ KOMMER DE ATT SPRÄNGA HELA PASSET!",
      "NI MÅSTE HINNA FRAM FÖRE DE OCH FÖRSTÖRA AVTRYCKAREN,",
      "FÖR ANNARS SÅ ÄR DET HELT KÖRT!"
    ],
    "asstvb25": [
      "SNYGGT JOBBAT! NI LYCKADES HINNA FÖRE DE TILL AVTRYCKAREN!",
      "DEN RÖDE VISE MANNENS LABB ÄR PRECIS RAKT FRAMFÖR ER.",
      "STICK DIT OCH AKTIVERA TELEPORTER PORTEN SÅ ATT VI KAN KOMMA DIT OCH MÖTA UPP ER."
    ],
    "asstvb28": [
      "HALLÅ DÄR! GLÖM INTE BORT DEN VISE MANNEN OCH MIG!",
      "NI MÅSTE AKTIVERA TELEPORT PORTEN FÖR ATT VI SKA KUNNA KOMMA IGENOM!",
      "DEN FINNS I DEN BLÅ VISE MANNENS LABB, VID SLUTET AV ELD FLODBÄDDEN.",
      "OM NI INTE LÅTER OSS KOMMA IGENOM, SÅ KAN VI INTE HJÄLPA ER!"
    ],
    "asstvb29": [
      "HALLÅ DÄR! VI VÄNTAR FORTFARANDE!",
      "AKTIVERA TELEPORT PORTEN!"
    ],
    "asstvb30": [
      "HALLÅ DÄR! VI KAN INTE KOMMA IGENOM FÖRÄN TELEPORT PORTEN ÄR AKTIVERAD!"
    ],
    "asstvb40": [
      "DEN HÄR APPARATEN ÄR EN KOMMUNIKATÖR. MED DEN HÄR, SÅ KAN MIN FAR OCH JAG",
      "GE ER RÅD NÄR SOM HELST UNDER ERT UPPDRAG."
    ],
    "asstvb41": [
      "DE HÄR SVÄVANDE EGG-FORMADE SAKERNA ÄR PREKURSOR KULOR.",
      "SAMLA IHOP TILLRÄCKLIGT MÅNGA AV DEM, OCH NÅGRA AV BYBORNA KOMMER ATT GE ER",
      "EN ENERGI CELL I UTBYTE."
    ],
    "asstvb42": [
      "DET HÄR ÄR EN ENERGI CELL, DEN MEST VIKTIGASTE PREKURSOR ARTIFAKTEN SOM NI KAN HITTA!",
      "NI MÅSTE SAMLA IHOP 20 STYCKEN AV DESSA SÅ ATT JAG KAN LADDA UPP VÄRME SKÖLDEN",
      "TILL ERAN A-GRAV ZOOMER."
    ],
    "asstvb44": [
      "HALLÅ DÄR! NI HITTADE EN AV MINA SKOUT FLUGOR!",
      "JAG SKICKADE UT 7 STYCKEN TILL VARJE OMRÅDE FÖR ATT LETA EFTER ENERGI CELLER",
      "MEN LURKERS MÅSTE HA FÅNGA IN DEM ALLA!"
    ],
    "asstvb45": [
      "WOW! DEN DÄR SISTA SKOUT FLUGAN HADE EN ENERGI CELL!",
      "JAG SLÅR VAD OM ATT OM NI SAMLAR IN ALLA 7 I VARJE OMRÅDE",
      "NI KAN HITTA ÄNNU FLER ENERGI CELLER."
    ],
    "asstvb46": [
      "VAR FÖRSIKTIGA I HAVEN, FÖR VATTNEN ÄR SMOCK-FULLA MED",
      "LURKER HAJAR OCH JAG HAR ALDRIG SET NÅGON BESEGRA NÅGON AV DESSA.",
      "HÅLL DIG BORTA FRÅN DEM OM DU VET VAD SOM ÄR BÄST FÖR DIG!"
    ],
    "asstvb47": [
      "KOM IHÅG, ATT DET DÄR ÄR EN ENERGI CELL.",
      "DU MÅSTE SAMLA IHOP SÅ MÅNGA AV DEM SOM DU BARA KAN."
    ],
    "asstvb48": [
      "DET DÄR ÄR EN BLÅ ECO KÄLLA! DEN ÄR MER KONCENTRERAD ÄN DE SVÄVANDE KLUMPARNA,",
      "DEN HÄR KÄLLAN KOMMER ATT GE DIG EN FULL LADDNING AV ECO,",
      "VILKET TILLÅTER DIG ATT ANVÄNDA DET TILL DEN MAXIMALA TIDEN."
    ],
    "asstvb71": [
      "NI HAR FORTFARANDE INTE TILLRÄCKLIGT MED ENERGI CELLER FÖR ATT GE ENERGI ÅT DEN BLÅ VISE MANNENS MASKIN.",
      "VI KAN INTE LYFTA UPP DEN DÄR STENEN TILS NI HAR SAMLAT IN 45 ENERGI CELLER."
    ],
    "asstvb72": [
      "TILLS ATT VI KOMMER PÅ VARFÖR DEN BLÅ VISE MANNEN FÖRSVANN,",
      "SÅ MÅSTE NI TA OCH SAMLA IN 45 ENERGI CELLER FÖR ATT KUNNA GE ENERGI ÅT HANS MASKIN.",
      "PÅ DE BARA!"
    ],
    "asstvb75": [
      "DEN HÄR GONDOLAN VERKAR INTE FUNGERA RÄTT.",
      "JAG SKA TA OCH FÖRSÖKA ATT ARBETA PÅ DEN OCH FÅ DEN ATT FUNGERA IGEN."
    ],
    "asstvb76": [
      "JAG HAR AKTIVERAT GONDOLAN IGEN. DEN KAN TA ER UPP TILL SNÖIGA BERGET!",
      "ANVÄND DEN NÄR SOM HELST."
    ],
    "sagevb01": [
      "NÅ, DET VERKAR SOM NI ÄNTLIGEN",
      "BESTÄMDE ER FÖR ATT ÖPPNA MINA SAMLARE.",
      "JAG SKULLE GÄRNA VILJA ERBJUDA ER MINA GRATULATIONER",
      "MEN NI HAR SÅ MYCKET ATT GÖRA SÅ JAG SKA INTE SLÖSA BORT ER TID.",
      "FÖRRESTEN, IFALL INTE SAKER SKULLE GÅ RIKTIGT SOM PLANERAT,",
      "DAXTER SKULLE KUNNA BLI ERBJUDEN JOBBET ATT KONTROLLERA BYNS RÅTTPROBLEM.",
      "AH HA HA HA HA HA."
    ],
    "sagevb02": [
      "JAG MÅSTE MEDGE, ATT JAG ÄR IMPNERAD. NI LYCKADES ATT INTE KLANTA TILL DET!",
      "NU NÄR LURKERS INTE LÄÅNGRE KAN ÖPPNA UPP DEN DÄR SILON",
      "SÅ KAN DE INTE ÖVERSVÄMMA VÄRLDEN MED MÖRK ECO",
      "OCH ORSAKA OTALIG FÖRSTORELSE.",
      "TA BORT DET DÄR LÖJLIGA LEENDET, DAXTER!",
      "NI TVÅ HAR FORTFARANDE MYCKET KVAR ATT GÖRA.",
      "SKYNDA PÅ MED DET!"
    ],
    "sagevb03": [
      "NI FORTSÄTTER ATT IMPONERA PÅ MIG. MEN DET KANSKE JUST BEROR PÅ ATT",
      "JAG HAR LÅGA FÖRVÄNTNINGAR.",
      "OK, ERT TILLFÄLLE ATT SKRYTA ÄR SLUT.",
      "FORSÄTT MED DET!"
    ],
    "sagevb04": [
      "BRA JOBBAT, JAK! DIN FARBROR SKULLE HA VARIT STOLT.",
      "DET DÄR VAR EN JÄTTESTOR ARM FRÅN EN PREKURSOR ROBOT.",
      "JAG HAR ALDRIG SETT NÅGOT SÅDANT I SÅ PASS BRA SKICK!",
      "JAG KAN INTE FÖRESTÄLLA MIG VAD LURKERS VILLE GÖRA MED DET,",
      "MEN VI VILLE DEFINITIVT INTE ATT DE SKULLE FÅ TAG PÅ DET.",
      "OM NI FORTSÄTTER LYCKAS SÅ VÄL...",
      "NEJ, NI KOMMER INTE ATT VARA I NÄRHETEN AV ATT VARA HJÄLTE.",
      "MEN FORSÄTT ATT FÖRSÖKA. DET ÄR UPPFRISKANDE."
    ],
    "sagevb21": [
      "DE DÄR SMÅ GRÖNA BOLLARNA MED ENERGI PÅ MARKEN ÄR EN SORTS ECO.",
      "PLOCKA UPP 50 SMÅ GRÖNA ECOS, ELLER EN STOR GRÖN FÖR ATT ÖKA DIN HÄLSA."
    ],
    "sagevb22": [
      "DET DÄR ÄR BLÅ ECO, VILKET INNEHÅLLER RÖRELSEENERGI.",
      "BLÅ ECO TILLÅTER DIG ATT SPRINGA SNABBT, SLÅ SÖNDER LÅDOR, OCH ÄVEN AKTIVERA NÅGRA PREKURSOR",
      "ARTIFAKTER NÄR DU KOMMER TILLRÄCKLIGT NÄRA DEM."
    ],
    "sagevb23": [
      "MÄRKER DU HUR VARJE KLUMP AV BLÅ ECO DU PLOCKAR UPP",
      "ÖKAR TIDEN DU KAN ANVÄNDA DESS ENERGI."
    ],
    "sagevb24": [
      "DET HÄR ÄR EN PREKURSOR DÖRR.",
      "DEN KAN BARA ÖPPNAS GENOM ATT NÄRMA SIG DÖRREN",
      "MEDAN DU KANALISERAR BLÅ ECO GENOM DIN KROPP."
    ],
    "sagevb25": [
      "BRA JOBBAT, BLÅ ECO FICK DÖRREN ATT ÖPPNAS.",
      "MED HJÄLP AV BLÅ ECO, KAN DU FÖRA IN ENERGI I ALLA MÖJLIGA SORTERS",
      "PREKURSOR ARTIFAKTER SOM HAR LEGAT I DVALA UNDER MÅNGA ÅR."
    ],
    "sagevb26": [
      "USE YOUR GOGGLES TO VIEW YOUR PROGRESS DURING THE ADVENTURE."
    ],
    "sagevb27": [
      "DU KAN HOPPA EN GÅNG, SEN HOPPA EN GÅNG TILL MEDAN DU ÄR UPP I LUFTEN FÖR ATT NÅ ÄNNU HÖGRE KANTER."
    ],
    "sagevb28": [
      "NÄR DU ÄR OMRINGAD AV FIENDER, ANVÄND DIN SNURR SPARK."
    ],
    "sagevb29": [
      "DET DÄR ÄR INTE EN SNURR SPARK! FÖRSÖK IGEN."
    ],
    "sagevb30": [
      "KOM IGEN, JAK! GÖR EN SNURR SPARK."
    ],
    "sagevb31": [
      "BRA JOBBAT. ANVÄND SNURR SPARKEN OM DU BEHÖVER ANVÄNDA EN BRA ALLSIDIG ATTACK."
    ],
    "sagevb32": [
      "FÖR ATT RÖRA SIG I EN RAK LINJE, OCH ANVÄNDA EN RÖRELSEATTACK, SÅ KAN DU ANVÄNDA DIN NÄVE FÖR ATT SLÅ."
    ],
    "sagevb33": [
      "DET DÄR SER INTE UT SOM EN SLAGATTACK! KOM IGEN OCH UTFÖR ETT SLAG NU SNART."
    ],
    "sagevb34": [
      "JAK! ANVÄND EN SLAGATTACK."
    ],
    "sagevb35": [
      "BRA JOBBAT. ANVÄND EN SLAGATTACK FÖR ATT TÄCKA YTOR SNABBT I TIGHTA SITUATIONER."
    ],
    "sagevb36": [
      "IBLAND KOMMER DU BEHÖVA SLÅ TILL SAKER MED STÖRRE KRAFT.",
      "FÖR ATT KUNNA SLÅ SÖNDER DE HÄR LÅDORNA, SÅ MÅSTE DU HOPPA UPP I LUFTEN",
      "OCH SEDAN DYKA NER PÅ DE, MED HÄNDERNA FÖRST."
    ],
    "sagevb37": [
      "WHEN YOU GET SOME CONFIDENCE, TRY USING SOME OF YOUR MOVES IN COMBINATIONS."
    ],
    "sagevb38": [
      "DU KAN INTE KOMMA TILLBAKA GENOM PORTALEN",
      "INNAN DU HITTAR ALLA 4 ENERGI CELLERNA PÅ DEN HÄR ÖN."
    ],
    "sagevb39": [
      "PERFEKT! DU HITTADE ALLA ENERGI CELLERNA PÅ ÖN.",
      "KOM TILLBAKA TILL PORTALEN SÅ ATT JAG KAN FÖRA ER TILLBAKA TILL LABBET. SKYNDA PÅ!"
    ],
    "sksp0001": [
      "HALLÅ! DEN DÄR SÖTA ÄLSKLIGEN KEIRA HADE RÄTT! DET FINNS VISST TRANSPORT PLATOR HÄR UTE."
    ],
    "sksp0002": [
      "LITA PÅ MIG, DE DÄR MÖRKA ECO LÅDORNAÄR RIKTIGT DÅLIGA NYHETER!"
    ],
    "sksp0003": [
      "JAG SLÅR VAD OM ATT VI HITTAR ALA DESSA RIKTIGT SÖTA SKOUT FLUGORNA PÅ VARJE BANA",
      "SÅ KOMMER ÅTMINSTONE EN AV DE HA EN ENERGI CELL!"
    ],
    "sksp0004": [
      "SNYGGT, SKATTER!"
    ],
    "sksp0005": [
      "DE HÄR TRÄ OCH METALL LÅDORNA SER INTE SÅ TUFFA UT!",
      "JAG SKULLE SLÅ VAD OM ATT DE SKULLE GÅ SÖNDER OM DU DYKBOMBAR DEM."
    ],
    "sksp0006": [
      "DE HÄR ALLT I METALL LÅDORNA ÄR TJOCKARE ÄN EN YAKOW SKALLE!",
      "MEN DET MÅSTE FINNAS NÅGONTING SOM SKULLE KUNNA ÖPPNA UPP DEM."
    ],
    "sksp0007": [
      "TVÅ ORD: ENERGI CELLER. VI MÅSTE HITTA DEM OCH VI SER INTE RIKTIGT SÅ BRA UT FÖR TILLFÄLLET."
    ],
    "sksp0008": [
      "VI BEHÖVER KULOR. KULOR, JAK! HUR SKA VI ANNARS KUNNA KÖPA ENERGI CELLER OM VI INTE SAMLAR NÅGRA KULOR!"
    ],
    "sksp0009": [
      "VILKEN KONSTIG SAK! JAG SLÅR VAD OM ATT VI KAN FÅ DEN ATT ÖPPNAS",
      "OM DU ÄR STÄRKT MED DEN DÄR LYSANDE BLÅ ECO GREJEN."
    ],
    "sksp0010": [
      "HALLÅ DÄR! BORDE VI INTE GÅ NER OCH KOLLA IN DEN GAMLA FISKARENS MOTORBÅT SOM LIGGER NERE VID HAMNEN!"
    ],
    "sksp0011": [
      "VI BORDE GÅ OCH FRÅGA FISKAREN NERE VID JUNGELFLODEN",
      "IFALL VI KAN LÅNA HANS MOTORBÅT OCH STICKA ÖVER TILL DIMMIGA ÖN!"
    ],
    "sksp0013": [
      "SÅG DU STORLEKEN PÅ DET DÄR BETTET",
      "SOM LURKER HAJEN TOG EN TUGGA AV FISKARENS BÅT?",
      "VI VORE NOG VARA KLOKA I ATT HÅLLA OSS LÅNGT BORTA FRÅN DEM!",
      "JAG TROR NOG INTE ATT VI KAN HANTERA EN SÅDAN VARELSE SOM ÄR SÅ JÄKLA ELAK."
    ],
    "sksp0014": [
      "VI HAR LYCKATS SAMLA IHOP TILLRÄCKLIGT MÅNGA KULOR FÖR ATT BYTA TILL EN ENERGI CELL.",
      "LÅT OSS GÅ TILLBAKA OCH GENOMFÖRA BYTET NU GENAST!"
    ],
    "sksp0015": [
      "DET DÄR MÅSTE VARA EN AV DE DÄR PREKURSOR ORAKLEN SOM DEN VISE MANNEN TJATAR OM HELA TIDEN.",
      "JAG HOPPAS ATT DE INTE VAR LIKA FULA I VERKLIGHETEN!"
    ],
    "sksp0017": [
      "WOW! KOLLA IN DEN DÄR HÄFTIGA SKULPTÖREN",
      "SOM SITTER PÅ STENARNA DÄR BORTA!"
    ],
    "sksp0018": [
      "VI BORDE NOG GÅ OCH SÄGA ÅT DEN DÄR TOKSTOLLEN TILL BORGMÄSTARE ATT HAN STÅR I STOR SKULD TILL OSS",
      "FÖR ATT VI KOPPLADE IHOP BYNS ENERGISTRÅLE!"
    ],
    "sksp0019": [
      "HALL HALLÅ DÄR, FISKMÅSAR! SK AVI TA OCH STÖRA DE BARA FÖR NÖJETS SKULL."
    ],
    "sksp0020": [
      "TJO HO HO! KAN VI INTE GÖRA DET DÄR IGEN!"
    ],
    "sksp0021": [
      "DÄR ÄR DE DÄR FISKMÅSARNA IGEN. PÅ DE BARA!!"
    ],
    "sksp0022": [
      "AH HA HA HA HA HA!! OH HO HO!"
    ],
    "sksp0023": [
      "HA!"
    ],
    "sksp0024": [
      "TJO HO HO! TJO HO!"
    ],
    "sksp0025": [
      "OJDÅ! DE SKAPADE EN LAVIN! KAN VI INTE GÅ OCH KIKA PÅ DET."
    ],
    "sksp0026": [
      "HALL ÅDÄR! DEN DÄR PELEKANEN SNODDE BARA EN ENERGI CELL!",
      "SKA VI GÅ OCH LÄRA DEN DÄR FÅGELN EN LÄXA!"
    ],
    "sksp0027": [
      "FORT! VI MÅSTE HINNA FRAM TILL ENERGI CELLEN INNAN PELEKANEN PLOCKAR UPP DEN IGEN."
    ],
    "sksp0028": [
      "SPARKA ÄGGET! HA HA! SPARKA DET! SPARKA DET!"
    ],
    "sksp0029": [
      "EH, VI BORDE NOG PRATA MED FÅGELSKÅDAREN",
      "OCH SE OM VI KNÄCKTE DET DÄR FLUT FLUT ÄGGET."
    ],
    "sksp0030": [
      "HALLÅ DÄR, FÖRSÖK ATT SLÅ TILL STENARNA FÖR ATT FÅ DE UR VÄGEN!"
    ],
    "sksp0031": [
      "ÅH! KAN VI INTE ANVÄNDA KANONEN FÖR ATT SPRÄNGA NÅGRA SAKER!"
    ],
    "sksp0034": [
      "KRAFT! KRAFT! DYK EFTER DE DÄR KULORNA JAK, DYK!"
    ],
    "sksp0035": [
      "OK, SÅ VI HAR EN PREKURSOR AVFYRNINGSRAMP HÄR",
      "MEN DU HAR INTE FÅTT NÅGON ENERIG FRÅN DET DÄR BLÅA GREJERNA. SÅ DET KOMMER INTE ATT HJÄLPA OSS!"
    ],
    "sksp0037": [
      "DE DÄR TORNEN SOM FINNS UTSPRIDDA RUNT OM HELA JUNGELN MÅSTE LEDA OM ECO STRÅLEN.",
      "KOM IGEN SÅ TAR VI OCH FÖRSÖKER LIRKA MED DEM!"
    ],
    "sksp0038": [
      "HMM, IFALL BLÅ ECO KAN BYGGA EN BRO, SÅ SKULLE JAG SLÅ VAD OM ATT DET OCKSÅ KAN ÖPPNA EN DÖRR!",
      "KOM IGEN SÅ ATT VI KAN GÅ TILLBAKA OCH SE TILL ATT DU FÅR ENERGI IGEN."
    ],
    "sksp0039": [
      "TITTA DÄR, DET FINNS SMÅ BLIXTMARKERINGAR PÅ STOLPARNA",
      "OCH DET KOMMER UT BLIXTAR FRÅN KÄLLAN DÄR BORTA.",
      "TÄNKER DU PRECIS VAD JAG TÄNKER?"
    ],
    "sksp0040": [
      "KOM IGEN SÅ ATT VI KAN KOMMA UPP PÅ MASKINEN OCH KROSSA SPEGELN SOM AVLEDER PREKURSORSTRÅLEN!"
    ],
    "sksp0041": [
      "VI BEHÖVER TA OSS UPP TILL TOPPEN AV DET DÄR TORNET!"
    ],
    "sksp0043": [
      "VI BORDE KANSKE GÅ OCH LETA RÄT PÅ FISKAREN.",
      "JAG HÖRDE ATT HAN VAR I JUNGELN OC FISKADE NERE VID DEN NEDRE FLODEN!"
    ],
    "sksp0049": [
      "RADA UPP STRÅLEN GENOM ATT PEKA DEN MOT NÄSTA TORN!"
    ],
    "sksp0050": [
      "KROSSA SPEGELN, JAK!"
    ],
    "sksp0051": [
      "GE DIG PÅ INSEKTERNA, JAK! GE DIG PÅ INSEKTERNA!"
    ],
    "sksp0052": [
      "KOM IGEN SÅ GÅR VI TILL NÄSTA TORN OCH ÅTERKOPPLARSTRÅLEN DÄR!"
    ],
    "sksp0053": [
      "HALLÅ DÄR! VI KANN FÖLJA EFTER STRÄLEN FÖR ATT KOMMA TILL NÄSTA TORN."
    ],
    "sksp0054": [
      "VI MÅSTE SE TILL ATT DU ÄR FYLLD MED DET DÄR BLÅ GREJEN FÖR ATT KUNNA ÖPNNA DET HÄR!"
    ],
    "sksp0056": [
      "TITTA! JAG SER SKULPTÖRENS MUSA DÄR!"
    ],
    "sksp0059": [
      "DET HÄR STÄLET GER MIG RYSNINGAR!",
      "VI BORDE NOG SE TILL ATT HÅLLA DIG BORTA FRÅN GEGGAN, OK?"
    ],
    "sksp0060": [
      "(SNYFTAR) DET HÄR STÄLLET GER MIG RYSNINGAR!",
      "OCH HÅLL MED MIG, ATT DET ÄR EN HELT NY UPPLEVELSE",
      "NÄR DU ÄR HELT TÄCKT MED PÄLS!"
    ],
    "sksp0062": [
      "KOM IGEN SÅ SMÄLLER VI DE DÄR BALLONG LURKERS OCH SLITER DE I SMÅBITAR!"
    ],
    "sksp0063": [
      "JAG SA ÅT DIG ATT SLITA SÖNDER LURKERS JAK. INTE MINORNA!",
      "REGEL NUMMER ETT: FÖRSÖK ALLTID ATT UNDVIKA MINORNA!"
    ],
    "sksp0064": [
      "VAR FÖRSIKTIG! DU MINNS VÄL VAD SOM HÄNDE FÖRRA GÅNGEN VI VAR HÄR VÄL."
    ],
    "sksp0067": [
      "RAMLA INTE NER I DIMMAN SOM ÄR UNDER OSS!",
      "FÖR JAG TROR INTE ATT VI SKULLE KUNNA TA OSS TILLBAKA."
    ],
    "sksp0069": [
      "DET ÄR ETT BAKHÅLL, JAK! DET ÄR ETT BAKHÅLL!"
    ],
    "sksp0070": [
      "HOPPA UPP I LUFTEN, OCH DYK NER PÅ DEN FÖR ATT KUNNA BALANSERA PÅ DEN."
    ],
    "sksp0071": [
      "FÅ TAG PÅ DEN RÖDA ECON!"
    ],
    "sksp0072": [
      "RÖD ECO SER TILL ATT DINA ATTACKER BLIR STARKARE."
    ],
    "sksp0073": [
      "VI BEHÖVER BLÅ ECO FÖR ATT KUNNA GE ENERGI ÅT DEN HÄR PLATTFORMEN!"
    ],
    "sksp0076": [
      "JAK! HIT SOME JUMPS TO KEEP US OFF THE HOT GROUND."
    ],
    "sksp0077": [
      "BALLÅNGER ÄR BRA, BRINNANDE HET MAGMA ÄR INTE BRA!"
    ],
    "sksp0078": [
      "KÖR PÅ DE UPPHÖJDA PREKURSOR SAKERNA FÖR ATT HÅLLA OSS NERKYLDA."
    ],
    "sksp0079": [
      "AH! JAG KOMMER ATT DÖ! JAG KOMMER, FARFAR!",
      "DU MÅSTE FÖ ÖVER DEN HÄR SAKEN TILL ANDRA SIDAN INNAN DEN BLIR ÖVERHETTAD!"
    ],
    "sksp0080": [
      "ANVÄND KURVAN FÖR ATT KUNNA STYRA BÄTTRE!"
    ],
    "sksp0081": [
      "AH! KANSKE SKULLE JAG KÖRA!"
    ],
    "sksp0082": [
      "DU FÖRSÖKER VÄL UNDVIKA DE DÄR MÖRKA ECO LÅDORNA, VISST?"
    ],
    "sksp0083": [
      "ÅH! FÖRSÖK SE OM VI SKULLE KUNNA FÅ LITE LUFT GENOM ATT FLYGA AV DE DÄR LURKERS!"
    ],
    "sksp0084": [
      "FÖR NÄRA, FÖR NÄRA!"
    ],
    "sksp0085": [
      "AJDÅ! DET SER UT SOM OM DEN HÄR LILA SÖTNOSEN HÅLLER PÅ ATT BLI ALLT FÖR VARM!"
    ],
    "sksp0086": [
      "NÅGRA SEKUNDER TILL OCH VI KOMMER VARA SOM STEKT FLUT FLUT!"
    ],
    "sksp0087": [
      "TRÄFFA DE DÄR BALLONGERNA FÖR ATT KYLA NER!"
    ],
    "sksp0088": [
      "HÄR KOMMER EN TILL BALLONG!"
    ],
    "sksp0089": [
      "JAG ÖNSKAR ATT JAG HADE FÖRSOVIT MIG DEN HÄR MORGONEN!"
    ],
    "sksp0090": [
      "DU MISSADE EN BALLONG! VI BEHÖVER DE ANNARS ÄR VI STEKTA!"
    ],
    "sksp0091": [
      "DEN HÄR VALPEN HÅLLER PÅ ATT BLI FÖR VARM!"
    ],
    "sksp0092": [
      "TYCKER DU ATT DET BÖRJAR LUKTA BRÄNT?!"
    ],
    "sksp0093": [
      "JAG TROR ATT MIN SVANS BRINNER!"
    ],
    "sksp0094": [
      "DEN HÅLLER PÅ ATT EXPLODERA!"
    ],
    "sksp0095": [
      "YIPPIE! VI KLARADE DET!"
    ],
    "sksp0096": [
      "DET VERKAR FINNAS SKOUT FLUGOR HÖR UTE, OCKSÅ!"
    ],
    "sksp009a": [
      "HA HA! VI VISADE DE EN SAK ELLER TVÅ."
    ],
    "sksp009b": [
      "SCHYSST, MER KULOR!"
    ],
    "sksp009c": [
      "GÖR MIG EN TJÄNST OCH HÅLL DIG BORTA FRÅN DE DÄR MÖRKA ECO LÅDORNA!"
    ],
    "sksp009d": [
      "YEAH-HA-HA-HA!"
    ],
    "sksp009e": [
      "VO-HO!"
    ],
    "sksp009f": [
      "HÄR FÅR NI NÅGOT, HÄR FÅR NI NÅGOT! HA HA HA!"
    ],
    "sksp009g": [
      "JAG ÄR RAK BAKOM DIG, JAK!"
    ],
    "sksp009i": [
      "HITTADE VI ALLA SKOUT FLUGORNA I DET HÄR OMRÅDET?"
    ],
    "sksp009j": [
      "HÖRRU DU! DET VERKAR SOM SKOUT FLUGOR ALLTID ÄR I RÖDA LÅDOR."
    ],
    "sksp009k": [
      "SCHYSST! DU HITTADE ALLA SKOUT FLUGORNA I DET HÄR OMRÅDET!"
    ],
    "sksp0109": [
      "E JIPPIE! VI KROSSADE VÄRLDSREKORDTIDEN!"
    ],
    "sksp0110": [
      "JAG HAR SAGT DET FÖRR, OCH JAG SÄGER DET IGEN...",
      "FÖRSÖK ATT UNDVIKA DE MÖRKA ECO LÅDORNA!"
    ],
    "sksp0111": [
      "KOM IGEN SÅ TAR VI OCH FÖRSÖKER JAGA TILLBAKA MULLVADARNA NER UNDER MARKEN."
    ],
    "sksp0112": [
      "KOM IGEN SÅ GÅR VI OCH HÄMTAR VÅR ENERGI CELL FRÅN GEOLOGEN."
    ],
    "sksp0113": [
      "DET DÄR MÅSTE VARA DE INFEKTERADE VÄXTERNA SOM DEN GAMLE TOKSTOLLEN PRATADE OM."
    ],
    "sksp0114": [
      "VI MÅSTE ANVÄNDA OSS AV GRÖN ECO FÖR ATT KUNNA LÄKA DE DÄR VÄXTERNA."
    ],
    "sksp0115": [
      "JAK, KÖR IGENOM DEN GRÖNA ECO KÄLLAN."
    ],
    "sksp0116": [
      "DET DÄR ÄR EN AV DE DÄR FLYGANDE LURKERS!",
      "HAN HAR KANSKE EN ENERGI CELL!"
    ],
    "sksp0117": [
      "DÄR ÄR MULLVADSHÅLET!"
    ],
    "sksp0118": [
      "SE NU TILL, SÅ ATT VI FLYGER ÖVER DE INFEKTERADE VÄXTERNA!"
    ],
    "sksp0119": [
      "EN RING AVKLARAD, MEN FORTFARANDE EN HEL DEL KVAR!"
    ],
    "sksp0120": [
      "SNABBA PÅ! DÄR ÄR NÄSTA RING!"
    ],
    "sksp0121": [
      "SKYNDA! DU MÅSTE FLYGA IGENOM VARJE RING INNAN DE STÄNGS AV!"
    ],
    "sksp0122": [
      "HÖRRU! GRÖSET GÖR ATT VI SAKTAR NER..."
    ],
    "sksp0123": [
      "SKYNDA! FÖLJ EFTER DET DÄR RÖRET!"
    ],
    "sksp0124": [
      "DET HÄR KÄNNS INTE BRA."
    ],
    "sksp0125": [
      "DET SER UT SOM DE DÄR SAKERNA BEHÖVER BLI FYLLDA MED BLÅ ECO."
    ],
    "sksp0126": [
      "KOM IGEN SÅ TAR VI OCH HÄMTAR ENERGI CELLEN UPPE PÅ TAKET AV DEN HÄR SAKEN!"
    ],
    "sksp0127": [
      "SPARKA TILL DEN LILLA PERSONEN UPPE PÅ TAKET!"
    ],
    "sksp0128": [
      "JAK! SPRING! DEN MÖRKA ECON HÅLLER PÅ ATT STIGA!"
    ],
    "sksp0129": [
      "AHH! DEN DÄR MÖRKA ECON HÅLLER PÅ ATT KOMMA NÄRMARE"
    ],
    "sksp0130": [
      "EH, JAG TROR ATT VI MÅSTE AKTIVERA DE DÄR PLATTFORMARNA ELLER NÅGOT."
    ],
    "sksp0131": [
      "HÖRRU! DET VERKAR SOM ATT DU SKULLE KUNNA DYKBOMBA NER PÅ DE DÄR PERSONERNA!"
    ],
    "sksp0132": [
      "EE-EE! JISSES! JO-HO! JO-HOO!"
    ],
    "sksp0133": [
      "JAG SLÅR VAD OM ATT VI SKULLE KUNNA FÅ DE DÄR SAKERNA FYLLDA PÅ EN GÅNG!"
    ],
    "sksp0134": [
      "VAD SÄGS OM ATT VI FÖRSÖKER TA DET LUGNT MED DE DÄR VARMA RÖREN?!"
    ],
    "sksp0135": [
      "DET DÄR VATTNET SER FARLIGT UT NÄR DET BYTER FÖRG!"
    ],
    "sksp0136": [
      "DU MÅSTE TA DIG UT UR VATTNET INNAN DET BYTER FÄRG!"
    ],
    "sksp0137": [
      "JAG SLÅR VAD OM ATT VI SKULLE KUNNA SKJUTA SÖNDER DE DÄR STENARNA OM VI VAR FYLLD MED GUL ECO."
    ],
    "sksp0138": [
      "VI SKULLE KANSKE TA OCH SKJUTA SÖNDER DE DÄR STORA STENARNA SOM HÅLLER FAST ANKARET."
    ],
    "sksp0139": [
      "VI BORDE KANSKE TA OCH HJÄLPA KNÄPPSKALLEN MED ATT HITTA SITT HUSDJUR."
    ],
    "sksp0140": [
      "FLUT-FLUT KAN GLIDFLYGA LÄNGRE OM HON HOPPAR UPP IGEN I LUFTEN!"
    ],
    "sksp0141": [
      "RÖR INTE VID DEN DÄR SVARTA VARMA RÖKEN, ANNARS KOMMER DU ATT SKADA!"
    ],
    "sksp0142": [
      "VATTNET VERKAR VARA SÄKERT ATT VADA IGENOM."
    ],
    "sksp0143": [
      "JÖSSES! FÖRSÖK ATT BRYTA UPP TUNGANS GREPP!"
    ],
    "sksp0144": [
      "SKJUT DE DÄR RÅTTBONA FÖR ATT STOPPA RÅTTORNA FRÅN ATT KOMMA UT."
    ],
    "sksp0145": [
      "WOW! DU KAN SKJUTA ELDBOLLAR",
      "NÄR DU ÄR FYLLD MED GUL ECO."
    ],
    "sksp0146": [
      "HALLÅ DÄR! DET DÄR ÄR GUL ECO!"
    ],
    "sksp0147": [
      "DU KAN SVINGA DIG ÖVER PÅ PÅLEN DÄR BORTA!"
    ],
    "sksp0148": [
      "SE UPP, FÖR DEN DÄR TÖRNEN ÄR TAGIG!"
    ],
    "sksp0149": [
      "HALLÅ DÄR, DET DÄR SER UT SOM ETT ANKARE SOM HÅLLER LUFTSKEPPET PÅ PLATS!"
    ],
    "sksp0150": [
      "VAR FÖRSIKTIG NÄR DEN DÄR GRODAN HÅLER PÅ ATT FÖRBEREDA SIG FÖR EN ATTACK!"
    ],
    "sksp0151": [
      "SPRING IVÄG, JAK!"
    ],
    "sksp0152": [
      "SE UPP, JAK! DET ÄR ETT BAKHÅLL!"
    ],
    "sksp0153": [
      "HÖRRU, DET DÄR MÅSTE VARA PREKURSOR ARTIFAKTEN SOM LURKERS VAR UTE EFTER!",
      "DET SER UT SOM EN JÄTTELIK ROBOTARM!"
    ],
    "sksp0154": [
      "DEN DÄR SVART RÖKEN SER UT ATT VARA VARM OCH FARLIG!"
    ],
    "sksp0155": [
      "SKJUT FLADDERMÖSSEN MED DET DÄR GULA ECO GREJEN!"
    ],
    "sksp0156": [
      "VI SKULLE KANSKE KUNNA DUCKA FRÅN FLADDERMÖSSEN!"
    ],
    "sksp0157": [
      "SÅG DU DET DÄR`? BARA TRE ANKARE KVAR!"
    ],
    "sksp0158": [
      "WOW! BARA TVÅ ANKARE TILL.."
    ],
    "sksp0159": [
      "LUFTSKEPPET HÄNGER NÄTT OCH JÄMT KVAR! KOM IGEN SÅ LETAR VI RÄTT PÅ DET SISTA ANKARET!"
    ],
    "sksp0160": [
      "HÖRRU! DÄR ÄR FLUT-FLUT!"
    ],
    "sksp0161": [
      "JAG HATAR RÅTTOR! OCH JAG ÄR NÄSTAN SJÄLV EN AV DE."
    ],
    "sksp018a": [
      "DEN DÄR LATA BONDEN ÄR SKYLDIGA OSS EN ENERGI CELL!",
      "VI BORDE GÅ OCH PRATA MED HONOM!"
    ],
    "sksp0300": [
      "VI MÅSTE HINNA FÖRE DE DÄR LURKERS TILL SLUTET AV PASSET!"
    ],
    "sksp0301": [
      "FÖRSÖK ATT UNDVIKA ATT RÄFFA DE DÄR SPRÄNGMEDELEN!"
    ],
    "sksp0302": [
      "HÅLL DIG KVAR FRAMFÖR DE OCH VI KOMMER ATT GREJA DET HÄR!"
    ],
    "sksp0303": [
      "PRICKA BLÅ ECO FÖR ATT KUNNA ÖKA FARTEN!"
    ],
    "sksp0304": [
      "UNDVIK TRÄDEN, JAK! DET KOMER ATT SAKTA NER OSS!"
    ],
    "sksp0305": [
      "JU FLER BLÅ ECO VI PRICKAR, DESTO SNABBARE KOMMER VI ATT GÅ!"
    ],
    "sksp0306": [
      "SE UPP FÖR DE DÄR SPRÄNGMEDLEN!"
    ],
    "sksp0307": [
      "HÅLL DIG BORTA FRÅN GROPARNA!"
    ],
    "sksp0308": [
      "JAG SKULLE KANSKE FÖRSÖKA KÖRA!"
    ],
    "sksp0309": [
      "DÄR ÄR EN AV DE DÄR LURKERS!"
    ],
    "sksp0310": [
      "FÅNGA DE, JAK!"
    ],
    "sksp0311": [
      "VI LYCKADES PASSERA EN AV DE!"
    ],
    "sksp0312": [
      "AJDÅ, EN AV DE DÄR LURKERS LYCKADES PASSERA OSS!"
    ],
    "sksp0313": [
      "DE ÄR LÅNGT FÖRE OSS!"
    ],
    "sksp0314": [
      "ÅH JA, NU ÄR DET VI SOM LEDER!"
    ],
    "sksp0315": [
      "SNABBARE, JAK, SNABBARE!"
    ],
    "sksp0316": [
      "HÄR KOMMER ETT STORT GUPP, HÄR KOMMER ETT STORT GUPP!"
    ],
    "sksp0317": [
      "HÅLL I DIG!"
    ],
    "sksp0318": [
      "JIHA!"
    ],
    "sksp0319": [
      "DET HÄR KOMMER BLI PÅ HÅRET!"
    ],
    "sksp0320": [
      "DE KOMMER ATT HINNA FÖRE OSS TILL AVTRYCKAREN!"
    ],
    "sksp0321": [
      "VI GJORDE DET! VI LYCKADES STOPPA DE FRÅN ATT SPRÄNGA PASSET!"
    ],
    "sksp0327": [
      "JAG TROR ATT DET DÄR VAR DEN SISTA AV DE DÄR MÖRKA ECO KRISTALLERNA!"
    ],
    "sksp0328": [
      "DU SKULLE KANSKE KUNNA SKJUTA BÄTTRE IFALL DU SIKTADE IGENOM DINA GOGLES."
    ],
    "sksp0329": [
      "ÅH, NEJ! MER MÖRK ECO!"
    ],
    "sksp0330": [
      "JAG TROR INTE ATT VI FICK KÅL PÅ ALLA DE DÄR MÖRKA ECO KRISTALLERNA."
    ],
    "sksp0331": [
      "SKJUT NER LURKERS SOM TUGGAR PÅ PÅLARNA!"
    ],
    "sksp0332": [
      "SE TILL ATT LJUSET INTE SLÄCKS!"
    ],
    "sksp0333": [
      "SLÅ TILL EN KRISTALL FÖR ATT FÅ LITE LJUS."
    ],
    "sksp0334": [
      "SPRING IVÄG! DEN DÄR KRISTALLEN KOMMER ATT EXPLODERA!"
    ],
    "sksp0335": [
      "AJDÅ, DE HAR LYCKATS HITTA EN PREKURSOR ROBOT!"
    ],
    "sksp0336": [
      "SPRÄCK ÄGGEN, SÅ AT DE INTE KLÄCKS!"
    ],
    "sksp0337": [
      "DET ÄR LÄSKIGT HÄR INNE..."
    ],
    "sksp0338": [
      "DET VERKAR SOM ATT SPINDELNÄTEN GÅR SÖNDER EFTER TVÅ STUDSAR."
    ],
    "sksp0339": [
      "JA. HATAR. SPINDLAR..."
    ],
    "sksp0340": [
      "SMÅ BÄBISSPINDLAR ÄR PÅ VÄG!"
    ],
    "sksp0341": [
      "JAG TROR ATT VI HAR KOMMIT TILL ETT SPINDELBO HÄR!"
    ],
    "sksp0342": [
      "SE UPP, FÖR HÄR KOMMER FLER SPINDLAR!"
    ],
    "sksp0343": [
      "KOM IGEN SÅ STICKER VI UT HÄRIFRÅN!"
    ],
    "sksp0345": [
      "HUR SKA VI TA OSS ÅT FÖR ATT KOMMA IN I DET HÄR FORTET?"
    ],
    "sksp0346": [
      "KANSKE SKULLE RÖD ECO KUNNA HJÄLPA OSS ATT BESEGRA DEN HÄR PERSONEN!"
    ],
    "sksp0347": [
      "VI BEHÖVER UTFÖRA ETT RULL HOPP!"
    ],
    "sksp0348": [
      "VI MÅSTE FÖRSÖKA HITTA ETT SÄTT FÖR ATT KUNNA ÖPPNA DEN HÄR KÄLLAN!"
    ],
    "sksp0349": [
      "DET DÄR SER UT SOM EN ECO KNAPP DÄR NERE!"
    ],
    "sksp0350": [
      "SLÅ TILL DE NÄR DE HAR SPIKANRA INDRAGNA!"
    ],
    "sksp0351": [
      "TRYCK PÅ KNAPPEN!"
    ],
    "sksp0352": [
      "SKYNA PÅ! INNAN DE DIMPER NER IGEN!"
    ],
    "sksp0359": [
      "DU MÅSTE ANVÄNDA RÖD ECO!"
    ],
    "sksp0360": [
      "SNYGGT! VI AKTIVERADE DE AVSTÄNGDA GULA ECO KÄLLORNA!"
    ],
    "sksp0362": [
      "TITTA DÄR! EN NERFRUSEN ENERGI CELL!"
    ],
    "sksp0363": [
      "BARA EN FLUT-FLUT KAN HOPPA SÅ DÄR LÅNGT!"
    ],
    "sksp0364": [
      "VI MÅSTE SKYNDA OSS, ELLER ANNARS SÅ ÄR DET UTE MED OSS!"
    ],
    "sksp0365": [
      "VÄLJ EN VÄG, VILKEN VÄG SOM HELST!"
    ],
    "sksp0366": [
      "UNDVIK, ELLER SKJUT MINORNA, JAK!"
    ],
    "sksp0367": [
      "KOM PÅ ETT SÄTT ATT KOMMA IGENOM DE DÄR MÖRKA ECO TUNNORNA!"
    ],
    "sksp0368": [
      "FORTSÄTT ATT TRÄFFA DE DÄR NERKYLNINGSBALLONGERNA!"
    ],
    "sksp0369": [
      "VI HÅLLER PÅ ATT BLI FÖR VARMA!"
    ],
    "sksp0370": [
      "HON KOMMER ATT EXPLODERA!"
    ],
    "sksp0371": [
      "SIKTA PÅ DEN BLÅ ECON, JAK!"
    ],
    "sksp0372": [
      "SKJUT DIG IGENOM!"
    ],
    "sksp0373": [
      "VOHO! VILKEN ÅKTUR!"
    ],
    "sksp0374": [
      "JA! SVÄNG OCH GASA PÅ, SÖTNOS!"
    ],
    "sksp0375": [
      "SKJUT ENERGISFÄRERNA FÖR ATT KUNNA ÖPPNA DÖRREN!"
    ],
    "sksp0376": [
      "SKJUT ENERGISFÄRERNA INNAN VI SMÄLTER!"
    ],
    "sksp0378": [
      "DÖREN ÄR ÖPPEN, SÅ KOM IGEN SÅ SÅ GER VI OSS IVÄG!"
    ],
    "sksp0379": [
      "ZOOMANDE!"
    ],
    "sksp0380": [
      "VI LYCKADES TA OSS IGENOM!"
    ],
    "sksp0381": [
      "SLÅ SÖNDER GENERATORN FÖR ATT FRIGÖRA DEN VISE MANNEN!"
    ],
    "sksp0382": [
      "HÅLL I DIG BARA I KANTEN!"
    ],
    "sksp0383": [
      "VI HAR FÅTT SÄLLSKAP, JAK. MASSOR AV LURKERS!"
    ],
    "sksp0384": [
      "FÖRSTÖR DE DÄR GENERATORERNA!"
    ],
    "sksp0385": [
      "TRYCK PÅ KNAPPEN!"
    ],
    "sksp0386": [
      "DEN DÄR ROBOTEN SKRÄMMER INTE MIG!"
    ],
    "sksp0387": [
      "KOM IGEN SÅ KLÖTTRAR VI UPP FÖR DE DÄR PLATTFORMARNA!"
    ],
    "sksp0388": [
      "MISSA INTE NÄSTA AVFURNINGSRAMP!"
    ],
    "sksp0389": [
      "SE UPP DÄR!"
    ],
    "sksp0390": [
      "VI MÅSTE RÖDDA ALLA DE VISE MÄNNEN!"
    ],
    "sksp0391": [
      "TROR DU ATT GOL FORTFARANDE KOMMER ATT VILJA ÄNDRA TILLBAKA MIG?"
    ],
    "sksp0392": [
      "SÅ DET HÄR ÄR GOL OCH MAIA'S CITADELL. TRAVLIGT OCH MYSIGT."
    ],
    "sksp0393": [
      "FÖRSÖK ATT LANDA PÅ NÄSTA AVFURNINGSRAMP!"
    ],
    "sksp0394": [
      "FÅ TAG I DEN GULA ECON!"
    ],
    "sksp0395": [
      "SKJUT ROBOTEN, JAK!"
    ],
    "sksp0396": [
      "SKJUT HANS ARM!"
    ],
    "sksp0397": [
      "SKJUT HANS PISTOL!"
    ],
    "sksp0398": [
      "SKJUT HANS HUVUD!"
    ],
    "sksp0399": [
      "SE UPP FÖR EXPLOSIONEN!"
    ],
    "sksp0400": [
      "HAN HÅLER PÅ ATT LADDA UPP!"
    ],
    "sksp0401": [
      "FÅ TAG PÅ DEN BLÅA ECON!"
    ],
    "sksp0402": [
      "FÅ TAG PÅ DEN RÖDA ECON!"
    ],
    "sksp0403": [
      "DET HÄR KÄNNS INTE BRA!"
    ],
    "sksp0404": [
      "ANVÄND AVFYRNINGSRAMPEN, FORT!"
    ],
    "sksp0405": [
      "NU HAR DU GJORT DJURET ARGT!"
    ],
    "sksp0406": [
      "VI KAN INTE VIDRÖRA DE HÄR PERSONERNA!"
    ],
    "sksp0407": [
      "ANVÄND DEN GULA ECON!"
    ],
    "sksp0408": [
      "SKJUT DE DÄR PERSONERNA!"
    ],
    "sksp0409": [
      "FÅ TAG I DEN LJUSA ECON, JAK!"
    ],
    "sksp0410": [
      "HAN SER UT ATT VARA ARG!"
    ],
    "sksp0411": [
      "HOPPA UPP FÖR ATT KUNNA UNDVIKA EXPLOSIONERNA!"
    ],
    "sksp0412": [
      "VI TAR HAND OM SAKEN NU!"
    ],
    "sksp0413": [
      "SNYGGT SKJUTANDE DÄR, PARTNER!"
    ],
    "sksp0414": [
      "DET DÄR GJORDE ONT PÅ HONOM!"
    ],
    "sksp0415": [
      "HÄR KOMMER HAN!"
    ],
    "sksp0416": [
      "JAPP! DU GJORDE DET!"
    ],
    "sksp0417": [
      "SÄG ADJÖ, GOL OCH MAIA!"
    ],
    "sksp0435": [
      "VÄLT ÖVER DE DÄR BENEN!"
    ],
    "sksp0443": [
      "SLÅ TILL DE DÄR PÅLARNA UPPIFRÅN OCH NER!"
    ],
    "sksp0444": [
      "VI VÄNTAR HÄR. HALLÅ?"
    ],
    "sksp0449": [
      "TRYCK PÅ START FÖR ATT SPELA."
    ],
    "sksp0450": [
      "VILL DU SLUTA SPELA?"
    ],
    "sksp0451": [
      "JAG TRODDE INTE DET."
    ],
    "sksp0452": [
      "OK, DÅ SES VI SENARE."
    ],
    "sksp0455": [
      "JÖSSES, VILKA ÄR ALLA DE HÄR MÄNNISKORNA?"
    ],
    "sksp0466": [
      "JAG GJORDE BRA IFRÅN MIG. ELLER HUR GJORDE JAG INTE DET, TJEJER?"
    ],
    "sksp0b42": [
      "SLUTA UPP MED ATT MISSA DE DÄR GULA FISKARNA, DE VÄGEN 5 KG VAR!",
      "OCH DET ÄR EN HEL DEL FISK, JAK."
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "FÅGEL SKÅDARE",
    "BLUE SAGE": "BLÅ VIS MAN",
    "DAXTER": "DAXTER",
    "FARMER": "BONDE",
    "FISHERMAN": "FISKARE",
    "FLUT-FLUT": "FLUT-FLUT",
    "GAMBLER": "SPELARE",
    "GEOLOGIST": "GEOLOG",
    "GOL": "GOL",
    "GORDY": "GORDY",
    "JAK": "JAK",
    "JAK'S UNCLE": "JAK'S FARBROR",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "BORGMÄSTARE",
    "MINER": "GRUVARBETARE",
    "OLD MAN": "GAMMAL MAN",
    "ORACLE": "ORAKEL",
    "RED SAGE": "RÖD VIS MAN",
    "SAMOS": "SAMOS",
    "SCULPTOR": "SKULPTÖR",
    "WARRIOR": "KRIGARE",
    "WILLARD": "WILLARD",
    "WOMAN": "KVINNA",
    "YELLOW SAGE": "GUL VIS MAN"
  }
}
