{
  "cutscenes": {
    "assistant-firecanyon-resolution": [
      "GODT! I HAR DE 20 CELLER NØDVENDIGE FOR AT FORSYNE MIT VARME SKJOLD!",
      "VÆR NU FORSIGTIGE, SKJOLDET VIL KUN BESKYTTE JERES ZOOMER",
      "TIL DEN NÅR 500 GRADER, SÅ PRØV AT HOLDE DEN KØLIG.",
      "AT FLYVE OVER ÅBEN LAVA VIL KLART VARME JER OP HURTIGT.",
      "RAM 500 GRADER, OG DET ER OVRE.",
      "OVRE?! SOM BRÆNDENDE SMELTET METAL OVRE?!",
      "ILD-SLUGTEN BLIVER MEGET VARM, SÅ HOLD ØJE MED MULIGE HOP",
      "FOR AT HOLDE JER I LUFTEN.",
      "JEG HAR OGSÅ FRIGJORT FLERE BLÅ KØLENDE BALLONER I KAN BRUGE TIL AT SÆNKE",
      "SKJOLDETS TEMPERATUR HURTIGT.",
      "ÅH! OG NÅR I KOMMER IGENNEM, GLEM IKKE AT AKTIVERE",
      "TELEPORT PORTEN I DEN BLÅ VISMANDS LABORATORIE.",
      "SÅ VIL VI KUNNE TELEPORTERE DEROVER OG MØDE JER.",
      "HELD OG LYKKE!"
    ],
    "assistant-introduction-blue-eco-switch": [
      "HEJ, SNUSKE. HVAD SIGER DU TIL AT VI TO TAGER EN TUR PÅ DENNE ANTI-TYNGDEKRAFTS ZOOMER?",
      "REGEL NUMMER ET: JEG DATER IKKE DYR.",
      "ÅH, DU VED IKKE, HVAD DU GÅR GLIP AF, HE HEH.",
      "HØR, HVIS I HAR BRUG FOR NOGET AT HOLDE JER BESKÆFTIGET MED, MIN FAR TALTE ALTID ",
      "OM EN ÆLDGAMMEL FORGÆNGER-RØRLEDNING GEMT DYBT UNDER JORDEN.",
      "NOGLE AF RØRENE  ENDER I VENTILER HVORFRA ECO FLYDER FRIT,",
      "OG NOGLE HAR BLEVET DÆKKET TIL, SÅ AT DET ECO ER FORSEGLET VÆK.",
      "DER MÅ VÆRE EN MÅDE AT ÅBNE DE LUKKEDE VENTILER.",
      "JEG HAR SPORET EN DEL AF DENNE RØRLEDNING TILBAGE TIL DET FORBUDTE TEMPEL.",
      "MÅSKE SKULLE I KIGGE DER EFTER EN SLAGS KONTAKT."
    ],
    "assistant-introduction-race-bike": [
      "HEJ SNUSKE, HVA' ARBEJDER DU PÅ?",
      "VÆR FORSIGTIG MED DET! JEG PRØVER AT FINDE UD AF, HVORDAN MAN TRASNPORTERER ZOOMEREN",
      "VED BRUG AF DE TANS-PLATFORME SOM FORGÆNGERNE HAR EFTERLADT OVER HELE VERDEN.",
      "HVIS I KOMMER FORBI EN AF DISSE PLATFORME, KAN JEG LÅSE FAST PÅ JERES KOMMUNIKATORS POSITION",
      "OG SENDE JER ZOOMEREN!",
      "HOLD ØJE EFTER EN TRANS-PLATFORM NÅR I UDFORSKER DEN DISEDE Ø, OG HVOR END I ELLERS REJSER!"
    ],
    "assistant-lavatube-end-resolution": [
      "HEY! HVOR ER DEN KORTE GAMLE GRØNNE OG RYNKEDE?",
      "DET ER FORFÆRDELIGT! FADER ER FORSVUNDET!",
      "JEG TROR GOL OG MAIA NOK OGSÅ HAR KIDNAPPET HAM!",
      "ROLIG, ELSKEDE. JEG HAR ALT UNDER KONTROL.",
      "UNDER KONTROL?!",
      "LURER HÆRENE GROR TVÆRS OVER LANDET,",
      "VISMÆNDENE ER BLEVET BORTFØRT,",
      "GOL OG MAIA HAR SAMLET NOK ECO",
      "TIL AT FULDFØRE DERES FORFÆRDELIGE PLAN,",
      "OG FOR AT STOPPE DEM, VIL I VÆRE NØDT TIL AT",
      "KÆMPE JERES VEJ GENNEM DERES FÆSTNING!",
      "ØH... JA. DET, ØH... OPSUMMERER DET.",
      "I ER NØDT TIL AT REDDE MIN FADER FØR DET ER FORSENT!",
      "OG JAK...",
      "VÆR FORSIGTIG.",
      "JA. DET VIL VI!"
    ],
    "assistant-lavatube-start-resolution": [
      "HA HA! JAVEL JA!",
      "MED DISSE YDERLIGERE KRAFTCELLER, BURDE JEG KUNNE FORSYNE VARMESKJOLDET",
      "MED NOK STYRKE TIL AT KUNNE HOLDE MOD DENNE LAVA.",
      "MEN SKJOLDET HAR STADIG EN BEGRÆNSNING",
      "DEN VIL NU KUNNE MODSTÅ TEMPERATURER OP TIL 800 GRADER, MEN IKKE MERE.",
      "SÅ HOLD ØJE MED JERES MÅLER.",
      "JEG VIL IKKE TÆNKE PÅ HVAD DE TEMPERATURER VILLE GØRE VED JERES ZOOMER",
      "HVIS SKJOLDET SVIGTER.",
      "JA, VARMEN...",
      "HVAD? ZOOMEREN? HEY! HVAD MED OS?!",
      "TROR DU IKKE VI KUNNE LEDE EFTER EN MERE SIKKER RUTE TIL GOLS FÆSTNING?",
      "SE, JEG HAR UDSENDT FLERE KØLENDE BALLONER IND I RØRET.",
      "SÅ I KAN BRUGE DEM TIL AT HOLDE JERES TEMPERATUR NEDE.",
      "OG GLEM IKKE AT AKTIVERE TELEPORT-PORTEN I DEN GULE VISMANDS LABORATORIE.",
      "VI REGNER MED JER."
    ],
    "assistant-reminder-1-blue-eco-switch": [
      "JEG ER SIKKER PÅ AT HVIS I TOG ET KIG I FORGÆNGERNES FORBUDTE TEMPEL",
      "VILLE I FINDE EN MÅDE AT ÅBNE ALLE DE FORSEGLEDE BLÅ ECO VENTILER PÅ SKILDVAGT STRAND."
    ],
    "assistant-reminder-1-generic": [
      "HEY, DRENGE! BLIV VED MED AT SAMLE KRAFTCELLER",
      "DE ER NØGLEN TIL AT FORTSÆTTE JERES REJSE NORD."
    ],
    "assistant-reminder-1-race-bike": [
      "JEG HAR HELT KLART FUNDET UD AF AT BRUGE TRANS-PLATFORMENE.",
      "TAG NU TIL DEN DISEDE Ø OG JEG VIL SENDE ZOOMEREN OVER TIL JER."
    ],
    "assistant-village2-introduction": [
      "WOAH!",
      "JEG TROR ALDRIG JEG VIL VENDE MIG TIL TELEPORTERENS KILDRENDE FORNÆMMELSE.",
      "HEY!",
      "DET LIGNER AT DEN BLÅ VISMAND HOLDT EN FEST.",
      "ÅH DOG! KLIPPE BYEN STÅR I FLAMMER! ",
      "EN POKKERS FEST.",
      "NEJ, NEJ! JEG MENER KLIPPE BYEN BLIVER BOMBARDERET MED FLAMMENDE STEN!",
      "ÅH! OG DET SER UD TIL DEN BLÅ VISMAND BYGGER EN LEVITATIONS MASKINE FOR AT FLYTTE DEM.",
      "ANTAGER VI AT DEN FUNGERER, FÅR VI BRUG FOR KRAFTCELLER FOR AT FORSYNE DEN.",
      "JEG TÆNKER AT I TO ER NØDT TIL AT FINDE NOGLE FLERE.",
      "VI BURDE NOK KIGGE I HANS NOTER.",
      "JAK, FÅ STYR PÅ LANDSBYBOERNE, OG KOM TILBAGE MED OPLYSNINGER.",
      "OG TAG PELSKLUMPEN MED DIG!"
    ],
    "assistant-village2-introduction-flutflut": [
      "TILBAGE IGEN, DRENGE?",
      "\"DRENGE\"?",
      "HEY TØS, JEG ER FULDT UDVOKSET...",
      "AH...",
      "NOGET... NOGET LODDEN.",
      "ÅH, GÆT HVAD? MED TILLADELSE FRA VORES LANDSBYS FUGLEELSKER,",
      "HAR JEG UDSTYRET FLUT-FLUT UNGEN MED EN SADDEL.",
      "DET SER UD TIL AT DER ER EN TRANS-PLATFORM I DEN MOSET SUMP.",
      "HVIS I KAN FINDE DEN, VIL JEG SENDE FLUT-FLUTEN I FULD RIDDE UDSTYR.",
      "HENDES LANGE HOP KUNNE VÆRE TIL NYTTE NÅR I KRYDSER TJÆREN."
    ],
    "assistant-village2-introduction-robbers": [
      "HEJ, I TO!",
      "JEG VED HVOR I KAN FINDE ENDNU EN KRAFTCELLE!",
      "IFØLGE HANS NOTER,",
      "FOR ET PAR DAGE SIDEN STJAL FLYVENDE LURERE EN FRA DEN BLÅ VISMAND,",
      "OG FLØJ VÆK MOD FORGÆNGERNES RESERVOIR.",
      "JEG ER SIKKER PÅ AT I KUNNE KØRE DE LURERE NED PÅ JERES ZOOMER",
      "INDTIL I FINDER DEN SOM HAR KRAFTCELLEN.",
      "I FINDER ZOOMEREN PÅ TRANS-PLATFORMEN NÆR INDGANGEN TIL FORGÆNGERNES RESERVOIR."
    ],
    "assistant-village2-introduction-room": [
      "ÅBENBART LEDER FORGÆNGERSTRUKTUREN UD FOR KYSTEN",
      "TIL EN SUNKEN GLEMT BY.",
      "DEN BLÅ VISMAND HAR PRØVET PÅ AT FINDE UD AF",
      "HVORDAN HAN KAN BRINGE EN AF KAMRENE TIL OVERFLADEN.",
      "MEN HAN HAVDE ALDRIG SUCCES.",
      "DU BURDE TJEKKE DET UD!",
      "ØH... ER DER IKKE EN MASSE, ØMM...",
      "LURER HAJER I VANDET?",
      "HVORFOR? ER DU BANGE?",
      "MIG? SELVFØLGELIG IKKE!",
      "JEG SER BARE EFTER JAK, HER!",
      "DU, ØH, HEH...",
      "DU VED HVILKEN EN KYLDNING HAN KAN VÆRE.",
      "JAMEN, HVIS DU SVØMMER UD OVER REVET TVIVLER JEG PÅ AT LURERHAJERNE VIL ULEJLIGE DIG.",
      "DE KAN IKKE LIDE LAVT VAND."
    ],
    "assistant-village2-reminder-1-flutflut": [
      "JEG ER SIKKER PÅ AT FLUT-FLUTEN KUNNE VÆRE TIL NYTTE I SUMPEN.",
      "FIND TRANS-PLATFORMEN OG JEG TELEPORTERER HENDE TIL JER."
    ],
    "assistant-village2-reminder-1-robbers": [
      "JEG TELEPORTERER JERES ZOOMER TIL JER VED FORGÆNGERRESERVOIRET,",
      "SÅ I KAN JAGE DE FLYVENDE LURERE VI TALTE OM."
    ],
    "assistant-village2-reminder-1-room": [
      "HAR I SVØMMET UD TIL DEN GLEMTE FORGÆNGER BY ENDNU?",
      "I BURDE VIRKELIG PRØVE AT HEJSE DET KAMMER DEN BLÅ VISMAND VAR EFTER."
    ],
    "assistant-village2-resolution": [
      "GODT, I HAR CELLERNE TIL MASKINEN!",
      "DE BURDE GIVE NOK KRAFT TIL AT LØFTE STENEN.",
      "SÅDAN SKAL DET TIL!",
      "VÆR NU FORSIGTIGE MED AT UDFORDRE MONSTERLUREREN VED TOPPEN.",
      "VENT! UH...",
      "JEG BLIVER HER OG BESKYTTER KEIRA!",
      "JAK, JEG TROR DU ER KLAR TIL AT HÅNDTERE MONSTERET UDEN MIG.",
      "OH, MEGET HEROISK AF DIG."
    ],
    "assistant-village3-reminder": [
      "HEJ DRENGE! BLIV VED MED AT SAMLE KRAFTCELLER.",
      "DE ER NØGLEN TIL AT FORTSÆTTE JERES REJSE NORD."
    ],
    "billy-accept": [
      "GODT! DE ROTTER VIL VÆRE TILBAGE NÅR SOM HELST.",
      "SKYD ALLE DE ROTTER, OG HOLD DEM",
      "FRA AT SPISE EN ENESTE AF DE GODTER."
    ],
    "billy-introduction": [
      "DAVS, VENNER! NYDER I MIN YNDIGE SUMP?",
      "JEG EJER DE HER EGNE.",
      "ALT DER IKKE SYNKER NED I MUDDERET, ALTSÅ! HA HA HA...",
      "AT DØMME EFTER LUGTEN, VIL JEG SATSE PÅ AT DIT",
      "BADEKAR SANK I MUDDERET FOR LÆNGE SIDEN",
      "HVAD ER ET BADEKAR?",
      "NÅ MEN JEG HAR STØRRE PROBLEMER NU...",
      "SEEMS SOME NASTY LURKER VARMINTS ARE GROUSIN' ABOUTS,",
      "SNATCHIN' EVERYTHING THEY CAN GET THEIR GRUBBY LITTLE PAWS ON.",
      "AND SCARIN' AWAY MY PET HIPHOG, FARTHY.",
      "HE'S BEEN MISSIN' FOR NIGH ON TO A COON'S AGE.",
      "I'VE BEEN PUTTIN' OUT HIS FAVORITE SNACK,",
      "BUT THOSE ORNERY SWAMP RATS KEEP STEALIN' EM!",
      "IF YOU COULD KEEP THOSE PESKY CRITTERS AWAY LONG ENOUGH,",
      "I JUST KNOW FARTHY WOULD SMELL THEM VITTLES AND COME BACK!",
      "VIL I HJÆLPE MIG?"
    ],
    "billy-reject": [
      "WELL, IF YOU CHANGE YOUR MIND, YOU KNOW WHERE TO FIND ME!",
      "HE HE HE HE HEH..."
    ],
    "billy-reminder-1": [
      "AHH, ER I TILBAGE FOR AT HJÆLPE MED AT STOPPE DE ROTTER?"
    ],
    "billy-resolution": [
      "WELL FRY MY HIDE! YOU SURE KNOW HOW TO SHOOT!",
      "TAK EN MASSE FOR HJÆLPEN."
    ],
    "bird-lady-beach-resolution": [
      "OH MY, I HOPE THE POOR DEAR'S OKAY.",
      "HER ER EN KRAFTCELLE FOR JERES MOD.",
      "MOR!",
      "MOR!",
      "ÅH NEJ! NEJ, NEJ, NEJ, NEJ!",
      "SE... ER DET IKKE NUTTET? DEN TROR I ER DENS MOR.",
      "EH? JEG ER IKKE DIN MOR! KAN DU SE NOGEN FJER HER?",
      "ÅH, KÆRLIGHED VED FØRSTE BLIK! AH... ",
      "HØR, DRENGE, JEG TAGER DEN LILLE UNGE MED MIG TILBAGE TIL LANDSBYEN",
      "OG SAMARBEJDER MED VISMANDEN FOR AT PASSE HENDE."
    ],
    "bird-lady-introduction": [
      "ÅH DOG, SIKKEN GRUFULDT SYG LILLE FUGL.",
      "HUH! DU SER IKKE ALT FOR GODT UD SELV, DAME!",
      "ÅH, UNDSKYLD. JEG TROEDE DU VAR EN PLETTET",
      "ORANGE-MAVET REGNFLOSS.",
      "I VED, I GÅR SÅ JEG NOGLE",
      "FORFÆRDELIGT BIDSKE SKABNINGER FANGE",
      "EN FLUT-FLUT MOR NÆR STRANDEN.",
      "NU ER DER DETTE ARME LILLE FORÆLDRELØSE ÆG",
      "SOM SIDDER I EN REDE PÅ TOPPEN AF KLIPPEN",
      "OG JEG KAN IKKE NÅ DEROP.",
      "HVIS NU I KUNNE KRAVLE DEROP OG SKUBBE DET NED, HAR JEG DYNGET",
      "NOGET HØ VED FODEN FOR SIKKERT AT GRIBE DET.",
      "GØR EN GAMMEL DAME EN TJENESTE, OG JEG VIL GIVE JER EN KRAFTCELLE."
    ],
    "bird-lady-reminder-1": [
      "ÅH, HEJ IGEN. FANDT I DRENGE DET BLÅ ÆG OPPE PÅ KLIPPEN?",
      "SKUB DET OVER KANTEN OG JEG GIVER JER EN KRAFTCELLE!"
    ],
    "bird-lady-reminder-2": [
      "PILLER I DRENGE STADIG RUNDT HER OMKRING? HO HO HO.",
      "I VIL VÆDDE PÅ AT DET STAKKELS BLÅ ÆG OPPE PÅ KLIPPEN",
      "ER VED AT BLIVE KOLDT NU.",
      "TAG UD OG RED DEN VED AT SKUBBE DEN OVER SKRÆNTEN,",
      "OG JEG VIL GIVE JER EN KRAFTCELLE."
    ],
    "bluesage-resolution": [
      "GODT ARBEJDE, FYRE! GAMLE SAMOS HAVDE RET OM JER!",
      "STORE BUNKER AF FORGÆNGERMETAL!",
      "DEN LUMSKE MEKANISKE SKABELSE",
      "MÅ IKKE HAVE LOV TIL AT FORVOLDE SIN FORFÆRDELIGE ØDELÆGGELSE!",
      "JEG VIL PRØVE AT PÅVIRKE SKJOLDDØREN",
      "VED AT FREMBRINGE EN KANAL AF ENERGI",
      "MELLEM MIG SELV OG DEN STORE ÅBNING UNDER OS!",
      "ØH... JA. GØR DU DET. VI VIL ØH... BARE FINDE MERE HJÆLP.",
      "SÆRLING!"
    ],
    "death-0181": [
      "TRÆD IKKE IND I LYSET, JAK! TRÆD IKKE IND I LYSET!"
    ],
    "death-0182": [
      "HEJ, JAK! KAN JEG...",
      "FÅ DIN INSEKTSAMLING?"
    ],
    "death-0184": [
      "MENS DU ER DERNEDE, ØHM...",
      "KUNNE DU GNUBBE MINE FØDDER?"
    ],
    "death-0186": [
      "BARE ROLIG! JEG VIL HÆVNE DIG!",
      "... IKKE."
    ],
    "death-0187": [
      "TJA, ØH...",
      "HELLERE DIG END MIG."
    ],
    "death-0191": [
      "DET SÅ UD TIL AT GØRE ONDT.",
      "BURDE JEG KALDE EFTER STØTTE?"
    ],
    "death-0193": [
      "TRIN ET: FORBLIV I LIVE!",
      "TRIN TO...",
      "OVERVEJ IKKE AT GØRE SÅDAN NOGET IGEN!"
    ],
    "death-0195": [
      "JEG VAR LIGE BAG DIG, JAK!",
      "... VIRKELIG. DET VAR JEG."
    ],
    "death-0197": [
      "HEIMLICH! ØH... BÅRE!",
      "AD... MINTPASTIL?"
    ],
    "death-0199": [
      "JEG VIL SIGE NOGET MEGET SØRGELIGT VED BEGRAVELSEN, SOM...",
      "...\"HVORDAN FORVANDLES JEG TILBAGE NU?!\""
    ],
    "death-0202": [
      "SIG GODNAT, JAK!"
    ],
    "evilbro-misty-end": [
      "DE TO KUNNE VISE SIG AT VÆRE BALLADE.",
      "FRYGT EJ KÆRE BRODER, JEG VIL UDSENDE MIN LURERHÆR TIL AT TAGE SIG AF DEM.",
      "BARE VÆR SIKKER PÅ AT DE IKKE KOMMER FOR TÆT PÅ VORES NORDLIGE OPERATIONER.",
      "JEG TVIVLER DE NÅR LANGT...",
      "MEN HVIS DE GØR, VIL DER VÆRE EN OVERRASKELSE SOM VENTER PÅ DEM I KLIPPEBYEN.",
      "SÅ... DU VIL LADE... KLAWW UD AF SIT BUR?",
      "JEG MENER DET ER RISIKOEN VÆRD.",
      "SÅMÆND..."
    ],
    "explorer-introduction": [
      "JAMEN, HEJ DER KÆRE DRENG.",
      "DU FANGEDE MIG PÅ DET MEST UBELEJLIGE TIDPUNKT.",
      "JEG SKULLE HAVE TAGET PÅ EN AF MINE EVENTYR I GÅR",
      "MEN JEG SER UD TIL AT VÆRE EN SMULE KNAP PÅ DE GAMLE FORGÆNGERGLOBER.",
      "JEG VILLE HAVE GIVET MIT ORD PÅ AT JEG HAVDE 90 AF DEM,",
      "MEN JEG FORSTÅR AT DIN UNGE VEN, DU VED, DEN",
      "LILLE IRRITERENDE SØRGMODIGT GRIMME EN",
      "NOK HAR RAPSET DEM SOM EN ART AF MORSOMHED.",
      "NOK OM DET, VILLE DU VÆRE VENLIG NOK TIL AT LÅNE DIN KÆRE GAMLE ONKEL",
      "90 FORGÆNGERGLOBER SÅ HAN KAN KOMME AFSTED?",
      "JEG VILLE BYDE PÅ EN KRAFTCELLE TIL GENGÆLD."
    ],
    "explorer-reminder-1": [
      "HVAD? DU HAR IKKE DET HELE? FNYS!",
      "JAMEN, INTET MINDRE END 90 FORGÆNGERGLOBER",
      "OG JEG VIL IKKE HAVE EN CHANCE FOR AT KOMME AFSTED, KÆRE DRENG."
    ],
    "explorer-reminder-2": [
      "ÅH SE HER, AFTALEN ER PÅ 90 FORGÆNGERGLOBER FOR EN KRAFTCELLE.",
      "EN LIGEFREM LIGE HANDEL."
    ],
    "explorer-resolution": [
      "JEG SER I TO ER TILBAGE FOR AT LAVE HANDLEN. GODT, GODT, VÆLDIG GODT!",
      "EH, HAR DU ØH, DE FORGÆNGERGLOBER VI AFTALTE?",
      "JEG HÅBER DU GØR GOD BRUG AF DENNE KRAFTCELLE.",
      "FARVELLER, TA TA, VI SES!"
    ],
    "farmer-introduction": [
      "SKAL MÆLKE DE YAKOWER, SKAL MÆLKE DE YAKOWER...",
      "ÅH! DET ER DIG... JEG HVILER BARE MINE TRÆTTE KNOGLER.",
      "JEG HAR PRØVET AT FÅ DE YAKOWER",
      "TILBAGE I DERES INDHEGNING HELE DAGEN!",
      "NOGLE SÆRE VÆSENER PRØVEDE AT STJÆLE DEM TIDLIGERE.",
      "TROR I AT I KAN HJÆLPE EN GAMMEL MAND FÅ DEM TILBAGE I INDHEGNINGEN?"
    ],
    "farmer-reminder-1": [
      "HEY! MINE YAKOWER ER STADIG UDE I DET FRI!",
      "EH, KUNNE I IKKE SNART FÅ DEM INDSAMLET?"
    ],
    "farmer-reminder-2": [
      "DE FORBANDEDE YAKOWER GÅR STADIG FRIT RUNDT.",
      "KAN I IKKE SNART FÅ JAGTET DEM TILBAGE I INDHEGNINGEN?"
    ],
    "farmer-resolution": [
      "AH, GODT GJORT MIN DRENG. DU DIK FAKTISK INDFANGET DE FORHUTLEDE DYR.",
      "NU KAN JEG SOVE I FRED. TAG DEN HER KRAFTCELLE FOR JERES ARBEJDE."
    ],
    "finalbosscam-white-eco": [
      "LYS ECO! DET EKSISTERER!",
      "DE MÅ IKKE FÅ LOV TIL AT FÅ DET!"
    ],
    "fisher-accept": [
      "DER ER TO TYPER AF GODE FISK AT FANGE:",
      "ET-PUNDS FISK, OG FEM-PUNDS FISK.",
      "HEH. HVIS I MISTER 20 PUND GOD FISK",
      "TAGER JEG MIT NET TILBAGE FRA JER!",
      "DER ER GIFTIGE ÅL I DEN HER FLOD.",
      "FANG SELV EN AF DE SLYNGLER",
      "OG I FORGIFTER HELE DEN FORDØMTE FANGST!"
    ],
    "fisher-introduction": [
      "HVAD HAR DU I KURVEN?",
      "INTET AT TALE OM.",
      "DE MONSTRE DER PATRULJERER HAVET",
      "TOG EN BID AF MIN FISKERSKUDE.",
      "OG NU ÆDER DE MIN FANGST!",
      "HVAD END JEG PRØVER, SYNES JEG IKKA AT KUNNE FANGE EN ENKELT FISK I DEN HER FLOD.",
      "PYH! MÅSKE... ER DET DIN ÅNDE. ",
      "TROR I AT I KAN GØRE DET BEDRE?",
      "PRØV AT FANGE FLODFISK I ET LILLE NET!",
      "JEG VIL GIVE JER EN KRAFTCELLE",
      "HVIS I KAN FANGE 200 PUND AF DE KRÆ!",
      "OG JEG VIL LADE DIG OG REJE HER",
      "BRUGE MIN SPEEDBÅD FOR AT KOMME TIL DEN DISEDE Ø.",
      "VIL I PRØVE DENNE UDFORDRING?"
    ],
    "fisher-reject": [
      "JAMEN, HVIS I VIL HAVE FAT PÅ DEN KRAFTCELLE EN GANG",
      "SÅ VED I HVOR I FINDER MIG."
    ],
    "fisher-reminder-1": [
      "VIL I PRØVE AT SEJRE OVER FLODEN, HVA?"
    ],
    "fisher-resolution": [
      "I GJORDE DET! I FANGEDE 200 PUND AF FISK!",
      "IKKE DÅRLIGT FOR ET PAR LANDKRABBER!",
      "HER ER DEN KRAFTCELLE JEG LOVEDE",
      "OG I KAN BENYTTE MIN BÅD VED BYENS KAJ",
      "HVORNÅR END I HAR LYST!"
    ],
    "fishermans-boat-ride-to-village1-alt": [
      "DE TO KUNNE VISE SIG AT VÆRE BALLADE.",
      "BARE ROLIG, KÆRE BRODER. JEG VIL UDSENDE MI LURERHÆR FOR AT TAGE SIG AF DEM.",
      "VÆR SIKKER PÅ AT DE IKKE KOMMER FOR TÆT PÅ VORES NORDLIGE OPERATIONER.",
      "JEG TVIVLER AT DE NÅR SÅ LANGT.",
      "MEN HVIS DE GØR VENTER DER SIG EN OVERRASKELSE TIL DEM I KLIPPEBYEN.",
      "SÅ... DU VIL LADE KLAWW UD AF SIT BUR?",
      "JEG MENER DET ER RISIKOEN VÆRD.",
      "SÅMÆND."
    ],
    "gambler-introduction-1": [
      "ÅH, NEJ. IKKE ENDNU EN \"HELT\".",
      "JEG MISTEDE MINE SHORTS PÅ DENNE SÅKALDTE STORE HELTEKAMP",
      "MOD MONSTERET DEROPPE.",
      "TRO MIG, DE SMARTE HAR DERES PENGE PÅ MONSTERET.",
      "DET VÆDDEMÅL HAR SÅMÆND TØMT MIG!",
      "SÅ ALTSÅ, JEG HAR ET FORSLAG.",
      "BRING MIG 90 GLOBER SÅ JEG KAN KOMME PÅ BENENE IGEN OG UD AF DEN HER TØNDE,",
      "OG JEG VIL GIVE JER EN KRAFTCELLE TIL GENGÆLD.",
      "OG HVIS I ER PÅ, SÅ HAR JEG ENDNU ET VÆDDEMÅL I GANG.",
      "MIN STORE TILBAGEVENDEN!",
      "SLÅ REKORDTIDEN I VÆDDELØBET GENNEM DØD-MANDS KLØFT I FORGÆNGERRESERVOIRET, ",
      "OG JEG VIL BLIVE GODT UDBYTTE!",
      "FOR DET VIL JEG GIVE JER ENDNU EN KRAFTCELLE."
    ],
    "gambler-reminder-money": [
      "HEY. GLEM IKKE DE GLOBER JEG HAR BRUG FOR.",
      "90 VIL GIVE JER EN.  EK KRAFTCELLE, DET ER!"
    ],
    "gambler-reminder-race": [
      "JAMEN, HVAD VENTER I PÅ?",
      "DEN HER TØNDE ER BEGYNDT AT KLØ!",
      "SLÅ DEN BEDSTE TID GENNEM DØD-MANDS KLØFT,",
      "OG VI VIL BEGGE VÆRE VINDERE!"
    ],
    "gambler-resolution-money": [
      "HEH HEH HEH! OH, YEAH!",
      "DE HER GLOBER VIL HJÆLPE MIG VINDE MIN VEJ UD AF TØNDEN!",
      "HER ER DEN KRAFTCELLE JEG LOVEDE!"
    ],
    "gambler-resolution-race": [
      "ÅH, GODT KØRT, KNÆGT! JEG VIDSTE DEN REKORDTID VILLE SLÅS.",
      "SÅ HER ER EN KRAFTCELLE, OG SÅ KAN JEG FÅ INDSAMLET MIN STORE GEVINDST!"
    ],
    "geologist-introduction": [
      "I TO LIGNER ET PAR DYGTIGE FYRE.",
      "JEG HAR ET FORSKNINGSPROJEKT I GANG,",
      "OG I KUNNE MÅSKE HJÆLPE MIG.",
      "HEY, VI ER DEM SOM ER PÅ EN STOR FÆRD HER.",
      "VI SPØRGER DIG OM HJÆLP.",
      "JAMEN, MÅSKE KAN VI HJÆLPE HINANDEN. ",
      "JEG HAR STUDERET GRAVEVANERNE HOS LYN-MULDVARPER",
      "I FORGÆNGERRESERVOIRET VED SIDEN AF VORES BY I FLERE ÅR.",
      "MEN NU HAR DE SKRÆKKELIGE LURERE SKRÆMT MULDVARPERNE TIL OVERFLADEN!",
      "OG SIDEN DE ER SÅ BLINDE SOM FLAGERMUS, KAN DE IKKE FINDE TILBAGE UNDER JORDEN.",
      "HVIS I KUNNE HYRDE DEM TILBAGE I DERES UDGRAVEDE TUNNELER,",
      "VILLE I MÅSKE LIGE REDE DERES LIV.",
      "JEG HAR EN KRAFTCELLE DER SIGER I KAN GØRE DET.",
      "JA, LYN-MULDVARPER... VI BEKYMRER OS.",
      "MÅSKE FOR TO KRAFTCELLER!",
      "GODT FORSØGT. MEN JEG VILLE GERNE GIVE ENDNU EN KRAFTCELLE",
      "HVIS I TO FANDT MIG 90 FORGÆNGERGLOBER TIL MIT FORSKNINGSUDSTYR.",
      "ER DET RIMELIGT?"
    ],
    "geologist-reminder-moles": [
      "HYRDEDE I DE LYN-MULDVARPER TILBAGE NED UNDER JORDEN?",
      "I BURDE SKYNDE JER - DET DIREKTE SOLLYS ER IKKE GODT FOR DEM!"
    ],
    "geologist-reminder-money": [
      "JEG HAR BRUG FOR DE GLOBER FOR AT FORTSÆTTE MIN FORSKNING!"
    ],
    "geologist-resolution-moles": [
      "TAK FOR AT REDDE DE MULDVARPER, DET ER FORFÆRDELIGT GODT AF JER.",
      "HER ER EN KRAFTCELLE SOM KAN HJÆLPE JER.",
      "NU KAN JEG KOMME TILBAGE TIL MIN FORSKNING!"
    ],
    "geologist-resolution-money": [
      "ÅH, I HAR GLOBERNE!",
      "HER ER EN KRAFTCELLE SOM VI AFTALTE."
    ],
    "green-sagecage-daxter-sacrifice": [
      "LYS ECO! DET KUNNE VÆRE STADSET SOM KUNNE FÅ MIG TILBAGE!",
      "ELLER... DET KUNNE STOPPE DEN ROBOT.",
      "FORBLIV LODDEN, RED VERDEN... VALG...",
      "OKAY, FINT, VI VIL REDDE VERDEN.",
      "MEN GØR DET HURTIGT FØR JEG OMBESTEMMER MIG!"
    ],
    "green-sagecage-introduction": [
      "DET VAR PÅ TIDE AT I TO VALGTE AT DUKKE OP!",
      "DET ER OGSÅ GODT AT SE DIG!",
      "FÅR DE DIG TIL AT MOPPE GULVENE NU?",
      "DER ER IKKE TID TIL VITTIGHEDER, DAXTER. GOL OG MAIA HAR KIDNAPPET OS",
      "FOR AT TAPPE VORES ENERGIER FOR AT FORSYNE DERES AFSKYELIGE MASKINE. ",
      "DET SER UD TIL AT DE HAR KOMBINERET DE FUNKTIONELLE RESTER AF EN FORGÆNGERROBOT",
      "MED SKROTTEDE ARTEFAKTER FRA TVÆRS AF LANDET.",
      "OG SÅ HAR DE LAVET NOGLE AF DERES EGNE DIABOLSKE TILFØJELSER,",
      "FOR AT SKABE DEN ENE TING DER ER I STAND TIL AT ÅBNE SILOERNE MED MØRK ECO",
      "HVIS I KAN BEFRI OS FIRE, KAN VI BENYTTE VORES SAMLEDE KRÆFTER",
      "AT BRYDE KRAFTFELTET SOM OMKRANSER ROBOTTEN",
      "FØR DE BRUGER DEN TIL AT TILINTETGØRE VERDEN."
    ],
    "green-sagecage-outro-beat-boss-a": [
      "GØR NOGET!",
      "NEEJJ!"
    ],
    "green-sagecage-outro-beat-boss-b": [
      "NÅ, DET SER UD TIL AT JEG HAR VÆRET FOR HÅRD VED JER DRENGE!",
      "I HAR HVAD DER SKAL TIL FOR AT VÆRE HELTE!",
      "MEN DAXTER, NU KAN VI IKKE ÆNDRE DIG TILBAGE.",
      "BEKYMR DIG IKKE OM MIG, SKATTER.",
      "DU VED HVAD DE SIGER: STORE TING KOMMER I SMÅ PAKKER.",
      "JAK, DU HAR ET UTROLIGT TALENT FOR AT LEDE ECO!",
      "SAMOS, DU HAR NOK HAFT RET OM HAM HER ALLIGEVEL!",
      "OG KEIRA, UDEN DIN HJÆLP OG OPFINDSOMHED",
      "VILLE INTET AF DETTE HAVE VÆRET MULIGT.",
      "HM-HM-HM. MÅSKE HAR VI FUNDET EN NY VISMAND",
      "NU HVOR GOL OG MAIA ER TABTE...",
      "JA, GOL OG MAIA... DEN MØRKE ECO HAR SANDSYNLIGVIS TILINTETGJORT DEM.",
      "ØH, SANDSYNLIGVIS...",
      "OG HVAD SÅ? LAD DEM KOMME, VI KAN BESEJRE DEM IGEN! IKKE SANDT JAK?",
      "JEG SAGDE, IKKE SANDT, JAK?",
      "WOAH! LÆG DET PÅ IS, STORE GUT!"
    ],
    "green-sagecage-outro-beat-boss-enough-cells": [
      "HELLIGE YAKOW! HVAD KUNNE DET VÆRE?",
      "WOW, DET ER EN ÆLDGAMMEL FORGÆNGERDØR!",
      "DET SER UD TIL AT DEN KUN VIL ÅBNE HVIS VI UDFYLDER ALLE 100 HULLER MED KRAFTCELLER!",
      "ØH, VI ER HELTE, HUSKER DU? VI HAR 100 KRAFTCELLER!"
    ],
    "green-sagecage-outro-beat-boss-need-cells": [
      "HELLIGE YAKOW! HVAD KUNNE DET VÆRE?",
      "WOW, DET ER EN ÆLDGAMMEL FORGÆNGERDØR!",
      "DET SER UD TIL AT DEN KUN VIL ÅBNE HVIS VI UDFYLDER ALLE 100 HULLER MED KRAFTCELLER!",
      "ÅH DOG... SÅ GÅR DET LØS IGEN!"
    ],
    "green-sagecage-outro-big-finish": [
      "WOW! HVAD ER DET?",
      "DET ER SÅ SMUKT...",
      "VED FORGÆNGERNE..."
    ],
    "green-sagecage-outro-preboss": [
      "DU ER FOR SENT PÅ DEN, SAMOS.",
      "NÅR JEG BESIDDER UENDELIGT MØRK ECO",
      "VIL JEG HAVE NØGLEN TIL SELVE SKABELSEN!",
      "DET HER ER GALSKAB!",
      "AT FRIGØRE SÅ MEGET MØRK ECO VIL TILINTETGØRE ALT VI KENDER TIL!",
      "SE BARE HVAD DET HAR GJORT VED DIG!",
      "IT HAS GIVEN US A BEAUTY BEYOND ANYTHING YOU COULD UNDERSTAND.",
      "BEAUTY? HAVE YOU TWO LOOKED IN THE MIRROR LATELY?",
      "JUST WAIT UNTIL WE OPEN THE SILOS, LITTLE ONE.",
      "YOU THINK SHORT AND FUZZY IS BAD?",
      "AND TO THINK, YOU TWO TRAVELLED ALL THIS WAY FOR MY HELP.",
      "FOOLS! ENJOY YOUR FRONT ROW SEATS TO THE RECREATION OF THE WORLD!",
      "JAK! TAKE THE ELEVATOR UP AND STOP THAT ROBOT!"
    ],
    "green-sagecage-resolution": [
      "GOOD WORK, BOYS! YOU'RE REAL HEROES NOW.",
      "I'LL COMBINE MY GREEN ECO POWER WITH THE OTHER THREE SAGES",
      "AND TOGETHER WE'LL OPEN THE SHIELD DOOR SURROUNDING THE PRECURSOR ROBOT.",
      "JA JA DET LYDER SOM EN GOD START.",
      "OG SÅ EFTER I FOLK ÅBNER DET SKJOLD",
      "HVAD VIL I GØRE VED ROBOTTEN?",
      "INTET, DAXTER. VI ER NØDT TIL AT HOLDE SKJOLDET ÅBENT.",
      "DET ER OP TIL JER TO AT FINDE UD AF AT ØDELÆGGE ROBOTTEN.",
      "OH, GREAT. I GET TO HELP THE GUY THAT TURNED ME INTO A FURBALL",
      "DESTROY THE ONLY PERSON WHO CAN TURN ME BACK!",
      "FØRST, RED VERDEN!",
      "THEN WE'LL TRY TO CONVINCE GOL TO HELP DAXTER."
    ],
    "mayor-introduction": [
      "NO... (MUTTERS) DON'T TELL ME THAT YOU TWO HAVE PROBLEMS AS WELL!",
      "FIRST I HEAR OF MONSTER SIGHTINGS NEAR THE VILLAGE, AND NOW THIS.",
      "SEE THOSE GEARS UP THERE, BOYS? SEE THEM? SEE HOW THEY'RE NOT MOVING?",
      "THAT MEANS OUR VILLAGE HAS NO POWER!",
      "THE ECO BEAM COMING FROM THE JUNGLE TEMPLE HAS BEEN INTERRUPTED!",
      "AND BOYS, EVERYONE'S TOO FRIGHTENED TO GO OUT AND FIND OUT WHAT'S HAPPENED.",
      "HAR DU BETALT REGNINGEN?",
      "YEAH-HMM? OH-HUH-OH, YOU'RE FUNNY.",
      "NOW LOOK, IF YOU TWO FIX THE ECO BEAM, I'LL GIVE YOU A POWER CELL.",
      "OH OOH OOH AND-AND ANOTHER THING, UH...",
      "IF BY ANY CHANCE YOU'RE INTERESTED IN MAKING A CONTRIBUTION TO MY RE-ELECTION CAMPAIGN,",
      "J-JEG ER MULIGVIS VILLIG TIL AT GIVE ENDNU EN KRAFTCELLE VÆK!",
      "DET MINDSTE BIDRAG ER, ØH, PÅ BESKEDNE...",
      "90 FORGÆNGERGLOBER."
    ],
    "mayor-reminder-beams": [
      "ALLEREDE TILBAGE? OG UDEN AT HAVE FIKSET ECO STRÅLEN?",
      "(HULKER) JERES LANDSBY HAR BRUG FOR JER, DRENGE!"
    ],
    "mayor-reminder-donation": [
      "AH, HER FOR AT GIVE EN DONATION TIL MIN KAMPAGNE, OH HO HO HO.",
      "90 FORGÆNGERGLOBER KØBER JER EN KRAFTCELLE, MANGE TAK."
    ],
    "mayor-resolution-beams": [
      "OH HO HO, HVILKET FANTASTISK SYN! JEG TAKKER JER!",
      "OG HELE LANDSBYEN VIL TAKKE MIG -",
      "UH, DRENGE, I HAR GENETABLERET KRAFTEN TIL LANDSBYEN OG SIKRET MIT GENVALG!",
      "OG FOR DET, MIN DRENG, HAR DU FORTJENT EN KRAFTCELLE."
    ],
    "mayor-resolution-donation": [
      "SÅ ØH, DU ØH, VIL GIVE ET BIDRAG? GODT... E-E-EN BETYDELIG EN, HÅBER JEG.",
      "YOOH! EH HE HE, IT'S A, OH, THIS IS A SIZABLE CONTRIBUTION!",
      "I, WH-WH-WH-WHY I JUST HOPE THIS POWER CELL ADEQUATELY REPRESENTS MY GRATITUDE."
    ],
    "minershort-introduction-gnawers": [
      "WHY DON'T YOU TWO MAKE YOURSELVES USEFUL?",
      "LURERE ER BLEVET SET UDGRAVE DE MØRKE HULER DEROVRE.",
      "SER UD TIL AT DE LEDER EFTER FORGÆNGERARTEFAKTER.",
      "DE KAN FÅ ARTIFAKTERNE, JEG ER LIGEGLAD.",
      "VI ER LIGEGLADE!",
      "WILLARD, FODR DIN FUGL.",
      "ALT JEG BEKYMRER MIG OM ER ÆDELSTEN!",
      "BUT I AIN'T GONNA BE ABLE TO GET THE CAVE'S GEMS",
      "BECAUSE WHEN THEY'RE THROUGH, THEY'RE GONNA COLLAPSE THE PLACE!",
      "IF YOU TAKE OUT THE LURKERS CHEWIN' AT THE SUPPORT BEAMS,",
      "I KUNNE REDDE HULEN FOR MIG.",
      "MEN NU, SKRID!"
    ],
    "minershort-introduction-orbs": [
      "HEJ GORDY, ØHM, JEG TROR VI HAR GÆSTER.",
      "TROR DU, WILLARD? DAVS, FREMMEDE, ØH, PÅ GENNEMREJSE?",
      "UH, US, TOO. WELL, WE GOTTA BE MOVIN' ON, NOTHIN' TO SEE HERE.",
      "DUH, I THOUGHT YOU SAID THIS WAS A PRICELESS GEM WORTH-",
      "WILLARD!",
      "FAKTISK, VI VIL HAVE KRAFTCELLER, IKKE ÆDELSTEN.",
      "VI HAR FIRE AF DEM. ØHM, VIL I HAVE DEM?",
      "HVAD FUGLE-HJERNE HER PRØVER AT SIGE ER,",
      "VI HAR MÅSKE NOGLE KRAFTCELLER LIGGENDE OMKRING,",
      "OG VI VILLE MÅSKE VÆRE VILLIGE TIL AT GIVE DEM VÆK FOR...",
      "90 GLOBER HVER.",
      "HVOR HAR JEG HØRT DEN FØR?",
      "HEY, HOW DO YOU TWO GENIUSES EXPECT TO GET THAT BIG GEM OUTTA HERE ANYWAY?",
      "WELL, SMARTYPANTS, WE GOT TWELVE MORE YEARS OF DIGGIN' TO FIGURE THAT OUT.",
      "UHH... GORDY, WOULDN'T IT TAKE LESS TIME IF YOU DUG, TOO?"
    ],
    "minershort-introduction-switch": [
      "PSST, GUYS. DUH...",
      "BIRDIE AND I WAS EXPLORING A CAVE YOU'D LIKE!",
      "IT WAS FILLED WITH PRETTY ORANGE METAL,",
      "AND HIDDEN REAL GOOD BEHIND SOME TREES IN THE SNOWY MOUNTAINS!",
      "I TOLD GORDY, BUT HE JUST YELLED AT ME FOR NOT DIGGING!",
      "HVORFOR GRAVER DU IKKE?!",
      "UNDSKYLD!"
    ],
    "minershort-reminder-1-gnawers": [
      "VILLE I TAGE JER AF DE LURERE ",
      "SOM GUMLER PÅ DEN MØRKE HULES STØTTEPILLER SNART!",
      "DE PILLER KAN IKKE HOLDE DEN SLAGS MISBRUG FOREVIGT!"
    ],
    "minershort-reminder-1-orbs": [
      "GLEM IKKE VORES AFTALE. BRING OS 100 GLOBER.",
      "ØHM... DU SAGDE 90.",
      "WILLARD!",
      "FINT. 90 GLOBER PER KRAFTCELLE."
    ],
    "minershort-reminder-1-switch": [
      "FANDT DU DEN HULE BAG DE TRÆER I DE SNEDÆKKEDE BJERGE?",
      "JEG TAGER SNART DEROVER, FOR AT GEMME MIG FRA GORDY, FORDI HAN RÅBER AF MIG IGEN!",
      "WILLARD!!"
    ],
    "minershort-reminder-2-orbs": [
      "ØHM, GORDY?",
      "90 GLOBER PER KRAFCELLE, WILLARD! ARGH!"
    ],
    "minershort-resolution-1-orbs": [
      "ÅH, OKAY SÅ.",
      "HER ER EN KRAFTCELLE FOR DE GLOBER I HAR."
    ],
    "minershort-resolution-2-orbs": [
      "OOH! OH, JEG HAR DET DENNE GANG...",
      "HER ER EN...",
      "ØØHM.. HER ER EN...!",
      "EN KRAFTCELLE!",
      "JA, JA... DET HAN SAGDE.",
      "DET VAR DET. DU HAR TØMT OS.",
      "IKKE! FLERE! KRAFT! CELLER!"
    ],
    "oracle-intro-1": [
      "HVEM VÆKKER ORAKLET?",
      "VENT, EN AF JER HAR LYSET INDENI.",
      "SIDEN TIDERNES MORGEN HAR JEG VOGTET OG VENTET",
      "FOR DEN SANDE HELT AT VENDE TILBAGE.",
      "FORÆR MIG 120 FORGÆNGERGLOBER",
      "FOR HVER KRAFTCELLE JEG RUMMER."
    ],
    "oracle-intro-2": [
      "VOGT JER DET MØRKE LYS,",
      "FOR DET HAR FORVRÆNGET EN AF JERES SKÆBNER.",
      "BRING MIG 120 FORGÆNGERGLOBER",
      "FOR HVER KRAFTCELLE JEG RUMMER."
    ],
    "oracle-intro-3": [
      "SØG DE RENE LYS, FOR I DETS FLAMME OPHOLDER SVARENE SIG.",
      "I KAN SKAFFE MINE KRAFTCELLER",
      "VED AT BRINGE 120 FORGÆNGERGLOBER FOR HVER."
    ],
    "oracle-left-eye-1": [
      "I HAR VIST JER VÆRDIGE. HER ER EN KRAFTCELLE."
    ],
    "oracle-left-eye-2": [
      "FOR JERES OFRING BYDER JEG JER EN KRAFTCELLE."
    ],
    "oracle-left-eye-3": [
      "FOR JERES INDSATS, EN KRAFTCELLE ER BELØNNINGEN."
    ],
    "oracle-reminder-1": [
      "BRING TIL MIG 120 FORGÆNGERGLOBER",
      "OG JEG VIL BELØNNE JER MED EN KRAFTCELLE."
    ],
    "oracle-reminder-2": [
      "SKÆNK MIG 120 FORGÆNGERGLOBER",
      "OG EN KRAFTCELLE VIL VÆRE JERES BELØNNING."
    ],
    "oracle-reminder-3": [
      "I SKAL BRINGE 120 FORGÆNGERGLOBER",
      "TIL MIG FOR HVER KRAFTCELLE JEG RUMMER."
    ],
    "oracle-right-eye-1": [
      "FOR JERES FORÆRING, ENDNU EN KRAFTCELLE ER JERES."
    ],
    "oracle-right-eye-2": [
      "HER ER ENDNU EN KRAFTCELLE TIL JERES FÆRD."
    ],
    "oracle-right-eye-3": [
      "I HAR OPNÅET ENDNU EN KRAFTCELLE."
    ],
    "redsage-resolution": [
      "HE-HE-HEH... I ER ENDELIG KOMMET FOR AT REDE MIG.",
      "VED I HVOR LÆNGE JEG HAR VÆRET HERINDE?",
      "HVAD TOG JER SÅ LANG TID? OG ØH, HE-HE-HEH...",
      "HVAD ER JERES NAVNE?",
      "JEG ER DAXTER! HAN ER JAK, HAN ER MED MIG.",
      "GODT ARBEJDE, DAXTER. DU ER EN SAND HELT.",
      "I ER NØDT TIL AT STOPPE GOL FRA AT AFFYRE ROBOTTEN.",
      "JEG VIL BRUGE MIN ECO-KRAFT TIL AT HJÆLPE MED AT ÅBNE SKJOLDDØREN."
    ],
    "sage-bluehut-introduction-crop-dusting": [
      "JAMEN, SITUATIONEN HER STINKER VÆRRE END EN LURERS ARMHULE.",
      "FØR DEN BLÅ VISMANDS FORSVINDEN,",
      "SKREV HAN OM BETYDNINGSFULDE URO I ALLE DE OMKRINGLIGGENDE EGNE.",
      "AF SÆRLIG INTERESSE FOR MIG ER DEN MØRKE ECO INFEKTION",
      "AF NOGLE USKYLDIGE PLANTER I FORGÆNGERRESERVOIRET.",
      "KEIRA VIL TELEPORTERE JERES ANTI-TYNGDEKRAFT ZOOMER TIL DEN NÆRMESTE TRANS-PLATFORM.",
      "STYR ZOOMEREN TIL EN GRØN ECO VENTIL,",
      "OG BÆR SÅ DEN GRØNNE ECO TIL DE FORDÆRVEDE PLANTER.",
      "DET BURDE KURERE DEM.",
      "GLEM IKKE EN ENESTE PLANTE, ELLER DE INFICEREDE LANGSOMT VIL SMITTE DE RASKE IGEN.",
      "OG, DAXTER...",
      "BEGYND MED AT RYDDE OP HERINDE!",
      "OG GLEM IKKE HJØRNERNE!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "SÅ, JEG HÅBER I HAR PAKKET EN MIDDAG. FOR VI ER KUN LIGE BEGYNDT.",
      "IFØLGE DEN BLÅ VISMANDS NOTER,",
      "HAR LURERE HÆRGET SUMPEN PÅ DEN ANDEN SIDE AF BUGTEN.",
      "TILSYNELADENDE PLANLÆGGER DE AT BRUGE ET LUFTSKIB",
      "TIL AT LØFTE EN VIGTIG FORGÆNGERARTEFAKT FRA MUDDERET.",
      "I ER NØDT TIL AT TAGE DEROVER OG LØSNE DERES FORTØJRINGER.",
      "HVEM VED HVAD DE VIL MED ARTEFAKTET,",
      "MEN LIGESOM ORANGE STADS' ÅNDE, SÅ KAN DET IKKE VÆRE GODT."
    ],
    "sage-bluehut-reminder-1-crop-dusting": [
      "MINE ØJNE MÅ BEDRAGE MIG!",
      "FORDI JEG VED AT I TO ER DYBT INDE I FORGÆNGERRESERVOIRET,",
      "HVOR I REDDER DE MØRK ECO-INFICEREDE PLANTER."
    ],
    "sage-bluehut-reminder-1-prec-arm": [
      "HVAD LAVER I HER TILBAGE ALLEREDE?",
      "JEG KAN SE FRA BALKONEN",
      "AT LURERLUFTSKIBET STADIG HÆNGER OVER SUMPEN.",
      "I HAR TYDELIGT IKKE FÆRDIGGJORT JERES OPGAVE.",
      "KOM I GANG!"
    ],
    "sage-intro-sequence-a": [
      "JEG HAR BRUGT MIT LIV PÅ AT SØGE DE SVAR SOM MIN FADER,",
      "OG MIN FADERS FÆDRE IKKE LYKKEDES AT FINDE.",
      "HVEM VAR FORGÆNGERNE?",
      "HVORFOR SKABTE DE  VIDTSTRAKTE MONOLITTER SOM DÆKKER VORES PLANET?",
      "HVORDAN TÆMMEDE DE ECO, VORES VERDENS LIVSENERGI?",
      "HVAD VAR DERES FORMÅL? OG HVORFOR FORSVANDT DE?",
      "JEG HAR SPURGT PLANTERNE, MEN DE HUSKER DET IKKE.",
      "PLANTERNE HAR SPURGT STENENE, MEN STENENE ERINDRER DET IKKE.",
      "SELV IKKE STENENE ERINDRER DET IKKE...",
      "HVER KNOGLE I MIN KROP SIGER AT SVARENE HVILER",
      "PÅ SKULDRENE AF EN UNG DRENG",
      "UBEVIDST OM SIN SKÆBNE, UINTERESSERET I SØGEN EFTER SANDHED",
      "OG AFVISENDE OVERFOR MIN VEJLEDNING!",
      "OG HVORFOR VILLE HAN OVERHOVEDET HAVE LYST TIL AT LYTTE TIL GAMLE SAMOS DEN VISE?",
      "JEG ER KUN MESTER AF GRØN ECO, EN AF DE MEST VISE PÅ PLANETEN!",
      "SÅ DET SER UD TIL AT SVARET IKKE BEGYNDER MED OMHYGGELIG FORSKNING",
      "ELLER FORSIGTIG OVERVEJELSE.",
      "NEJ! SOM MED MANGE AF SKÆBNENS MYSTERIER",
      "BEGYNDER DET BLOT MED EN LILLE TRODSIG HANDLING.",
      "HEY! ØH, JAK? GODE GAMLE GRØNNE SAGDE AT VI IKKE SKULLE KOMME HER!"
    ],
    "sage-intro-sequence-d1": [
      "HVAD I DEN GRØNNE FORTABELSE VIL I TO?",
      "VI- VI- VI- VAR- DE VAR- JEG'- JEG VAR-",
      "FORTÆL MIG DET IKKE! I STEDET FOR AT LYTTE TIL MIN VISDOM",
      "TOG I TO UD FOR AT RODE RUNDT",
      "DET ENE STED JEG FORTALTE JER IKKE AT TAGE HEN: DEN DISEDE Ø!",
      "DET ER SANDT! OG SÅ-",
      "OG, DAXTER, SÅ TOG DU ENDELIG ET MEGET NØDVENDIGT BAD",
      "MEN I ET BADEKAR FYLDT MED MØRK ECO.",
      "SE, GAMLE MAND, VIL DU BLIVE VED MED AT KÆFTE OP",
      "ELLER VIL DU HJÆLPE MIG UD AF DET HER ROD!?",
      "JEG BLIVER VED MED AT KÆFTE OP! FOR I MIN PROFESSIONELLE MENING",
      "ER FORANDRINGEN EN FORBEDRING.",
      "OG DESUDEN... JEG KUNNE IKKE HJÆLPE JER SELV HVIS JEG HAVDE LYST.",
      "HVAD!?",
      "DER ER KUN EN PERSON SOM HAR STUDERET MØRK ECO LÆNGE NOK",
      "TIL AT HAVE EN CHANCE FOR AT GIVE DIG DIN TIDLIGERE FORM TILBAGE:",
      "GOL ACHERON, VISMANDEN.",
      "MEN HAN LEVER LANGT MOD NORD. LANGT, LANGT MOD NORD.",
      "INGEN HAR TALT MED HAM I ÅREVIS.",
      "JEG VILLE TELEPORTERE JER, MEN DET KAN JEG HELLER IKKE.",
      "INGEN AF DE TRE VISMÆND DER VEDLIGEHOLDER DE ANDRE TELEPORT PORTE",
      "HAVE SEEN FIT TO TURN THEIR ENDS ON FOR QUITE A WHILE!"
    ],
    "sage-intro-sequence-d2": [
      "THE ONLY OTHER WAY NORTH IS BY FOOT THROUGH THE FIRE CANYON",
      "BUT ITS VOLCANIC SOIL IS HOT ENOUGH TO MELT PRECURSOR METAL.",
      "YOU CAN'T JUST WALK THROUGH IT.",
      "BUT YOU COULD FLY OVER IT",
      "IF YOU HAD A ZOOMER EQUIPPED WITH A HEAT SHIELD.",
      "I JUST HAPPEN TO BE WORKING ON SUCH A THING AT THIS VERY MOMENT.",
      "ALL I WOULD NEED IS TWENTY POWER CELLS TO GIVE IT ENOUGH ENERGY",
      "TO WITHSTAND THE CANYON'S HEAT. ISN'T THAT RIGHT, DADDY?",
      "YES, KEIRA, THAT MIGHT WORK. BUT WHERE ARE A BOY",
      "AND A HALF!",
      "GOING TO GET TWENTY POWER CELLS?",
      "FROM THE VILLAGERS! MOST OF THEM HAVE A POWER CELL OR TWO",
      "STASHED AWAY SOMEWHERE.",
      "AND EVEN IF THEY AREN'T WILLING TO JUST GIVE THEM AWAY",
      "GREASING THEIR PALMS WITH A FEW PRECURSOR ORBS SHOULD DO THE TRICK.",
      "AND I BET THERE ARE EVEN MORE OF THEM OUT IN THE WILDS JUST WAITING FOR SOME",
      "BRAVE ADVENTURER TO FIND.",
      "WELL WE'VE GOT THE BRAVE ADVENTURER, AT LEAST.",
      "BRAVE ADVENTURER?",
      "YOU TWO COULDN'T FIND YOUR WAY OUT OF THE VILLAGE WITHOUT TRAINING!",
      "BEFORE YOU DO ANYTHING ELSE, YOU BETTER GO THROUGH THE WARP GATE AND GET",
      "SOME PRACTICE ON GEYSER ROCK.",
      "UH, WE WON'T FIND ANY MORE OF THAT DARK GOOEY ECO STUFF, WILL WE?",
      "'CAUSE I'D HATE TO FALL IN AGAIN AND TURN INTO YOU!",
      "GET IN THERE! BEFORE I TURN YOU BOTH INTO FERNS!"
    ],
    "sage-intro-sequence-e": [
      "GOOD TRAINING, BOYS, BUT THAT'S NOTHING COMPARED TO THE CHALLENGES THAT LIE AHEAD.",
      "AH, THEY'RE NO PROBLEM. WE GOT THE MOVES, EH JAK?",
      "WE'D LOVE TO STAY AND CHAT, BIG GREEN, BUT WE'RE UH...",
      "ITCHING TO GET ON WITH OUR ADVENTURES.",
      "FINE, FINE, \"ADVENTURE\" AWAY THEN.",
      "AND WHILE YOU'RE OUT \"ADVENTURING,\" WHY DON'T YOU MAKE YOURSELF USEFUL?",
      "MY DARN GREEN ECO COLLECTORS ARE CLOGGED UP AGAIN.",
      "HEAD OUT TO THE FAR SIDE OF THE BEACH AND CLEAR THEM OUT WHY DON'T YOU.",
      "FOLLOW THE LAMPS, THEY'LL TAKE YOU RIGHT THERE.",
      "NOW, ALL OF YOU...",
      "GET OUT OF HERE!"
    ],
    "sage-introduction-misty-cannon": [
      "OH, IT'S THE CONQUERING HEROES.",
      "GOOD, I WANTED TO TALK WITH YOU TWO ABOUT SOMETHING SERIOUS.",
      "THERE APPEARS TO BE QUITE A BIT OF LURKER ACTIVITY ON MISTY ISLAND.",
      "I CAN SEE THEM BOMBARDING THE PRECURSOR SILO FROM MY LOOKOUT TOWER.",
      "IF THE LURKERS OPEN IT UP AND RELEASE THE DARK ECO, WE COULD ALL END UP",
      "RUNNING AROUND LOOKING AS RIDICULOUS AS THIS ANNOYING LITTLE SPECIMEN.",
      "JAK, IT'S TIME FOR YOU TO PROVE YOUR WORTH.",
      "GET THE FISHERMAN TO LET YOU TAKE HIS BOAT BACK TO MISTY ISLAND",
      "GET TO THE TOP OF THE PRECURSOR SILO AND TAKE OUT THAT CANNON.",
      "AND... WHAT ABOUT ME?",
      "YOU? WHY DON'T YOU MOP MY FLOORS? THEY SEEM TO HAVE LOST THEIR SHINE LATELY."
    ],
    "sage-reminder-1-ecorocks": [
      "SOME \"BRAVE ADVENTURERS\" YOU TWO ARE.",
      "BACK ALREADY AND WITHOUT CLEARING MY BLOCKED ECO HARVESTERS!",
      "DE ER I DEN ANDEN ENDE AF STRANDEN, DRENGE.",
      "NU...",
      "KOM AFSTED!"
    ],
    "sage-reminder-1-generic": [
      "HVAD LAVER I TO HER? I HAR KRAFTCELLER AT SAMLE!",
      "LAD MIG VÆRE... INDTIL I HAR DEM!"
    ],
    "sage-reminder-1-misty-cannon": [
      "BOMBARDEMENTET BLIVER VÆRRE!",
      "FIND FISKERMANDEN I JUNGLEN, FÅ LOV TIL AT BRUGE HANS BÅD",
      "OG TAG TIL DEN DISEDE Ø FOR AT STOPPE KANONEN.",
      "OG DIG DAXTER, DU BURDE KOMME I GANG MED AT MOPPE. DET HER STED ER ET ROD!"
    ],
    "sage-reminder-2-generic": [
      "I TO FORSTÅR BARE IKKE SITUATIONENS ALVOR.",
      "DET HANDLER OM MERE END EN SØLLE DRENG SOM ER BLEVET LODDEN. DET HANDLER OM LIVET SOM VI KENDER DET.",
      "NU, KOM AFSTED OG OPFYLD JERES SKÆBNE."
    ],
    "sage-village3-introduction": [
      "OW! I ALWAYS WONDER IF I'M LOSING BODY PARTS IN THOSE THINGS!",
      "HOLY YAKOW! THE RED SAGE'S LAB LOOKS WORSE THAN THE BLUE'S!",
      "WELL, IT DEFINITELY LOOKS AS THOUGH THERE'S BEEN A STRUGGLE HERE.",
      "HA HA HA HA HA!",
      "I'D HARDLY CALL IT \"STRUGGLE.\"",
      "WOULD YOU, DEAR SISTER?",
      "CERTAINLY NOT. THE RED SAGE GAVE UP WITH SO LITTLE EFFORT.",
      "NO FUN AT ALL.",
      "GOL? IS THAT YOU?",
      "YOU'VE FINALLY GONE OFF THE DEEP END, EH?",
      "AND, MAIA! I TOLD YOU THE DARK ECO WOULD AFFECT YOU BOTH!",
      "HNG, NOBODY EVER LISTENS TO OLD SAMOS...",
      "WHAT HAVE YOU TWO DONE WITH THE BLUE AND RED SAGES?",
      "DON'T WORRY ABOUT YOUR COLORFUL FRIENDS, YOU OLD FOOL.",
      "THEY'RE PERFECTLY SAFE IN OUR CITADEL. OUR SPECIAL GUESTS.",
      "THEY HAVE GRACIOUSLY AGREED TO HELP US ON A LITTLE PROJECT.",
      "YOU WERE WRONG, SAMOS. DARK ECO CAN BE CONTROLLED!",
      "WE'VE LEARNED ITS SECRETS, AND NOW WE CAN RESHAPE THE WORLD TO OUR LIKING.",
      "YOU CAN'T CONTROL DARK ECO BY ITSELF! EVEN THE PRECURSORS COULDN'T-",
      "UNTIL NOW, WE'VE HAD TO SCRAPE BY WITH WHAT LITTLE DARK ECO",
      "WE COULD FIND NEAR THE SURFACE.",
      "BUT SOON, WE WILL HAVE ACCESS TO THE VAST STORES",
      "OF DARK ECO HIDDEN DEEP UNDERGROUND.",
      "NOT THE SILOS!",
      "YES, THE SILOS!",
      "THEY WILL BE OPENED, AND ALL THE DARK ECO IN THE WORLD WILL BE OURS!",
      "BUT THAT'S IMPOSSIBLE! ONLY A PRECURSOR ROBOT-",
      "OH, DON'T LOOK SO UPSET, SAMOS.",
      "WE'VE GOT BIG PLANS FOR YOU.",
      "AH HA HA HA HA HA HA! AHH...",
      "WAIT A MINUTE!",
      "THAT WAS GOL?",
      "THE SAME GOL WHO'S SUPPOSED TO CHANGE ME BACK?",
      "GOL IS THE GUY TRYING TO KILL US?!",
      "I'M DOOMED.",
      "WE MAY ALL BE DOOMED.",
      "IF THEY OPEN THE SILOS, THE DARK ECO WILL",
      "TWIST AND DESTROY EVERYTHING IT TOUCHES!",
      "WE SIMPLY MUST GET TO THEIR CITADEL, TO STOP THEM!",
      "THE FASTEST WAY THERE IS THROUGH THE LAVA TUBE",
      "AT THE BOTTOM OF THIS CRATER.",
      "A FEW MORE POWER CELLS, AND YOUR ZOOMER'S HEAT SHIELD",
      "SHOULD GET YOU ACROSS THE LAVA SAFELY.",
      "ALL RIGHT, MY BOY. YOU KNOW WHAT TO DO.",
      "TAKE THE FLEABAG AND GO ROUND UP MORE POWER CELLS."
    ],
    "sage-village3-introduction-dark-eco": [
      "GREAT BALLS OF ECO!",
      "THERE SEEMS TO BE A LARGE LURKER PRESENCE IN THE SPIDER CAVES!",
      "GREAT. SOUNDS LIKE A REAL CHEERY PLACE.",
      "LET ME GUESS. THERE ARE SPIDERS IN THE SPIDER CAVES, RIGHT?",
      "OF COURSE THERE ARE SPIDERS IN SPIDER CAVES!",
      "BUT THAT'S THE LEAST OF YOUR PROBLEMS!",
      "THE LURKERS ARE AFTER CRYSTALS OF CONCENTRATED DARK ECO.",
      "YOU'VE GOT TO DESTROY THE CRYSTALS BEFORE THOSE MONSTERS",
      "GET THEIR HANDS ON THEM!",
      "HOP TO IT!"
    ],
    "sage-village3-introduction-rams": [
      "I'M GLAD YOU TWO ARE HERE. THERE'S LURKER MOVEMENT IN THE MOUNTAINS.",
      "APPARENTLY THEY'VE DISCOVERED, AND ARE NOW TRYING TO REMOVE,",
      "SOME DARK ECO STORES FROZEN IN THE GLACIERS.",
      "WHILE YOU'RE UP THERE POKING AROUND FOR POWER CELLS",
      "STOP THOSE LURKERS, AND KEEP A LITTLE MORE DARK ECO OUT OF GOL'S HANDS."
    ],
    "sage-village3-reminder-1-dark-eco": [
      "YOU HAVE TO DESTROY THE DARK ECO CRYSTALS IN SPIDER CAVES!"
    ],
    "sage-village3-reminder-1-rams": [
      "WE CAN'T LET THE LURKERS GET THEIR HANDS ON THE DARK ECO CANISTERS.",
      "GET UP TO THOSE SNOWY PEAKS AND STOP THEM!"
    ],
    "sculptor-introduction": [
      "HEY... LITTLE FURRY DUDE!",
      "AWW... I THOUGHT FOR A MOMENT YOU WERE MY MUSE.",
      "YOUR WHAT?",
      "HAVEN'T YOU EVER SEEN A MUSE BEFORE?",
      "IT'S A LITTLE GLOWIN' SQUIRREL ABOUT YOUR SIZE, FULL OF SPUNK, AND CRAZY AS A LARK!",
      "OH, I GET IT! LIKE A SIDEKICK.",
      "AS A MATTER OF FACT, WITHOUT MY MUSE, I JUST CAN'T SCULPT.",
      "BUT WITH HER AROUND... I SEE BEAUTY IN EVERYTHING, YOU KNOW?",
      "RIGHT NOW I COULDN'T CHISEL MY WAY OUT OF A BOX.",
      "I THINK SHE RAN AWAY TO THAT MISTY ISLAND.",
      "AWW, I JUST HOPE SHE'S ALL RIGHT.",
      "IT'S WORTH A POWER CELL IF YOU BRING HER BACK TO ME!",
      "WAIT A MINUTE! WE ARE NOT GOING BACK TO MISTY ISLAND!",
      "ARE WE?"
    ],
    "sculptor-reminder-1": [
      "AW HEY DUDES! DID YOU FIND MY MUSE YET?"
    ],
    "sculptor-resolution": [
      "OH, MY MUSE! YOU SAVED HER! AW, YOU REALLY ARE THE BEST!",
      "HERE, TAKE THIS POWER CELL. I WON'T NEED IT NOW THAT I HAVE MY INSPIRATION BACK!"
    ],
    "sidekick-human-intro-sequence-b": [
      "CONTINUE YOUR SEARCH FOR ARTIFACTS AND ECO.",
      "IF THE LOCALS POSSESS PRECURSOR ITEMS, YOU KNOW WHAT TO DO.",
      "DEAL HARSHLY WITH ANYBODY WHO STRAYS FROM THE VILLAGE.",
      "WE WILL ATTACK IT IN DUE TIME."
    ],
    "sidekick-human-intro-sequence-c": [
      "WHAT ARE WE DOING HERE ANYWAY, JAK? THIS PLACE GIVES ME THE CREEPS!",
      "HUH?",
      "(GROAN) STUPID PRECURSOR JUNK!",
      "EEK! WHAT IS THAT DARK OOZE? IT SURE DON'T LOOK FRIENDLY.",
      "THE SAGE YAPS ON ABOUT THE PRECURSORS THAT BUILT THIS PLACE ALL THE TIME.",
      "\"WHERE DID THEY GO? WHY DID THEY BUILD THIS CRAP?\"",
      "NOW I LIKE PRECURSOR ORBS AND POWER CELLS AS MUCH AS THE NEXT GUY",
      "BUT IF YOU ASK ME, THEY MUST HAVE BEEN REAL LOSERS.",
      "WHOA! HOW DID YOU DO THAT?",
      "JAK, JEG TROR VI ER I PROBLEMER!",
      "MAND, DET STAK.",
      "JEG FORTALTE DIG VI IKKE BURDE VÆRE HER, OG DU LYTTEDE?",
      "HVAAAD?",
      "AAAAAAAAHHHHHHHH!!",
      "OKAY, OKAY. JEG HAR DET FINT, JEG HAR DET FINT...",
      "AAAAAAAAHHHHHHHH!!"
    ],
    "warrior-introduction": [
      "AV... MIT BANKENDE HOVED.",
      "JEG TVIVLER AT DET ER EN AF DINE VITALE ORGANER!",
      "DET SKAL BARE GÅS VÆK, HÅRDE FYR",
      "ÅH, JA DA, JEG VAR BARSK ENGANG.",
      "MÅSKE ENDDA DEN MEST BARSKE AF DEM ALLE.",
      "JEG VAR ENE MAND OM AT BESKYTTE LANDSBYEN FRA DE HÆSLIGE SKABNINGER I NÆSTEN ET ÅR!",
      "SÅ KOM DET RÆDSELSFULDE MONSTER OG BEGYNDTE BOMBARDEMENTET.",
      "SÅ, FYLDT MED MOD, RUSTNING SKINNENDE I SOLEN...",
      "BESTEG JEG BAKKEN FOR AT BEKÆMPE HAM...!",
      "MEN HAN SLOG MIG SOM MAN MØRNER EN YAKOW BØF.",
      "HAR DU PRØVET AT ANGRIBE HAM MED DIT MELODRAMA?",
      "FOR DET DRÆBER SNART MIG!",
      "EFTER MIT SIDSTE STORE NEDERLAG,",
      "HAR HAN FORSEGLET STIEN TIL HANS REDE MED EN 30-TONS TUNG STEN,",
      "SOM STOPPER ENHVER FRA AT UDFORDRE HAM IGEN.",
      "SÅ, VORES VISMAND, EN MESTER I BLÅ ECO OG ET MEKANISK GENI, UDTÆNKTE EN MASKINE",
      "I STAND TIL AT LØFTE STENEN AF VEJEN...!",
      "MEN AK, HAN FORSVANDT FØR HAN FIK MULIGHEDEN FOR AT TÆNDE DEN.",
      "OG HAN TOG ALLE SINE KRAFTCELLER MED SIG.",
      "I DET MINDSTE KUNNE JEG FJERNE NOK PONTONER FRA VORES BRO FOR AT UNDGÅ",
      "DET MONSTER AT KOMME HERNED OG SKADE MIG.",
      "JA, GODT, GODT GJORT, BARSKE FYR. MEN, ØH...",
      "VI FÅR BRUG FOR AT DU, ØH... SÆTTER DEM TILBAGE, ELLER NOGET.",
      "NÅH, VIRKELIG! OG FORSEGLE MIN UNDERGANG?",
      "(SUKKER)",
      "JAVEL. FINT.",
      "BRING MIG 90 FORGÆNGERGLOBER OG JEG SÆTTER PONTONERNE FRI.",
      "MEN JEG KÆMPER IKKE IMOD DET MONSTER IGEN!"
    ],
    "warrior-reminder-1": [
      "TAG ALT DEN TID I VIL FOR AT BRINGE DE GLOBER TIL MIG",
      "JEG OVERVEJER IKKE AT FIKSE BROEN I DEN NÆRE FREMTID."
    ],
    "warrior-resolution": [
      "ÅH.",
      "VIDUNDERLIGT.",
      "I HAR BRAGT MIG FORGÆNGERGLOBERNE.",
      "FINT SÅ.",
      "JEG VIL FIKSE BROEN.",
      "MEN BED MIG IKKE OM AT INVOLVERE MIG MED DET VÆSEN IGEN!"
    ],
    "yellowsage-resolution": [
      "HVEM SKULLE TRO JEG VILLE LEVE TIL AT SE DAGEN",
      "WHEN I NEEDED TO BE RESCUED BY A BOY AND HIS MUSKRAT!",
      "AHH... I'M GONNA GIVE GOL AND MAIA",
      "A LITTLE PAYBACK FOR THIS EMBARRASSMENT!",
      "THEN WE'LL SEE ABOUT COOKING UP SOME MUSKRAT STEW...",
      "(SYNK)"
    ]
  },
  "hints": {
    "ASSTLP01": [
      "HMM..."
    ],
    "ASSTLP02": [
      "SKAL FÅ VARMESKJOLDET TIL AT FUNGERE..."
    ],
    "ASSTLP03": [
      "VI HAR BRUG FOR KRAFTCELLER FOR AT FORSYNE VARMESKJOLDET..."
    ],
    "ASSTLP04": [
      "HVOR ER MIN SKRUENØGLE?"
    ],
    "ASSTLP05": [
      "ILD-SLUGTEN ER SÅ VARM..."
    ],
    "ASSTLP23": [
      "NU, HVORDAN FIK HAN LEVITATOREN TIL AT VIRKE?"
    ],
    "ASSTLP24": [
      "NU, SELV MED KRAFTCELLER,",
      "VIL VI HAVE NOK KRAFT?"
    ],
    "ASSTLP30": [
      "ØHM, LAD OS SE..."
    ],
    "ASSTLP31": [
      "HMM."
    ],
    "ASSTLP32": [
      "ÅH DOG..."
    ],
    "ASSTLP33": [
      "AHA!"
    ],
    "ASSTLP34": [
      "HUH... HVAD ER GOL OG MAIA UDE PÅ?"
    ],
    "ASSTLP35": [
      "HMM... VI ER NØDT TIL AT KOMME TIL FORGÆNGERNES BY."
    ],
    "ASSTLP36": [
      "HUH. VARMESKJOLDET SKAL BRUGE ENDNU MERE KRAFT",
      "FOR AT KUNNE MODSTÅ LAVAEN."
    ],
    "ASSTLP37": [
      "AW... WE'VE GOT TO SAVE THE OTHER SAGES..."
    ],
    "BIL-AM01": [
      "JEG ELSKER BARE MUDDERET."
    ],
    "BIL-AM02": [
      "FORBANDEDE SUMPROTTER."
    ],
    "BIL-AM03": [
      "I NEED A GOOD DRAUGHT OF MAMA'S MEDICINE."
    ],
    "BIL-AM04": [
      "GLADIOLA."
    ],
    "BIL-AM05": [
      "I NEED ME SOME BROWN MEDICINE."
    ],
    "BIL-AM06": [
      "I NEED ME SOME SUMMER COOLANT."
    ],
    "BIL-AM07": [
      "DARN, THIS HEAT'S GIVIN' ME THE PRICKLIES."
    ],
    "BIL-AM08": [
      "DARN... THIS HEAT'S GIVIN' ME A RASH."
    ],
    "BIL-AM1A": [
      "MM-MM! I JUST LOVE THE MUD!"
    ],
    "BIL-AM2A": [
      "FORDØMTE SUMPROTTER!"
    ],
    "BIL-AM2B": [
      "FØRDØMTE SUMPROTTER!"
    ],
    "BIL-LO01": [
      "FARTHY!"
    ],
    "BIL-LO02": [
      "SOIEE-SOIEE-SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO03": [
      "SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO1A": [
      "FARTHY!"
    ],
    "BIL-LO2A": [
      "SOIEE-SOIEE-SOIEE!"
    ],
    "BIL-LO2B": [
      "SOIEE! SOIEE!"
    ],
    "BIL-TA01": [
      "FÅ DEM!"
    ],
    "BIL-TA02": [
      "GODT SKUDT!"
    ],
    "BIL-TA03": [
      "DEROVRE!"
    ],
    "BIL-TA04": [
      "ØV, POKKERS."
    ],
    "BIL-TA05": [
      "RAT GOT A SNACK."
    ],
    "BIL-TA06": [
      "OG ENDNU EN..."
    ],
    "BIL-TA07": [
      "DER ER KUN EN TILBAGE..."
    ],
    "BIL-TA08": [
      "FIK DEN."
    ],
    "BIL-TA09": [
      "YEEHAW!"
    ],
    "BIL-TA1A": [
      "FÅ DEM!"
    ],
    "BIL-TA2A": [
      "GODT SKUDT!"
    ],
    "BIL-TA3A": [
      "DEROVRE!"
    ],
    "BIL-TA4A": [
      "FORDØMT!"
    ],
    "BIL-TA4B": [
      "POKKERS!"
    ],
    "BIL-TA5A": [
      "RAT GOT A SNACK!"
    ],
    "BIR-AM01": [
      "ER I NÆR ÆGGET ENDNU?"
    ],
    "BIR-AM02": [
      "SÅDAN, BARE EN SMULE LÆNGERE!"
    ],
    "BIR-AM03": [
      "ÅH, GODT, SÅ SKUB DET.  ÅH, GØR DET BLIDT!"
    ],
    "BIR-AM04": [
      "ÅH, DOG, DET VAR IKKE BLIDT!"
    ],
    "BIR-AM05": [
      "KOM NU, SKUB ÆGGET OVER SKRÆNTEN!"
    ],
    "BIR-AM06": [
      "ÅHH!"
    ],
    "BIR-AM07": [
      "OH, HERE, BIRDIE BIRDIE. HERE, BIRDIE BIRDIE."
    ],
    "BIR-AM08": [
      "HERE, BIRDIE BIRDIE."
    ],
    "BIR-AM09": [
      "PAS NU PÅ, DER SER IKKE SIKKERT UD DEROPPE!"
    ],
    "BIR-AM10": [
      "FORSIGTIGT, GØR DET ROLIGT!"
    ],
    "BIR-AM11": [
      "GODT ARBEJDE! MØD MIG NU HER VED ÆGGET."
    ],
    "BIR-AM12": [
      "YOU MUST BE A TRUE ANIMAL LOVER!"
    ],
    "BIR-AM13": [
      "DO YOU SEE ANY OTHER BIRDS UP THERE?"
    ],
    "BIR-LO01": [
      "(KYS) (FLØJTEN)"
    ],
    "BIR-LO02": [
      "ÅH DOG, DET ER EN FLOT EN."
    ],
    "BIR-LO03": [
      "OH LOOK, A MUCKY-MUCK."
    ],
    "BIR-am08": [
      "HERE, BIRDIE BIRDIE..."
    ],
    "BLU-AM01": [
      "EN SMULE HJÆLP VILLE VÆRE GODT!"
    ],
    "BLU-AM02": [
      "ÅH, DETTE ER NOGET AF ET ROD."
    ],
    "BLU-AM03": [
      "HMM, QUITE AN ENIGMA WE'RE FACING."
    ],
    "CHI-AM01": [
      "DET ER EN KATASTROFE. EN KATASTROFE, SIGER JEG!"
    ],
    "CHI-AM02": [
      "THEY WANT ME TO GO INTO THE JUNGLE - ME! HO HO OH...",
      "I'D SOONER WRESTLE AN ENRAGED FLUT-FLUT."
    ],
    "CHI-AM03": [
      "FIRST BLIVER FISKERMANDENS BÅD...",
      "DEN BLIVER ANGREBET AF ET UHYRE...",
      "OG NU, NU DETTE...",
      "HVAD KUNNE ELLERS GÅ GALT?"
    ],
    "CHI-AM04": [
      "JEG VILLE IKKE... JEG VILLE, JEG VILLE... ÅH, MÅSKE SKULLE JEG HÆVE AFGIFTEN...",
      "FOR AT BETALE FOR DETTE ROD."
    ],
    "CHI-AM05": [
      "PROBLEMER... PROBLEMER... PROBLEMER!"
    ],
    "CHI-AM06": [
      "(HULK) JEG BLIVER ALDRIG GENVALGT NU..."
    ],
    "CHI-AM07": [
      "(STØNNER) HVAD ER DER SKET MED LANDSBYENS ENERGISTRÅLE?"
    ],
    "CHI-AM08": [
      "I... THEY, I DON'T... (MUTTERS)"
    ],
    "CHI-LO01": [
      "...WINDMILL, MONSTERS, POWER, RE-ELECTION..."
    ],
    "CHI-LO02": [
      "...THE POLLS, I... MONSTERS, HM... RE-ELECTION, OH..."
    ],
    "EXP-AM01": [
      "I NEED TO SET OFF ON MY JOURNEY SOON.",
      "JEG HAR BRUG FOR FORGÆNGERGLOBER!"
    ],
    "EXP-AM02": [
      "LET'S SEE, NOW WHERE SHALL I GO FIRST? EH..."
    ],
    "EXP-AM03": [
      "ÅH JEG SAVNER DEN ÅBNE VEJ."
    ],
    "EXP-AM04": [
      "SÅ MANGE STEDER AT SE, OG SÅ KORT EN TID."
    ],
    "EXP-AM05": [
      "WELL IN MY DAY, YOU COULD WALK THE LANDS",
      "WITHOUT BEING ASSAULTED BY MONSTERS!"
    ],
    "EXP-LO02": [
      "JEG HAR BRUG FOR FLERE FORGÆNGERGLOBER."
    ],
    "EXP-LO1A": [
      "(MUTTERS)"
    ],
    "FAR-AM01": [
      "(SNORKER) HER, BERTA... HER, BERTA BERTA...",
      "DET ER EN GOD PIGE..."
    ],
    "FAR-AM02": [
      "GOTTA BRING IN THE CROPS 'FORE THE JUNE BUGS..."
    ],
    "FAR-AM2A": [
      "GOTTA BRING IN THE CROPS 'FORE THE JUNE BUGS GET..."
    ],
    "FAR-LO01": [
      "(SNORKER)"
    ],
    "FAR-LO1A": [
      "(SNORKER MERE)"
    ],
    "FIS-AM01": [
      "GRR, DE FORBANDEDE FISK...",
      "JEG FANGER MIG ALDRIG EN ENESTE."
    ],
    "FIS-AM02": [
      "DE MONSTRE DER BED MIN SKUDE",
      "VIL RUINERE MIG."
    ],
    "FIS-AM03": [
      "DRAT, THESE BLIGHTERS!",
      "IN ME BASKET, DARN FISHIES, COME ON YEAH...",
      "HEH HE HE HE HE..."
    ],
    "FIS-AM04": [
      "ÅH HVOR JEG ELSKER LUGTEN AF FISK OM MORGENEN."
    ],
    "FIS-AM05": [
      "OOH I COULD USE ME A SALTED FISH LIPS ON RYE."
    ],
    "FIS-AM06": [
      "I 'MEMBER THE BIG ONE THAT GOT AWAY..."
    ],
    "FIS-LO01": [
      "GRR!"
    ],
    "FIS-LO03": [
      "HA HA HA HA HA HAH!"
    ],
    "FIS-LO04": [
      "FORBANDEDE FISK... DE ENDER ALDRIG I MIT NET!"
    ],
    "FIS-LO05": [
      "HA HA HA AH HA HA HA HAH!"
    ],
    "FIS-TA01": [
      "TIL VENSTRE!"
    ],
    "FIS-TA02": [
      "MOD HØJRE!"
    ],
    "FIS-TA03": [
      "HER KOMMER EN STOR EN!"
    ],
    "FIS-TA04": [
      "DU GIK GLIP AF EN STOR KRABAT, KNØS!"
    ],
    "FIS-TA05": [
      "MIS IKKE SÅDAN EN IGEN!"
    ],
    "FIS-TA06": [
      "ROLIGT MIN DRENG."
    ],
    "FIS-TA07": [
      "YOUR SAILS ARE SAGGING IN THE WIND, BOY."
    ],
    "FIS-TA08": [
      "MISSEDE."
    ],
    "FIS-TA09": [
      "SER UD TIL AT DU KUNNE BRUGE ET STØRRE NET..."
    ],
    "FIS-TA10": [
      "MISSEDE IGEN!"
    ],
    "FIS-TA11": [
      "HOLD DIG ROLIG! DU ER DER NÆSTEN..."
    ],
    "FIS-TA1A": [
      "VENSTRE!"
    ],
    "FIS-TA2A": [
      "HØJRE!"
    ],
    "GAM-AM01": [
      "HEY, TYVE-TIL-EN ODDS ER IKKE SÅ DÅRLIGE!"
    ],
    "GAM-AM02": [
      "NEJ, DET VAR EN SIKKER CHANCE!"
    ],
    "GAM-AM03": [
      "HEH HEH HEH... JEG RAMMER DEN STORE GEVINST NÆSTE GANG!"
    ],
    "GAM-AM04": [
      "HEH! HVIS JEG HAVDE EN GLOBE FOR HVER MULIGHED JEG HAR GÅET GLIP AF...!"
    ],
    "GAM-AM05": [
      "HEY! TØNDER KUNNE KOMME PÅ MODE IGEN!"
    ],
    "GAM-AM06": [
      "ÅH... JEG HAR BRUG FOR HELDET MED MIG."
    ],
    "GAM-AM07": [
      "AW, WHAT ARE THE ODDS OF MOVIN' TO A TOWN UNDER ATTACK?"
    ],
    "GAM-AM08": [
      "I THOUGHT I HAD A GOOD TIP!"
    ],
    "GAM-AM09": [
      "ENDNU EN DAG, ENDNU ET VÆDDEMÅL."
    ],
    "GAM-AM10": [
      "JEG VÆDDER PÅ AT INGEN KAN BEKÆMPE DET MONSTER."
    ],
    "GAM-AM11": [
      "HUH-HUH... JEG BURDE INDLØSE OG KOMME VIDERE."
    ],
    "GAM-AM12": [
      "EH, NOGLE GANGE KAN MAN IKKE VINDE."
    ],
    "GAM-AM13": [
      "HEY, HVAD GRINER DU AF? SYNES DU AT JEG ER MORSOM?"
    ],
    "GEO-AM01": [
      "MMM, INTERESSANTE STRATA..."
    ],
    "GEO-AM02": [
      "STAKKELS SMÅ MULDVARPER..."
    ],
    "GEO-AM03": [
      "INTERESSANT..."
    ],
    "GEO-AM04": [
      "HELD OG LYKKE, DRENGE!"
    ],
    "GEO-AM05": [
      "KLAMME LURERE..."
    ],
    "GEO-AM06": [
      "STEN HAR OGSÅ FØLELSER..."
    ],
    "GEO-AM07": [
      "HOLD UD, SMÅ NOGEN... "
    ],
    "GEO-AM08": [
      "NU KAN JEG KOMME TILBAGE TIL MIN FORSKNING!"
    ],
    "GEO-LO01": [
      "I'VE GOT TO GET BACK TO MY RESEARCH."
    ],
    "GEO-LO02": [
      "HM, THIS STONE IS VERY OLD..."
    ],
    "GOL-AM01": [
      "YOU JUST WON'T GIVE UP, WILL YOU?"
    ],
    "GOL-AM02": [
      "SOON, THE DARK ECO WILL BE OURS!"
    ],
    "GOL-AM03": [
      "FÆRDIGGØR DEM!"
    ],
    "GOL-AM04": [
      "FYR!"
    ],
    "GOL-AM05": [
      "SKYD DEM!"
    ],
    "GOL-AM06": [
      "HVAD? DEM IGEN!"
    ],
    "GOL-AM07": [
      "DET ER FOR SENT!"
    ],
    "GOL-AM08": [
      "DU ER MIN!"
    ],
    "GOL-AM09": [
      "JEG HAR DIG NU!"
    ],
    "GOL-AM10": [
      "AH HA HA HA HA!"
    ],
    "GOL-AM11": [
      "INGEN NÅDE!"
    ],
    "GOL-AM12": [
      "TAG DEN!"
    ],
    "GOL-AM13": [
      "GODT FORSØGT!"
    ],
    "GOL-AM14": [
      "STÅ STILLE!"
    ],
    "GOL-AM15": [
      "YNKELIGT!"
    ],
    "GOL-AM16": [
      "NEEJJ!"
    ],
    "GOL-AM17": [
      "AHHH!"
    ],
    "GOL-AM18": [
      "WE'LL OPEN THE SILO ALL THE WAY AND DESTROY YOU TWO!"
    ],
    "GOL-AM19": [
      "LYS ECO! DET EKSISTERER!"
    ],
    "GOL-AM20": [
      "WE'RE NOT GONNA TAKE IT!"
    ],
    "MAI-AM01": [
      "FINISH THEM BOTH OFF ONCE AND FOR ALL!"
    ],
    "MAI-AM02": [
      "TAKE THEM OUT!"
    ],
    "MAI-AM03": [
      "HA HA HA!"
    ],
    "MAI-AM04": [
      "ECO BESKYTTER DIG IKKE NU!"
    ],
    "MAI-AM05": [
      "GØR NOGET!"
    ],
    "MAI-AM06": [
      "ARGH!"
    ],
    "MAI-AM07": [
      "NEEEEJJ!"
    ],
    "MAI-AM08": [
      "WE'LL OPEN THE SILO ALL THE WAY AND DESTROY YOU TWO!"
    ],
    "MAI-AM09": [
      "THEY MUST NOT BE ALLOWED TO GET IT!"
    ],
    "MIN-LO01": [
      "ONE OF THESE DAYS I'LL BE RICH...",
      "YOU MEAN WE'LL BE RICH!",
      "JA. NUVEL."
    ],
    "MIN-LO03": [
      "GRAV, WILLARD, GRAV!",
      "JA, MEN DU GRAVER JO IKKE!",
      "DET' FORDI JEG GØR ALT TÆNKNINGEN!"
    ],
    "MIN-LO04": [
      "ØHM, GORDY? KAN JEG TAGE EN PAUSE?",
      "ÅH, JEG KNÆKKER NOGET, GANSKE RIGTIGT. SÅ GRAV!"
    ],
    "MIN-LO05": [
      "JEG SULTER, GORDY!",
      "SPIS DIN FUGL!"
    ],
    "MIN-LO06": [
      "ØHM, GORDY? JEG HAR BRUG FOR EN SKARPERE HAKKE.",
      "HVAD DU HAR BRUG FOR ER EN SKARPERE HJERNE!"
    ],
    "MSH-AM01": [
      "AH-HA-HA-HA-HA! JEG BLIVER RIG!"
    ],
    "MSH-AM02": [
      "GRAV, GRAV, GRAV!"
    ],
    "MSH-AM03": [
      "WILLARD! ARBEJD HÅRDERE, IKKE SMARTERE!"
    ],
    "MSH-AM04": [
      "AH-HAH, JEG BLIVER DEN RIGESTE MAND I VERDEN! AH HA HA..."
    ],
    "MSH-AM05": [
      "OH HO HO! INGEN HAR SET SÅ STOR EN ÆDELSTEN! AH HA HA!"
    ],
    "MSH-AM06": [
      "DEN NEMME VEJ, HER KOMMER JEG!"
    ],
    "MSH-AM07": [
      "MINE ÆDELSTEN! ALLESAMMEN MINE ÆDELSTEN!"
    ],
    "MSH-AM08": [],
    "MSH-AM09": [
      "(GRINER) JEG KAN IKKE VENTE MED AT INDLØSE DENNE SNUT!"
    ],
    "MSH-AM10": [
      "DETTE LIGNER EN SJÆLDEN CRYSTITE ZLARCONIA! OH-HO-HO!"
    ],
    "MSH-AM11": [
      "HOV, VENT LIGE! DE ER ALLE MINE! MINE, SIGER JEG JER!"
    ],
    "MSH-AM12": [
      "SÅ, WILLARD. HVAD VIL DU GØRE MED",
      "DIN KVARTE AF DIN HALVDEL?"
    ],
    "MSH-AM1A": [
      "JEG BLIVER JO RIG!"
    ],
    "MSH-AM2A": [
      "GRAV, GRAV, GRAV!"
    ],
    "MSH-AM3A": [
      "ARBEJD HÅRDERE, IKKE SMARTERE!"
    ],
    "MTA-AM01": [
      "ØHM, ER VI NÆSTEN FÆRDIGE?"
    ],
    "MTA-AM02": [
      "IH, KAN VI TAGE EN PAUSE?"
    ],
    "MTA-AM03": [
      "ØV, JEG ER SULTEN..."
    ],
    "MTA-AM04": [
      "ØHM... JEG TROR FUGLS BUR SKAL RENSES..."
    ],
    "MTA-AM05": [
      "IH, DET ER EN VÆLDIG STOR ÆDELSTEN!"
    ],
    "MTA-AM06": [
      "ØHM... JEG HAR ALTID GERNE VILLE VÆRE TRÆHUGGER..."
    ],
    "MTA-AM07": [
      "ØHM, GORDY LOVEDE AT GIVE MIG HALVDELEN AF, HVAD JEG KUNNE BÆRE!"
    ],
    "MTA-AM08": [
      "EH HEH... FUGLEN ER MIN BEDSTE VEN..."
    ],
    "MTA-AM09": [
      "JEG ELSKER MIN LILLE FUGL..."
    ],
    "RED-AM01": [
      "ER DER NOGEN?"
    ],
    "RED-AM02": [
      "JAMEN..."
    ],
    "RED-AM03": [
      "HVAD AFHOLDT DIG?"
    ],
    "SAGELP03": [
      "DE TO KUNNE IKKE TØMME DERES ØRER..."
    ],
    "SAGELP04": [
      "HAN VIL BARE ALDRIG VÆRE SOM SIN ONKEL...",
      "JEG ER LIGEGLAD MED HVAD DE ANDRE SIGER."
    ],
    "SAGELP05": [
      "HALLO, BLÅ VISMAND, HALLO?",
      "HVOR I HELE BLÅ VERDEN KUNNE HAN VÆRE..."
    ],
    "SAGELP06": [
      "MIG, MIG, MIG..."
    ],
    "SAGELP11": [
      "NOGEN? NOGEN SOM HELST? KOM IND?"
    ],
    "SAGELP20": [
      "HMM..."
    ],
    "SAGELP21": [
      "LURERNE MÅ STOPPES."
    ],
    "SAGELP22": [
      "JEG SER..."
    ],
    "SAGELP23": [
      "NEJ..."
    ],
    "SAGELP24": [
      "HVAD KUNNE DER HAVE VÆRET SKET DEM?"
    ],
    "SAGELP31": [
      "DET ER IKKE GODT."
    ],
    "SAGELP32": [
      "MØRKE ECO KRYSTALLER?"
    ],
    "SAGELP33": [
      "MAIA AND GOL HAVE GOTTEN IN OVER THEIR HEADS!"
    ],
    "SAGELP34": [
      "HMM, KRAFTEN AF MØRK ECO KAN IKKE STYRES!"
    ],
    "SAGELP35": [
      "MØRK ECO I GLETSJERNE?"
    ],
    "SAGELP36": [
      "AH! THERE'S LURKER TROOPS IN THE MOUNTAINS!"
    ],
    "SAGELP37": [
      "WHAT IS GOL PLANNING..."
    ],
    "SAGELP38": [
      "COULD HE ACTUALLY HAVE...?"
    ],
    "SCU-AM01": [
      "AW... I JUST CAN'T DO IT ANYMORE."
    ],
    "SCU-AM02": [
      "AW, I WISH I HAD SOME INSPIRATION."
    ],
    "SCU-AM03": [
      "JEG ER LIGESÅ INSPIRERET SOM EN STEN."
    ],
    "SCU-AM04": [
      "ÅH... HVOR ER MIN MUSE?"
    ],
    "SCU-AM05": [
      "JEG KAN IKKE ARBEJDE SÅDAN HER!"
    ],
    "SCU-AM06": [
      "ÅH MAND... VIL HUN NOGEN SINDE KOMME TILBAGE TIL MIG?"
    ],
    "SCU-LO01": [
      "ÅH, MAND..."
    ],
    "SKSP009F": [
      "TAG DEN! TAG DEN! HA HA HA!"
    ],
    "WAR-LO1A": [
      "(HULK)"
    ],
    "WAR-LO1B": [
      "(HULKER)"
    ],
    "WAR-LO1C": [
      "(BLOWS NOSE AND SPUTTERS)",
      "(FORTSÆTTER MED AT GRÆDE)"
    ],
    "YEL-AM01": [
      "TIDEN LØBER UD!"
    ],
    "YEL-AM02": [
      "HEY! FÅ MIG UD HERFRA!"
    ],
    "YEL-AM03": [
      "WHEN I GET OUTTA HERE, SOME SHOOTIN'S GONNA START!"
    ],
    "asstv100": [
      "OKAY, YOU HAVE ENOUGH CELLS TO INCREASE THE POWER ON THE HEAT SHIELD.",
      "RIDE THE WOODEN MINECART DOWN THE SHAFT BY THE LAVA GEYSER.",
      "I'LL MEET YOU BY THE ENTRANCE TO THE LAVA TUBE,",
      "SO I CAN MODIFY THE ZOOMER. HURRY!"
    ],
    "asstv101": [
      "HAHA, OKAY! YOU HAVE ENOUGH CELLS TO INCREASE",
      "THE POWER ON THE HEAT SHIELD.",
      "MEET ME BACK IN THE VOLCANIC CRATER.",
      "I'LL BE WAITING BY THE LAVA TUBE DOWN THE SHAFT BY THE LAVA GEYSER.",
      "BRING MIG DE KRAFTCELLER!"
    ],
    "asstv102": [
      "SKYND DIG MED DE KRAFTCELLER!",
      "I'M WAITING BY THE WOODEN MINECART SHAFT NEAR THE LAVA GEYSER."
    ],
    "asstv103": [
      "DON'T FORGET TO TURN ON THE TELEPORT GATE TO LET US THROUGH.",
      "YOU'VE GOT TO GO INTO THE RED SAGE'S LAB",
      "IN THE CENTER OF THE VOLCANIC CRATER TO TURN IT ON.",
      "WE CAN'T COME THROUGH UNTIL IT'S BACK ONLINE."
    ],
    "asstv104": [
      "HEY, WE'RE STILL BACK IN ROCK VILLAGE!",
      "TÆND FOR TELEPORT PORTEN!"
    ],
    "asstv105": [
      "WE WANNA JOIN YOU IN THE VOLCANIC CRATER!",
      "GO INTO THE RED SAGE'S LAB AND TURN ON THE GATE."
    ],
    "asstva73": [
      "HEY GUYS! BY MY CALCULATIONS, IT'S GOING TO TAKE",
      "72 POWER CELLS TO FUEL THE HEAT SHIELD",
      "AGAINST THE LAVA ON THE WAY TO GOL AND MAIA'S CITADEL."
    ],
    "asstva74": [
      "YOU DON'T HAVE ENOUGH POWER CELLS TO GET THROUGH THIS LAVA!",
      "YOU CAN'T GET THROUGH TO GOL AND MAIA'S CITADEL",
      "UNTIL YOU'VE COLLECTED 72 POWER CELLS!"
    ],
    "asstvb02": [
      "WOW, DID YOU SEE THAT?",
      "BLUE ECO VENTS HAVE BEEN ACTIVATED ALL OVER THE WORLD!",
      "I KNEW THERE WAS A WAY TO TURN THEM ON.",
      "THERE MUST BE PLACES TO TURN ON THE OTHER ECO VENTS AS WELL."
    ],
    "asstvb03": [
      "GOOD! YOU STOPPED ALL THE MINE-DROPPING LURKERS!",
      "THEY'VE BEEN THREATENING THE WATERS AROUND OUR VILLAGE FOR WEEKS.",
      "BRING YOUR ZOOMER BACK TO THE TRANS-PAD AND I'LL TELEPORT IT BACK!"
    ],
    "asstvb04": [
      "GOOD, YOU'VE COLLECTED ENOUGH POWER CELLS TO FUEL MY HEAT SHIELD!",
      "MEET ME BY THE ENTRANCE TO THE FIRE CANYON",
      "BY CLIMBING THE CLIFF BEHIND THE FARMER'S HOUSE.",
      "BRING THE POWER CELLS, AND HURRY!",
      "MY FATHER SAYS HE'S SEEN MORE LURKERS AROUND!"
    ],
    "asstvb08": [
      "SKYND DIG MED DE KRAFTCELLER.",
      "I'M WAITING AT THE HEAD OF FIRE CANYON",
      "AT THE TOP OF THE CLIFF BEHIND THE FARMER'S HOUSE!"
    ],
    "asstvb09": [
      "YOU DON'T HAVE ENOUGH POWER CELLS TO FUEL MY HEAT SHIELD.",
      "YOU CAN'T CROSS FIRE CANYON UNTIL YOU COLLECT ENOUGH POWER CELLS."
    ],
    "asstvb20": [
      "GOOD FLYING! THOSE LURKERS WERE NO MATCH FOR YOUR ZOOMER!",
      "DET ER EN MERE KRAFTCELLE!"
    ],
    "asstvb21": [
      "GODT ARBEJDE! ER I FYRE IKKE STOLTE",
      "AT I REDDEDE VORES LILLE FLUT-FLUT VEN?",
      "HUN BLIVER SIKKERT NYTTIG EN ANDEN GANG.",
      "NOW, GO BACK TO THE TRANS-PAD, AND I'LL BRING HER HOME."
    ],
    "asstvb22": [
      "WOW! YOU RAISED A PIECE OF THE UNDERWATER RUINS TO THE SURFACE!",
      "IT SEEMS YOU CAN USE ECO IN WAYS WE'VE NEVER SEEN BEFORE!",
      "A POWER CELL SURFACED WITH THE ROOM. CLIMB UP THERE AND GET IT."
    ],
    "asstvb23": [
      "GREAT WORK! THE PEOPLE OF ROCK VILLAGE ARE BREATHING",
      "A COLLECTIVE SIGH OF RELIEF!",
      "BUT THERE'S NO TIME TO CELEBRATE! USE YOUR ZOOMER",
      "TO NAVIGATE THE MOUNTAIN PASS UP AHEAD.",
      "BE CAREFUL, IT LOOKS LIKE THE LURKERS HAVE RIGGED",
      "THE WHOLE PASS WITH EXPLOSIVES!",
      "WHEN YOU REACH THE VOLCANIC CRATER,",
      "BE SURE TO VISIT THE RED SAGE'S LAB",
      "AND ACTIVATE THE TELEPORT GATE SO THAT FATHER AND I CAN JOIN YOU."
    ],
    "asstvb24": [
      "OH MY! THOSE LURKERS MUST BE HEADED",
      "FOR A DETONATOR AT THE END OF THE CANYON!",
      "IF THEY REACH IT BEFORE YOU DO,",
      "THEY'LL BLOW UP THE ENTIRE PASS!",
      "YOU'VE GOTTA BEAT THEM THERE AND DESTROY THE DETONATOR,",
      "OR IT'S ALL OVER!"
    ],
    "asstvb25": [
      "GOOD WORK! YOU BEAT THEM TO THE DETONATOR!",
      "THE RED SAGE'S LAB IS JUST AHEAD.",
      "GO TURN ON THE TELEPORT GATE SO WE CAN JOIN YOU."
    ],
    "asstvb28": [
      "HEY! DON'T FORGET ABOUT THE SAGE AND ME!",
      "YOU HAVE TO TURN ON THE TELEPORT GATE TO LET US THROUGH!",
      "IT'S IN THE BLUE SAGE'S LAB, BY THE END OF FIRE CANYON.",
      "IF YOU DON'T LET US THROUGH, THEN WE CAN'T HELP YOU!"
    ],
    "asstvb29": [
      "HEY! WE'RE STILL WAITING!",
      "TURN ON THE TELEPORT GATE!"
    ],
    "asstvb30": [
      "HEY! WE CAN'T COME THROUGH UNTIL THE TELEPORT GATE'S ON!"
    ],
    "asstvb40": [
      "THIS DEVICE IS A COMMUNICATOR. WITH IT, MY FATHER AND I",
      "CAN GIVE YOU ADVICE AT ANY TIME DURING YOUR QUEST."
    ],
    "asstvb41": [
      "THESE FLOATING EGG-SHAPED THINGS ARE PRECURSOR ORBS.",
      "COLLECT ENOUGH OF THEM, AND SOME OF THE VILLAGERS WILL GIVE YOU",
      "A POWER CELL IN EXCHANGE."
    ],
    "asstvb42": [
      "THIS IS A POWER CELL, THE MOST IMPORTANT PRECURSOR ARTIFACT YOU CAN FIND!",
      "YOU NEED TO COLLECT 20 OF THESE SO I CAN POWER THE HEAT SHIELD",
      "FOR YOUR A-GRAV ZOOMER."
    ],
    "asstvb44": [
      "HEY, YOU FOUND ONE OF MY SCOUT FLIES!",
      "I SENT 7 OF THEM TO EACH AREA TO LOOK FOR POWER CELLS",
      "BUT THE LURKERS MUST HAVE CAPTURED THEM ALL!"
    ],
    "asstvb45": [
      "WOW! THAT LAST SCOUT FLY HAD A POWER CELL!",
      "I'LL BET IF YOU COLLECT ALL 7 IN EACH AREA",
      "YOU CAN FIND EVEN MORE POWER CELLS."
    ],
    "asstvb46": [
      "BE CAREFUL IN THE OCEAN, THE WATERS ARE CHOCK-FULL OF",
      "LURKER SHARKS AND I'VE NEVER SEEN ANYONE DEFEAT ONE.",
      "STAY CLEAR OF THEM IF YOU KNOW WHAT'S GOOD FOR YOU!"
    ],
    "asstvb47": [
      "REMEMBER, THAT'S A POWER CELL.",
      "YOU NEED TO COLLECT AS MANY OF THOSE AS YOU CAN."
    ],
    "asstvb48": [
      "THAT'S A BLUE ECO VENT! MORE CONCENTRATED THAN THE FLOATING CLUSTERS,",
      "THIS VENT WILL GIVE YOU A FULL CHARGE OF BLUE ECO,",
      "LETTING YOU USE IT FOR THE MAXIMUM TIME."
    ],
    "asstvb71": [
      "YOU DON'T HAVE ENOUGH POWER CELLS TO POWER THE BLUE SAGE'S MACHINE.",
      "WE CAN'T LIFT THAT BOULDER UNTIL YOU COLLECT 45 POWER CELLS."
    ],
    "asstvb72": [
      "UNTIL WE FIND OUT WHY THE BLUE SAGE DISAPPEARED,",
      "YOU'RE GOING TO NEED TO COLLECT 45 POWER CELLS TO FUEL HIS MACHINE.",
      "FÅ FAT PÅ DEM!"
    ],
    "asstvb75": [
      "THIS GONDOLA SEEMS TO BE MALFUNCTIONING.",
      "I'LL TRY TO WORK ON IT AND GET IT RUNNING AGAIN."
    ],
    "asstvb76": [
      "I'VE REACTIVATED THE GONDOLA. IT CAN TAKE YOU TO SNOWY MOUNTAIN!",
      "USE IT WHENEVER YOU WANT."
    ],
    "sagevb01": [
      "WELL, I SEE THAT YOU TWO HAVE FINALLY",
      "DECIDED TO UNBLOCK MY COLLECTORS.",
      "I WOULD OFFER MY CONGRATULATIONS",
      "BUT YOU HAVE SO MUCH TO DO I WON'T WASTE YOUR TIME.",
      "BY THE WAY, IF THINGS DON'T WORK OUT,",
      "DAXTER COULD ALWAYS GET A JOB CONTROLLING THE VILLAGE RAT PROBLEM.",
      "NYEH HA HA HA HA HA."
    ],
    "sagevb02": [
      "I HAVE TO ADMIT, I'M IMPRESSED. YOU TWO DIDN'T SCREW UP!",
      "NOW THAT THE LURKERS CAN'T OPEN THAT SILO",
      "THEY CAN'T FLOOD THE WORLD WITH DARK ECO",
      "AND CAUSE UNTOLD DESTRUCTION.",
      "WIPE THAT RIDICULOUS GRIN OFF YOUR FACE, DAXTER!",
      "I TO HAR MEGET AT GØRE.",
      "KOM I GANG!"
    ],
    "sagevb03": [
      "YOU KEEP ON IMPRESSING ME. BUT THEN MAYBE IT'S JUST BECAUSE",
      "I'VE GOT LOW EXPECTATIONS.",
      "OKAY, YOUR MOMENT OF GLOATING IS OVER.",
      "KOM SÅ I GANG!"
    ],
    "sagevb04": [
      "GOOD WORK, JAK! YOUR UNCLE WOULD BE PROUD.",
      "THAT WAS A GIANT ARM FROM A PRECURSOR ROBOT.",
      "I'VE NEVER SEEN ONE IN SUCH GOOD CONDITION!",
      "I CAN'T IMAGINE WHAT THE LURKERS WANTED WITH IT,",
      "BUT WE SURE DIDN'T WANT THEM TO GET IT.",
      "IF YOU KEEP THIS SUCCESS UP...",
      "NAH, YOU'LL STILL FALL SHORT OF HERO.",
      "BUT KEEP TRYING. IT'S ENDEARING."
    ],
    "sagevb21": [
      "THOSE LITTLE GREEN BALLS OF ENERGY ON THE GROUND ARE A TYPE OF ECO.",
      "PICK UP 50 SMALL GREEN ECOES, OR ONE BIG GREEN ONE TO INCREASE YOUR HEALTH."
    ],
    "sagevb22": [
      "THAT'S BLUE ECO, WHICH CONTAINS THE ENERGY OF MOTION.",
      "BLUE ECO ALLOWS YOU TO RUN FAST, BREAK BOXES, AND EVEN ACTIVATE SOME PRECURSOR",
      "ARTIFACTS WHEN YOU GET NEAR THEM."
    ],
    "sagevb23": [
      "NOTICE HOW EACH BLUE ECO CLUSTER YOU PICK UP",
      "INCREASES THE TIME YOU CAN USE ITS POWER."
    ],
    "sagevb24": [
      "THIS IS A PRECURSOR DOOR.",
      "IT CAN ONLY BE OPENED BY APPROACHING THE DOOR",
      "WHILE CHANNELLING BLUE ECO THROUGH YOUR BODY."
    ],
    "sagevb25": [
      "GOOD WORK, THE BLUE ECO CAUSED THE DOOR TO OPEN.",
      "WITH BLUE ECO, YOU CAN BREATHE ENERGY INTO ALL KINDS",
      "OF PRECURSOR ARTIFACTS THAT HAVE LAIN DORMANT FOR YEARS."
    ],
    "sagevb26": [
      "USE YOUR GOGGLES TO VIEW YOUR PROGRESS DURING THE ADVENTURE."
    ],
    "sagevb27": [
      "YOU CAN JUMP ONCE, THEN JUMP AGAIN IN THE AIR TO REACH EVEN HIGHER LEDGES."
    ],
    "sagevb28": [
      "WHEN YOU'RE SURROUNDED BY ENEMIES, USE YOUR SPIN KICK."
    ],
    "sagevb29": [
      "THAT'S NOT A SPIN KICK! TRY AGAIN."
    ],
    "sagevb30": [
      "COME ON, JAK! DO A SPIN KICK."
    ],
    "sagevb31": [
      "GOOD WORK. USE THE SPIN KICK WHEN YOU WANT A GOOD ALL-ROUND ATTACK."
    ],
    "sagevb32": [
      "FOR A STRAIGHT LINE, MOVING ATTACK, USE YOUR FIST TO PUNCH."
    ],
    "sagevb33": [
      "THAT'S NOT A PUNCH ATTACK! LET'S SEE YOU PUNCH ALREADY."
    ],
    "sagevb34": [
      "JAK! BRUG ET SLAG."
    ],
    "sagevb35": [
      "GREAT JOB. USE THE PUNCH TO CLOSE DISTANCE QUICKLY IN A TOUGH SPOT."
    ],
    "sagevb36": [
      "SOMETIMES YOU'LL WANT TO HIT THINGS WITH A GREATER FORCE.",
      "TO BREAK ONE OF THESE BOXES, YOU SHOULD JUMP IN THE AIR",
      "AND THEN DIVE DOWN ONTO IT, HANDS FIRST."
    ],
    "sagevb37": [
      "WHEN YOU GET SOME CONFIDENCE, TRY USING SOME OF YOUR MOVES IN COMBINATIONS."
    ],
    "sagevb38": [
      "YOU CAN'T COME BACK THROUGH THE WARP GATE",
      "UNTIL YOU FIND ALL 4 POWER CELLS ON THIS ISLAND."
    ],
    "sagevb39": [
      "GREAT! YOU FOUND ALL OF THE POWER CELLS ON THE ISLAND.",
      "COME BACK TO THE WARP GATE SO I CAN BRING YOU BACK TO THE LAB. HURRY UP!"
    ],
    "sksp0001": [
      "HEY! THAT SWEET-LOOKING BABE KEIRA WAS RIGHT! THERE ARE TRANS-PADS OUT HERE."
    ],
    "sksp0002": [
      "TRUST ME, THOSE DARK ECO BOXES ARE BAD NEWS!"
    ],
    "sksp0003": [
      "I BET IF WE FOUND ALL OF THOSE SICKLY CUTE SCOUT FLIES ON EACH LEVEL",
      "AT LEAST ONE WILL HAVE A POWER CELL!"
    ],
    "sksp0004": [
      "SÅDAN, KOSTBARHEDER!"
    ],
    "sksp0005": [
      "THESE WOOD AND METAL BOXES DON'T LOOK THAT TOUGH!",
      "I'LL BET THEY'LL BREAK IF YOU JUMP DIVE ONTO THEM."
    ],
    "sksp0006": [
      "THOSE ALL-METAL BOXES ARE THICKER THAN A YAKOW SKULL!",
      "BUT THERE MUST BE SOMETHING THAT CAN BUST 'EM OPEN."
    ],
    "sksp0007": [
      "TWO WORDS: POWER CELLS. WE NEED TO FIND 'EM AND WE AREN'T LOOKIN' SO GOOD RIGHT NOW."
    ],
    "sksp0008": [
      "WE NEED ORBS. ORBS, JAK! HOW ARE EVER GONNA BUY POWER CELLS IF WE DON'T COLLECT ORBS!"
    ],
    "sksp0009": [
      "WHAT A WEIRD-LOOKING THING! I'LL BET WE CAN GET THIS OPEN",
      "IF YOU'RE POWERED UP WITH THAT ZAPPY BLUE ECO STUFF."
    ],
    "sksp0010": [
      "HEY! LET'S GO CHECK OUT OL' FISH BREATH'S SPEED-BOAT AT THE DOCK!"
    ],
    "sksp0011": [
      "WE SHOULD ASK THE FISHERMAN DOWN BY THE JUNGLE RIVER",
      "IF WE CAN BORROW HIS SPEEDBOAT TO ZOOM ON OVER TO MISTY ISLAND!"
    ],
    "sksp0013": [
      "DID YOU SEE THE SIZE OF THE BITE",
      "THAT LURKER SHARK TOOK OUT OF THE FISHERMAN'S BOAT?",
      "WE BEST STAY WAY CLEAR OF THEM!",
      "I DON'T THINK WE CAN TACKLE A CREATURE THAT DAG NASTY."
    ],
    "sksp0014": [
      "WE SCROUNGED ENOUGH ORBS TO TRADE FOR A POWER CELL.",
      "LET'S GET BACK AND MAKE THE SWITCH ALREADY!"
    ],
    "sksp0015": [
      "THIS MUST BE A PRECURSOR ORACLE LIKE THE SAGE ALWAYS GOES ON ABOUT.",
      "I HOPE THEY WEREN'T AS UGLY IN PERSON!"
    ],
    "sksp0017": [
      "WHOA! CHECK OUT THAT FUNKY SCULPTURE",
      "SITTIN' ON THE ROCKS OVER THERE!"
    ],
    "sksp0018": [
      "WE SHOULD GO TELL THAT WINDBAG OF A MAYOR THAT HE OWES US BIG TIME",
      "FOR CONNECTING THE VILLAGE ENERGY BEAM!"
    ],
    "sksp0019": [
      "HEY, SEAGULLS! LET'S BUZZ 'EM FOR KICKS."
    ],
    "sksp0020": [
      "YEAH HA HA! LET'S DO THAT AGAIN!"
    ],
    "sksp0021": [
      "THERE'RE THOSE SEAGULLS AGAIN. LET'S GET 'EM!!"
    ],
    "sksp0022": [
      "YEAH HA HA HA HA HA!! WOO HO HO HO!"
    ],
    "sksp0023": [
      "WOOHOO!"
    ],
    "sksp0024": [
      "JA HA HA! JA!"
    ],
    "sksp0025": [
      "WOW! DE FORÅRSAGEDE EN LAVINE! LAD OS TAGE ET KIG."
    ],
    "sksp0026": [
      "HEY! DEN PELIKAN TOG LIGE EN KRAFTCELLE!",
      "LAD OS TÆSKE NOGET FUGLEGUMP!"
    ],
    "sksp0027": [
      "HURTIGT! VI SKAL NÅ TIL KRAFTCELLEN FØR PELIKANEN SAMLER DEN OP IGEN."
    ],
    "sksp0028": [
      "KICK THE EGG! HEE-HEE! KICK IT! KICK IT!"
    ],
    "sksp0029": [
      "EH, WE MIGHT WANNA TALK TO THE BIRDWATCHER",
      "AND SEE IF WE SCRAMBLED THAT FLUT-FLUT EGG."
    ],
    "sksp0030": [
      "HEY, TRY PUNCHING THE ROCKS TO GET 'EM OUT OF THE WAY!"
    ],
    "sksp0031": [
      "OOH! LET'S USE THE CANNON TO BLOW THINGS UP!"
    ],
    "sksp0034": [
      "AWOOGA! AWOOGA! DIVE FOR THOSE ORBS, JAK, DIVE!"
    ],
    "sksp0035": [
      "YEAH, SO WE GOT A PRECURSOR LAUNCHER HERE",
      "BUT YOU AREN'T POWERED UP WITH THE BLUE STUFF. SO IT AIN'T GONNA HELP US!"
    ],
    "sksp0037": [
      "THOSE TOWER DOOHICKEYS SCATTERED ALL OVER THE JUNGLE MUST REDIRECT THE ECO BEAM.",
      "LET'S GO FIDDLE WITH THEM!"
    ],
    "sksp0038": [
      "HMM, IF BLUE ECO CAN BUILD A BRIDGE, THEN I BET IT'LL OPEN A DOOR!",
      "LET'S GO BACK AND GET YOU JUICED UP AGAIN."
    ],
    "sksp0039": [
      "HEY, THERE'S LITTLE LIGHTNING MARKS ON THOSE POSTS",
      "AND THERE'S LIGHTNING COMING OUT OF THAT VENT OVER THERE.",
      "ARE YOU THINKING WHAT I'M THINKING?"
    ],
    "sksp0040": [
      "LET'S GET UP ON THAT MACHINE AND BREAK THE MIRROR DIVERTING THE PRECURSOR BEAM!"
    ],
    "sksp0041": [
      "WE NEED TO GET TO THE TOP OF THAT TOWER!"
    ],
    "sksp0043": [
      "MAYBE WE SHOULD GO ROOT OUT THE FISHERMAN.",
      "I HEARD HE WAS IN THE JUNGLE FISHING BY THE LOWER RIVER!"
    ],
    "sksp0049": [
      "LINE UP THE BEAM BY POINTING IT AT THE NEXT TOWER!"
    ],
    "sksp0050": [
      "BREAK THE MIRROR, JAK!"
    ],
    "sksp0051": [
      "GET THE BUGS, JAK! GET THE BUGS!"
    ],
    "sksp0052": [
      "LET'S GO TO THE NEXT TOWER AND RECONNECT THE BEAM THERE!"
    ],
    "sksp0053": [
      "HEY! WE CAN FOLLOW THE BEAM TO FIND THE NEXT TOWER."
    ],
    "sksp0054": [
      "WE NEED TO CHARGE YOU UP WITH THAT BLUE STUFF TO GET THIS OPEN!"
    ],
    "sksp0056": [
      "HEY! I SEE THE SCULPTOR'S MUSE!"
    ],
    "sksp0059": [
      "THIS PLACE GIVES ME THE WILLIES!",
      "LET'S KEEP YOU OUT OF THE OOZE, OKAY?"
    ],
    "sksp0060": [
      "(WHIMPERS) THIS PLACE GIVES ME THE CREEPS!",
      "AND TRUST ME, IT'S A WHOLE NEW EXPERIENCE",
      "WHEN YOU'RE COVERED IN FUZZ!"
    ],
    "sksp0062": [
      "LET'S PLOW INTO THOSE BALLOON LURKERS AND SHRED 'EM!"
    ],
    "sksp0063": [
      "I SAID \"SHRED THE LURKERS,\" JAK. NOT THE MINES!",
      "RULE NUMBER ONE: ALWAYS AVOID THE MINES!"
    ],
    "sksp0064": [
      "WATCH YOUR BACK! YOU REMEMBER WHAT HAPPENED THE LAST TIME WE WERE HERE."
    ],
    "sksp0067": [
      "DON'T FALL INTO THE MIST BELOW US!",
      "'CAUSE I DON'T THINK WE'LL MAKE IT BACK."
    ],
    "sksp0069": [
      "IT'S AN AMBUSH, JAK! IT'S AN AMBUSH!"
    ],
    "sksp0070": [
      "JUMP, THEN DIVE ONTO THE TEETER-TOTTER."
    ],
    "sksp0071": [
      "TAG DEN RØDE ECO!"
    ],
    "sksp0072": [
      "RØD ECO GØR DINE ANGREB STÆRKERE."
    ],
    "sksp0073": [
      "WE NEED BLUE ECO TO CHARGE THIS PLATFORM UP!"
    ],
    "sksp0076": [
      "JAK! HIT SOME JUMPS TO KEEP US OFF THE HOT GROUND."
    ],
    "sksp0077": [
      "BALLOONS GOOD, BURNING HOT MAGMA BAD!"
    ],
    "sksp0078": [
      "RIDE ON THE RAISED PRECURSOR STUFF TO KEEP US COOL."
    ],
    "sksp0079": [
      "AHH! I'M GONNA DIE! I'M A COMING, GRANDPAP!",
      "YOU HAVE TO GET THIS THING TO THE OTHER SIDE BEFORE IT OVERHEATS!"
    ],
    "sksp0080": [
      "USE THE HOP-TURN TO STEER HARDER!"
    ],
    "sksp0081": [
      "AHH! MÅSKE BURDE JEG STYRE!"
    ],
    "sksp0082": [
      "YOU ARE TRYING TO AVOID THOSE DARK ECO BOXES, RIGHT?"
    ],
    "sksp0083": [
      "OOH! SEE IF WE CAN CATCH AIR OFF THOSE LURKERS!"
    ],
    "sksp0084": [
      "FOR TÆT, FOR TÆT!"
    ],
    "sksp0085": [
      "WHOA! THIS BABY'S GETTING WAY TOO HOT!"
    ],
    "sksp0086": [
      "A FEW MORE SECONDS AND WE'RE FRIED FLUT-FLUT!"
    ],
    "sksp0087": [
      "HIT THOSE BALLOONS TO COOL OFF!"
    ],
    "sksp0088": [
      "HERE COMES ANOTHER BALLOON!"
    ],
    "sksp0089": [
      "JEG VILLE ØNSKE JEG SOV OVER MIG I MORGES!"
    ],
    "sksp0090": [
      "YOU MISSED A BALLOON! WE NEED THOSE OR WE'RE COOKED!"
    ],
    "sksp0091": [
      "THIS PUPPY'S GETTING TOO HOT!"
    ],
    "sksp0092": [
      "DO YOU SMELL SOMETHING BURNING?!"
    ],
    "sksp0093": [
      "I THINK MY TAIL'S ON FIRE!"
    ],
    "sksp0094": [
      "SHE'S GONNA BLOW!"
    ],
    "sksp0095": [
      "WAHOO! WE MADE IT!"
    ],
    "sksp0096": [
      "THERE'S SCOUT FLIES OUT HERE, TOO!"
    ],
    "sksp009a": [
      "HA HA! WE SHOWED HIM A THING OR TWO."
    ],
    "sksp009b": [
      "SÅDAN, FLERE GLOBER!"
    ],
    "sksp009c": [
      "GØR MIG EN TJENESTE OG HOLD DIG VÆK FRA KASSER MED MØRK ECO!"
    ],
    "sksp009d": [
      "JA-HA-HA-HA!"
    ],
    "sksp009e": [
      "WA-HOO!"
    ],
    "sksp009f": [
      "TAG DEN, TAG DEN! HA HA HA!"
    ],
    "sksp009g": [
      "LIGE BAG DIG, JAK!"
    ],
    "sksp009i": [
      "DID WE FIND ALL THE SCOUT FLIES IN THIS AREA?"
    ],
    "sksp009j": [
      "HEY! IT LOOKS LIKE SCOUT FLIES ARE ALWAYS IN RED BOXES."
    ],
    "sksp009k": [
      "ALRIGHT! YOU FOUND ALL THE SCOUT FLIES IN THIS AREA!"
    ],
    "sksp0109": [
      "WOO! WE BEAT THE RECORD TIME!"
    ],
    "sksp0110": [
      "JEG HAR SAGT DET FØR, JEG SIGER DET IGEN...",
      "UNDGØR KASSERNE MED MØRK ECO!"
    ],
    "sksp0111": [
      "LAD OS JAGE DE MULDVARPER TILBAGE UNDER JORDEN."
    ],
    "sksp0112": [
      "LAD OS FÅ VORES KRAFTCELLE FRA GEOLOGEN."
    ],
    "sksp0113": [
      "THOSE MUST BE THE INFESTED PLANTS OL' LOG-NOGGIN WAS TALKIN' ABOUT."
    ],
    "sksp0114": [
      "WE HAVE TO USE GREEN ECO TO CURE THOSE PLANTS."
    ],
    "sksp0115": [
      "JAK, DRIVE THROUGH THE GREEN ECO VENT."
    ],
    "sksp0116": [
      "THAT'S ONE OF THOSE FLYING LURKERS!",
      "HE MIGHT HAVE A POWER CELL!"
    ],
    "sksp0117": [
      "THERE'S THE MOLE HOLE!"
    ],
    "sksp0118": [
      "NOW, LET'S FLY OVER THE INFECTED PLANTS!"
    ],
    "sksp0119": [
      "ONE RING DOWN, A BUNCH TO GO!"
    ],
    "sksp0120": [
      "HURRY! THERE'S THE NEXT RING!"
    ],
    "sksp0121": [
      "QUICK! YOU'VE GOTTA FLY THROUGH EACH RING BEFORE THEY TURN OFF!"
    ],
    "sksp0122": [
      "HEY! THAT GRASS SLOWS US DOWN..."
    ],
    "sksp0123": [
      "QUICK! FOLLOW THAT PIPE!"
    ],
    "sksp0124": [
      "I GOT A BAD FEELING ABOUT THIS."
    ],
    "sksp0125": [
      "IT LOOKS LIKE THOSE THINGS NEED A BLUE ECO CHARGE."
    ],
    "sksp0126": [
      "LET'S GET THE POWER CELL ON THE ROOF OF THIS THING!"
    ],
    "sksp0127": [
      "KICK THE LITTLE GUY ON THE TOP!"
    ],
    "sksp0128": [
      "JAK! LØB! DEN MØRKE ECO STIGER!"
    ],
    "sksp0129": [
      "AHH! DEN MØRKE ECO KOMMER TÆT PÅ"
    ],
    "sksp0130": [
      "ØH, JEG TROR VI SKAL TÆNDE ALLE DE PLATFORME ELLER NOGET."
    ],
    "sksp0131": [
      "HEY! IT LOOKS LIKE YOU COULD JUMP-DIVE ONTO THOSE GUYS!"
    ],
    "sksp0132": [
      "EE-EE! WHOA! WHO-AH! WHO-AHH!"
    ],
    "sksp0133": [
      "I'LL BET WE CAN GET ALL OF THOSE THINGS CHARGED AT ONCE!"
    ],
    "sksp0134": [
      "HOW 'BOUT WE TAKE IT EASY ON THOSE HOT PIPES?!"
    ],
    "sksp0135": [
      "THAT WATER LOOKS DANGEROUS WHEN IT CHANGES COLOR!"
    ],
    "sksp0136": [
      "YOU GOTTA GET OUT OF THE WATER BEFORE IT CHANGES COLOR!"
    ],
    "sksp0137": [
      "I BET WE COULD SHOOT THOSE BOULDERS IF WE'RE CHARGED UP WITH YELLOW ECO."
    ],
    "sksp0138": [
      "WE SHOULD SHOOT THOSE BIG BOULDERS HOLDING THE TETHER."
    ],
    "sksp0139": [
      "MAYBE WE SHOULD HELP THAT WEIRDO FIND HIS PET."
    ],
    "sksp0140": [
      "THE FLUT-FLUT CAN GLIDE FARTHER IF SHE JUMPS AGAIN IN THE AIR!"
    ],
    "sksp0141": [
      "DON'T TOUCH THAT BLACK HOT TAR, OR YOU'LL GET HURT!"
    ],
    "sksp0142": [
      "THE WATER'S SAFE TO WAIT IN."
    ],
    "sksp0143": [
      "WAAH! BREAK THE TONGUE'S GRIP!"
    ],
    "sksp0144": [
      "SHOOT THOSE RAT NESTS TO STOP THE RATS FROM COMING OUT."
    ],
    "sksp0145": [
      "WOW! YOU CAN SHOOT FIREBALLS",
      "WHEN YOU'RE POWERED UP WITH YELLOW ECO."
    ],
    "sksp0146": [
      "HEY! THAT'S YELLOW ECO!"
    ],
    "sksp0147": [
      "YOU CAN SWING ON THAT POLE OVER THERE!"
    ],
    "sksp0148": [
      "WATCH OUT, THAT BRAMBLE IS PRICKLY!"
    ],
    "sksp0149": [
      "HEY, THAT LOOKS LIKE A TETHER HOLDING THE DIRIGIBLE IN PLACE!"
    ],
    "sksp0150": [
      "WATCH OUT WHEN THAT FROG IS CHARGED UP!"
    ],
    "sksp0151": [
      "RUN AWAY, JAK!"
    ],
    "sksp0152": [
      "LOOK OUT, JAK! IT'S AN AMBUSH!"
    ],
    "sksp0153": [
      "HEY, THAT MUST BE THE PRECURSOR ARTIFACT THE LURKERS ARE AFTER!",
      "IT LOOKS LIKE A GIANT ROBOT ARM!"
    ],
    "sksp0154": [
      "DEN SORTE TJÆRE SER VARM OG FARLIG UD!"
    ],
    "sksp0155": [
      "SKYD FLAGERMUSENE MED DET DER GULE ECO NOGET!"
    ],
    "sksp0156": [
      "MÅSKE KAN VI DUKKE UNDER FLAGERMUSENE!"
    ],
    "sksp0157": [
      "SÅ DU DET? KUN TRE FORTØJRINGER TILBAGE!"
    ],
    "sksp0158": [
      "WOW! KUN TO FORTØJRINGER MERE."
    ],
    "sksp0159": [
      "DET LUFTSKIB  SIDDER KNAP NOK FAST! LAD OS FINDE DEN SIDSTE FORTØJRING!"
    ],
    "sksp0160": [
      "HEY! DER ER EN FLUT-FLUT!"
    ],
    "sksp0161": [
      "JEG HADER ROTTER! OG JEG ER NÆRMEST EN SELV."
    ],
    "sksp018a": [
      "DEN DOVNE LANDMAND SKYLDER OS EN KRAFTCELLE!",
      "LAD OS TALE MED HAM!"
    ],
    "sksp0300": [
      "VI SKAL SLÅ DE LURERE TIL ENDEN AF PASSET!"
    ],
    "sksp0301": [
      "RAM IKKE DE SPRÆNGSTOFFER!"
    ],
    "sksp0302": [
      "BLIV FORAN DEM OG VI FOR DET GJORT!"
    ],
    "sksp0303": [
      "RAM DEN BLÅ ECO FOR AT FÅ ET BOOST!"
    ],
    "sksp0304": [
      "RAM IKKE TRÆERNE, JAK! DE VIL SLØVE OS!"
    ],
    "sksp0305": [
      "JO MERE BLÅ ECO VI RAMMER, JO HURTIGERE ER VI!"
    ],
    "sksp0306": [
      "PAS PÅ DE SPRÆNGSTOFFER!"
    ],
    "sksp0307": [
      "HOLD DIG FRA DE AFGRUNDE!"
    ],
    "sksp0308": [
      "MÅSKE BURDE JEG STYRE!"
    ],
    "sksp0309": [
      "DER ER EN AF LURERNE!"
    ],
    "sksp0310": [
      "FANG DEM, JAK!"
    ],
    "sksp0311": [
      "VI PASSEREDE EN!"
    ],
    "sksp0312": [
      "AH, EN AF LURERNE PASSEREDE OS!"
    ],
    "sksp0313": [
      "DE ER LANGT FORAN!"
    ],
    "sksp0314": [
      "JA! VI ER FORREST!"
    ],
    "sksp0315": [
      "HURTIGERE, JAK, HURTIGERE!"
    ],
    "sksp0316": [
      "STORT HOP, STORT HOP!"
    ],
    "sksp0317": [
      "HÆNG PÅ!"
    ],
    "sksp0318": [
      "JAAHH!!"
    ],
    "sksp0319": [
      "DET BLIVER TÆT!"
    ],
    "sksp0320": [
      "DE SLÅR OS TIL DETONATOREN!"
    ],
    "sksp0321": [
      "VI GJORDE DET! VI STOPPEDE DEM FRA AT SPRINGE PASSET!"
    ],
    "sksp0327": [
      "JEG TROR DET VAR DEN SIDSTE MØRK ECO KRYSTAL!"
    ],
    "sksp0328": [
      "MÅSKE DU KAN SKYDE BEDRE, HVIS DU SIGTER GENNEM DINE BRILLER."
    ],
    "sksp0329": [
      "ÅH, NEJ! MERE MØRK ECO!"
    ],
    "sksp0330": [
      "JEG TROR IKKE VI FIK ALLE DE MØRKE ECO KRYSTALLER."
    ],
    "sksp0331": [
      "SKYD DE LURERE SOM SPISER PÆLENE!"
    ],
    "sksp0332": [
      "LAD IKKE LYSET GÅ UD!"
    ],
    "sksp0333": [
      "SLÅ EN KRYSTAL FOR AT FÅ LYS."
    ],
    "sksp0334": [
      "LØB VÆK! DEN KRYSTAL SKAL TIL AT SPRINGE!"
    ],
    "sksp0335": [
      "EHH, DE FANDT EN FORGÆNGER ROBOT!"
    ],
    "sksp0336": [
      "POP ÆGGENE FØR DE KLÆKKER!"
    ],
    "sksp0337": [
      "DET ER DYSTERT HERINDE..."
    ],
    "sksp0338": [
      "SER UD TIL AT SPINDELVÆV KNÆKKER EFTER TO SPRING."
    ],
    "sksp0339": [
      "JEG. HADER. EDDERKOPPER..."
    ],
    "sksp0340": [
      "BABY-EDDERKOPPER ER PÅ VEJ!"
    ],
    "sksp0341": [
      "JEG TROR VI ER I EN EDDERKOPPEREDE HER!"
    ],
    "sksp0342": [
      "PAS PÅ, FLERE EDDERKOPPER!"
    ],
    "sksp0343": [
      "LAD OS KOMME UD HERFRA!"
    ],
    "sksp0345": [
      "HVORDAN KOMMER VI IND I FORTET?"
    ],
    "sksp0346": [
      "MÅSKE KAN RØD ECO BESEJRE DEN FYR!"
    ],
    "sksp0347": [
      "VI ER NØDT TIL AT LAVE ET RULLE HOP!"
    ],
    "sksp0348": [
      "VI ER NØDT TIL AT FINDE EN MÅDE AT ÅBNE VENTILEN!"
    ],
    "sksp0349": [
      "DET LIGNER EN ECO KONTAKT DERNEDE!"
    ],
    "sksp0350": [
      "SLÅ HAM NÅR PIGGENE ER INDE!"
    ],
    "sksp0351": [
      "TRYK PÅ KNAPPEN!"
    ],
    "sksp0352": [
      "HURTIGT! FØR DE FALDER NED IGEN!"
    ],
    "sksp0359": [
      "DU SKAL BRUGE RØD ECO!"
    ],
    "sksp0360": [
      "SÅDAN! VI ÅBNEDE DE FORSEGLEDE GULE ECO VENTILER!"
    ],
    "sksp0362": [
      "SE! EN FROSSEN KRAFTCELLE!"
    ],
    "sksp0363": [
      "KUN EN FLUT-FLUT KAN HOPPE SÅ LANGT!"
    ],
    "sksp0364": [
      "VI SKAL SKYNDE OS, ELLER VI ER DØDSDØMTE!"
    ],
    "sksp0365": [
      "VÆLG EN VEJ, ENHVER VEJ!"
    ],
    "sksp0366": [
      "UNDGÅ ELLER SKYD DE MINER, JAK!"
    ],
    "sksp0367": [
      "FIND EN VEJ GENNEM DE MØRK ECO TØNDER!"
    ],
    "sksp0368": [
      "BLIV VED MED AT RAMME KØLE BALLONERNE!"
    ],
    "sksp0369": [
      "VI BLIVER ALT FOR VARME!"
    ],
    "sksp0370": [
      "HUN SPRINGER!"
    ],
    "sksp0371": [
      "GÅ EFTER DEN BLÅ ECO, JAK!"
    ],
    "sksp0372": [
      "SKYD DIN VEJ IGENNEM!"
    ],
    "sksp0373": [
      "WAHOO! SIKKEN TUR!"
    ],
    "sksp0374": [
      "JA! VEND OG BRÆND, SKATTER!"
    ],
    "sksp0375": [
      "SKYD DE KRAFT SFÆRER FOR AT ÅBNE DØREN!"
    ],
    "sksp0376": [
      "SKYD DE KRAFT SFÆRER FØR VI BRÆNDER OP!"
    ],
    "sksp0378": [
      "DØREN ER ÅBEN, LAD OS KOMME AFSTED!"
    ],
    "sksp0379": [
      "ZOOMENDE!"
    ],
    "sksp0380": [
      "VI NÅEDE GENNEM!"
    ],
    "sksp0381": [
      "ØDELÆG GENERATOREN FOR AT BEFRI VISMANDEN!"
    ],
    "sksp0382": [
      "BARE HÆNG FAST PÅ KANTEN!"
    ],
    "sksp0383": [
      "VI HAR GÆSTER, JAK. MAAASSER AF LURERE! "
    ],
    "sksp0384": [
      "ØDELÆG DE GENERATORER!"
    ],
    "sksp0385": [
      "TRYK PÅ KNAPPEN!"
    ],
    "sksp0386": [
      "DEN ROBOT SKRÆMMER MIG IKKE !"
    ],
    "sksp0387": [
      "LAD OS KRAVLE OP AF DE PLATFORME!"
    ],
    "sksp0388": [
      "MIS IKKE DEN NÆSTE AFSKYDER!"
    ],
    "sksp0389": [
      "PAS PÅ!"
    ],
    "sksp0390": [
      "VI ER NØDT TIL AT REDDE ALLE VISMÆNDENE!"
    ],
    "sksp0391": [
      "TROR DU STADIG GOL VIL SKIFTE MIG TILBAGE?"
    ],
    "sksp0392": [
      "SÅ DETTE ER GOL OG MAIAS FØSTNING. FIN OG HYGGELIG."
    ],
    "sksp0393": [
      "LAND PÅ DEN NÆSTE AFSKYDER!"
    ],
    "sksp0394": [
      "GRIB DEN GULE ECO!"
    ],
    "sksp0395": [
      "SKYD ROBOTTEN, JAK!"
    ],
    "sksp0396": [
      "SKYD HANS ARM!"
    ],
    "sksp0397": [
      "SKYD HANS VÅBEN!"
    ],
    "sksp0398": [
      "SKYD HANS HOVED!"
    ],
    "sksp0399": [
      "PAS PÅ TRYKBØLGEN!"
    ],
    "sksp0400": [
      "HAN LADER OP!"
    ],
    "sksp0401": [
      "FÅ DEN BLÅ ECO!"
    ],
    "sksp0402": [
      "FÅ DEN RØDE ECO!"
    ],
    "sksp0403": [
      "JEG HAR EN DÅRLIG FORNÆMMELSE!"
    ],
    "sksp0404": [
      "BRUG AFSKYDEREN, HURTIGT!"
    ],
    "sksp0405": [
      "NU HAR DU GJORT DYRET ARRIGT!"
    ],
    "sksp0406": [
      "VI KAN IKKE RØRE DE FYRE!"
    ],
    "sksp0407": [
      "BRUG DEN GULE ECO!"
    ],
    "sksp0408": [
      "SKYD DE FYRE!"
    ],
    "sksp0409": [
      "FÅ DEN LYSE ECO, JAK!"
    ],
    "sksp0410": [
      "HAN SER SUR UD!"
    ],
    "sksp0411": [
      "HOP FOR AT UNDGÅ EKSPLOSIONER!"
    ],
    "sksp0412": [
      "NU TAGER VI OS AF SAGEN!"
    ],
    "sksp0413": [
      "GODT SKUDT, PARTNER!"
    ],
    "sksp0414": [
      "DET SÅREDE HAM!"
    ],
    "sksp0415": [
      "HER KOMMER HAN!"
    ],
    "sksp0416": [
      "JA! DU GJORDE DET!"
    ],
    "sksp0417": [
      "SIG \"GODNAT\", GOL OG MAIA!"
    ],
    "sksp0435": [
      "VÆLT DE KNOGLER!"
    ],
    "sksp0443": [
      "SLÅ DE PÆLE OP NEDEFRA!"
    ],
    "sksp0444": [
      "VI VENTER. HALLO?"
    ],
    "sksp0449": [
      "TRYK START FOR AT SPILLE."
    ],
    "sksp0450": [
      "VIL DU STOPPE MED AT SPILLE?"
    ],
    "sksp0451": [
      "DET TROEDE JEG IKKE."
    ],
    "sksp0452": [
      "OKAY, SES SENERE."
    ],
    "sksp0455": [
      "DOG, HVEM ER ALLE DE FOLK? "
    ],
    "sksp0466": [
      "JEG VAR GOD. IKKE SANDT, TØSER?"
    ],
    "sksp0b42": [
      "STOP MED AT MISSE DE GULE FISK, DE VEJER FEM PUND HVER!",
      "OG DET ER EN MASSE FISK, JAK."
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "FUGLEELSKER",
    "BLUE SAGE": "BLÅ VISMAND",
    "DAXTER": "DAXTER",
    "FARMER": "LANDMAND",
    "FISHERMAN": "FISKER",
    "FLUT-FLUT": "FLUT-FLUT",
    "GAMBLER": "GAMBLER",
    "GEOLOGIST": "GEOLOG",
    "GOL": "GOL",
    "GORDY": "GORDY",
    "JAK": "JAK",
    "JAK'S UNCLE": "JAKS ONKEL",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "BORGMESTER",
    "MINER": "MINEARBEJDER",
    "OLD MAN": "GAMMEL MAND",
    "ORACLE": "ORAKEL",
    "RED SAGE": "RØD VISMAND",
    "SAMOS": "SAMOS",
    "SCULPTOR": "BILLEDHUGGER",
    "WARRIOR": "KRIGER",
    "WILLARD": "WILLARD",
    "WOMAN": "KVINDE",
    "YELLOW SAGE": "GULE VISMAND"
  }
}
