{
  "cutscenes": {
    "bird-lady-beach-resolution": [
      "OH MY, I HOPE THE POOR DEAR'S OKAY.",
      "HERE'S A POWER CELL FOR YOUR VALOUR.",
      "MAMA!",
      "MAMA!",
      "OH NO! NO, NO, NO, NO!",
      "LOOK... ISN'T THAT CUTE? IT THINKS YOU'RE ITS MAMA.",
      "EH? I'M NOT YOUR MOM! YOU SEE ANY FEATHERS HERE?",
      "OH, LOVE AT FIRST SIGHT! AH...",
      "LISTEN, BOYS, I'LL TAKE THIS LITTLE CHICK BACK TO THE VILLAGE WITH ME",
      "AND WORK WITH THE SAGE TO TAKE CARE OF HER."
    ],
    "bird-lady-introduction": [
      "OH MY, WHAT A HORRIBLY SICK LITTLE BIRD.",
      "HUH! YOU DON'T LOOK SO GOOD YOURSELF, LADY!",
      "OH, SORRY. I THOUGHT YOU WERE A SPOTTED",
      "ORANGE-BELLIED RAIN FRAY.",
      "YOU KNOW, YESTERDAY I SAW SOME",
      "TERRIBLY VICIOUS CREATURES CAPTURE",
      "A MOTHER FLUT-FLUT NEAR THE BEACH.",
      "NOW THERE'S THIS POOR LITTLE ORPHAN EGG",
      "SITTING IN A NEST AT THE TOP OF THE CLIFF",
      "AND I CAN'T GET TO IT.",
      "IF YOU COULD CLIMB UP THERE AND PUSH IT OFF, I'VE PILED",
      "SOME HAY DOWN AT THE BASE TO CATCH IT SAFELY.",
      "DO AN OLD LADY A FAVOUR, AND I'LL GIVE YOU A POWER CELL."
    ],
    "green-sagecage-introduction": [
      "IT'S ABOUT TIME YOU TWO DECIDED TO SHOW UP!",
      "NICE TO SEE YOU TOO!",
      "DO THEY HAVE YOU MOPPING THE FLOORS NOW?",
      "THERE'S NO TIME FOR JOKES, DAXTER. GOL AND MAIA KIDNAPPED US",
      "TO SAP OUR ENERGIES TO POWER THEIR ABOMINABLE MACHINE.",
      "IT APPEARS THEY HAVE COMBINED THE FUNCTIONAL REMAINS OF A PRECURSOR ROBOT",
      "WITH SCAVENGED ARTEFACTS FROM ACROSS THE LAND.",
      "THEN THEY ADDED A FEW DIABOLICAL ADDITIONS OF THEIR OWN,",
      "CREATING THE ONE THING CAPABLE OF OPENING THE DARK ECO SILOS.",
      "IF YOU CAN FREE THE FOUR OF US, WE CAN USE OUR COMBINED POWERS",
      "TO BREAK THE FORCE SHIELD SURROUNDING THE ROBOT",
      "BEFORE THEY USE IT TO DESTROY THE WORLD."
    ],
    "minershort-introduction-gnawers": [
      "WHY DON'T YOU TWO MAKE YOURSELVES USEFUL?",
      "LURKERS HAVE BEEN EXCAVATIN' THE DARK CAVES OVER THERE.",
      "SEEMS THEY'RE LOOKIN' FOR PRECURSOR ARTEFACTS.",
      "THEY CAN HAVE THE ARTEFACTS, FOR ALL I CARE.",
      "FOR ALL WE CARE!",
      "WILLARD, FEED YOUR BIRD.",
      "ALL I CARE ABOUT ARE GEMS!",
      "BUT I AIN'T GONNA BE ABLE TO GET THE CAVE'S GEMS",
      "BECAUSE WHEN THEY'RE THROUGH, THEY'RE GONNA COLLAPSE THE PLACE!",
      "IF YOU TAKE OUT THE LURKERS CHEWIN' AT THE SUPPORT BEAMS,",
      "YOU COULD SAVE THE CAVE FOR ME.",
      "NOW BEAT IT!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "WELL, I HOPE YOU'VE PACKED A LUNCH. 'CAUSE WE'RE JUST GETTING STARTED.",
      "ACCORDING TO THE BLUE SAGE'S NOTES,",
      "LURKERS HAVE INFESTED THE SWAMP ACROSS THE BAY.",
      "APPARENTLY, THEY'RE PLANNING TO USE A DIRIGIBLE",
      "TO LIFT AN IMPORTANT PRECURSOR ARTEFACT FROM THE MUCK.",
      "YOU'RE GOING TO HAVE TO GET OVER THERE TO DISLODGE THEIR TETHERS.",
      "WHO KNOWS WHAT THEY MIGHT WANT WITH THE ARTEFACT,",
      "BUT LIKE ORANGE STUFF HERE'S BREATH, IT JUST CAN'T BE GOOD."
    ],
    "sage-village3-introduction": [
      "OW! I ALWAYS WONDER IF I'M LOSING BODY PARTS IN THOSE THINGS!",
      "HOLY YAKOW! THE RED SAGE'S LAB LOOKS WORSE THAN THE BLUE'S!",
      "WELL, IT DEFINITELY LOOKS AS THOUGH THERE'S BEEN A STRUGGLE HERE.",
      "HA HA HA HA HA!",
      "I'D HARDLY CALL IT \"STRUGGLE.\"",
      "WOULD YOU, DEAR SISTER?",
      "CERTAINLY NOT. THE RED SAGE GAVE UP WITH SO LITTLE EFFORT.",
      "NO FUN AT ALL.",
      "GOL? IS THAT YOU?",
      "YOU'VE FINALLY GONE OFF THE DEEP END, EH?",
      "AND, MAIA! I TOLD YOU THE DARK ECO WOULD AFFECT YOU BOTH!",
      "HNG, NOBODY EVER LISTENS TO OLD SAMOS...",
      "WHAT HAVE YOU TWO DONE WITH THE BLUE AND RED SAGES?",
      "DON'T WORRY ABOUT YOUR COLOURFUL FRIENDS, YOU OLD FOOL.",
      "THEY'RE PERFECTLY SAFE IN OUR CITADEL. OUR SPECIAL GUESTS.",
      "THEY HAVE GRACIOUSLY AGREED TO HELP US ON A LITTLE PROJECT.",
      "YOU WERE WRONG, SAMOS. DARK ECO CAN BE CONTROLLED!",
      "WE'VE LEARNED ITS SECRETS, AND NOW WE CAN RESHAPE THE WORLD TO OUR LIKING.",
      "YOU CAN'T CONTROL DARK ECO BY ITSELF! EVEN THE PRECURSORS COULDN'T-",
      "UNTIL NOW, WE'VE HAD TO SCRAPE BY WITH WHAT LITTLE DARK ECO",
      "WE COULD FIND NEAR THE SURFACE.",
      "BUT SOON, WE WILL HAVE ACCESS TO THE VAST STORES",
      "OF DARK ECO HIDDEN DEEP UNDERGROUND.",
      "NOT THE SILOS!",
      "YES, THE SILOS!",
      "THEY WILL BE OPENED, AND ALL THE DARK ECO IN THE WORLD WILL BE OURS!",
      "BUT THAT'S IMPOSSIBLE! ONLY A PRECURSOR ROBOT-",
      "OH, DON'T LOOK SO UPSET, SAMOS.",
      "WE'VE GOT BIG PLANS FOR YOU.",
      "AH HA HA HA HA HA HA! AHH...",
      "WAIT A MINUTE!",
      "THAT WAS GOL?",
      "THE SAME GOL WHO'S SUPPOSED TO CHANGE ME BACK?",
      "GOL IS THE GUY TRYING TO KILL US?!",
      "I'M DOOMED.",
      "WE MAY ALL BE DOOMED.",
      "IF THEY OPEN THE SILOS, THE DARK ECO WILL",
      "TWIST AND DESTROY EVERYTHING IT TOUCHES!",
      "WE SIMPLY MUST GET TO THEIR CITADEL, TO STOP THEM!",
      "THE FASTEST WAY THERE IS THROUGH THE LAVA TUBE",
      "AT THE BOTTOM OF THIS CRATER.",
      "A FEW MORE POWER CELLS, AND YOUR ZOOMER'S HEAT SHIELD",
      "SHOULD GET YOU ACROSS THE LAVA SAFELY.",
      "ALL RIGHT, MY BOY. YOU KNOW WHAT TO DO.",
      "TAKE THE FLEABAG AND GO ROUND UP MORE POWER CELLS."
    ],
    "sidekick-human-intro-sequence-b": [
      "CONTINUE YOUR SEARCH FOR ARTEFACTS AND ECO.",
      "IF THE LOCALS POSSESS PRECURSOR ITEMS, YOU KNOW WHAT TO DO.",
      "DEAL HARSHLY WITH ANYBODY WHO STRAYS FROM THE VILLAGE.",
      "WE WILL ATTACK IT IN DUE TIME."
    ],
    "warrior-introduction": [
      "OHH... MY ACHING HEAD.",
      "I DOUBT THAT'S ONE OF YOUR VITAL ORGANS!",
      "WALK IT OFF, TOUGH GUY!",
      "OH, SURE, I WAS TOUGH ONCE.",
      "MAYBE EVEN THE TOUGHEST OF THEM ALL.",
      "I SINGLE-HANDEDLY DEFENDED THIS VILLAGE FROM THOSE HORRID CREATURES FOR ALMOST A YEAR!",
      "THEN THAT HORRIBLE MONSTER ARRIVED AND COMMENCED THE BOULDER BOMBARDMENT.",
      "SO, FULL OF VALOUR, ARMOR SHINING IN THE SUN...",
      "I CLIMBED THE HILL TO TAKE HIM ON...!",
      "BUT HE POUNDED ME LIKE ONE TENDERIZES A YAKOW STEAK.",
      "HAVE YOU TRIED ATTACKING HIM WITH YOUR MELODRAMA?",
      "'CAUSE IT'S KILLIN' ME!",
      "AFTER MY LAST STUNNING FAILURE,",
      "HE SEALED THE PASSAGEWAY TO HIS ROOST WITH A 30-TON BOULDER,",
      "LEAVING NO WAY FOR ANYONE TO CHALLENGE HIM AGAIN.",
      "SO, OUR SAGE, A MASTER OF BLUE ECO AND A MECHANICAL GENIUS, DEVISED A MACHINE",
      "CAPABLE OF LIFTING THE BOULDER OUT OF THE WAY...!",
      "BUT ALAS, HE DISAPPEARED BEFORE WE HAD A CHANCE TO TURN IT ON.",
      "AND HE TOOK ALL OF HIS POWER CELLS WITH HIM.",
      "AT LEAST I WAS ABLE TO PULL ENOUGH PONTOONS OUT OF OUR BRIDGE TO PREVENT",
      "THAT MONSTER FROM COMING DOWN HERE TO DO ME HARM.",
      "YEAH, GOOD, GOOD JOB, TOUGH GUY. BUT, UM...",
      "WE'RE GONNA NEED YOU TO, UH... PUT 'EM BACK, AND STUFF.",
      "OH, SURE! AND SEAL MY DOOM?",
      "(SIGHS)",
      "ALRIGHT. FINE.",
      "BRING ME 90 PRECURSOR ORBS AND I'LL LET THE PONTOONS LOOSE.",
      "BUT I'M NOT GOING TO FIGHT THAT MONSTER AGAIN!"
    ]
  },
  "hints": {
    "asstv103": [
      "DON'T FORGET TO TURN ON THE TELEPORT GATE TO LET US THROUGH.",
      "YOU'VE GOT TO GO INTO THE RED SAGE'S LAB",
      "IN THE CENTRE OF THE VOLCANIC CRATER TO TURN IT ON.",
      "WE CAN'T COME THROUGH UNTIL IT'S BACK ONLINE."
    ],
    "asstvb42": [
      "THIS IS A POWER CELL, THE MOST IMPORTANT PRECURSOR ARTEFACT YOU CAN FIND!",
      "YOU NEED TO COLLECT 20 OF THESE SO I CAN POWER THE HEAT SHIELD",
      "FOR YOUR A-GRAV ZOOMER."
    ],
    "sagevb22": [
      "THAT'S BLUE ECO, WHICH CONTAINS THE ENERGY OF MOTION.",
      "BLUE ECO ALLOWS YOU TO RUN FAST, BREAK BOXES, AND EVEN ACTIVATE SOME PRECURSOR",
      "ARTEFACTS WHEN YOU GET NEAR THEM."
    ],
    "sagevb25": [
      "GOOD WORK, THE BLUE ECO CAUSED THE DOOR TO OPEN.",
      "WITH BLUE ECO, YOU CAN BREATHE ENERGY INTO ALL KINDS",
      "OF PRECURSOR ARTEFACTS THAT HAVE LAIN DORMANT FOR YEARS."
    ],
    "sksp009c": [
      "DO ME A FAVOUR AND KEEP AWAY FROM THOSE DARK ECO BOXES!"
    ],
    "sksp0135": [
      "THAT WATER LOOKS DANGEROUS WHEN IT CHANGES COLOUR!"
    ],
    "sksp0136": [
      "YOU GOTTA GET OUT OF THE WATER BEFORE IT CHANGES COLOUR!"
    ],
    "sksp0153": [
      "HEY, THAT MUST BE THE PRECURSOR ARTEFACT THE LURKERS ARE AFTER!",
      "IT LOOKS LIKE A GIANT ROBOT ARM!"
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "BIRDWATCHER",
    "BLUE SAGE": "BLUE SAGE",
    "DAXTER": "DAXTER",
    "FARMER": "FARMER",
    "FISHERMAN": "FISHERMAN",
    "FLUT-FLUT": "FLUT-FLUT",
    "GAMBLER": "GAMBLER",
    "GEOLOGIST": "GEOLOGIST",
    "GOL": "GOL",
    "GORDY": "GORDY",
    "JAK": "JAK",
    "JAK'S UNCLE": "JAK'S UNCLE",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "MAYOR",
    "MINER": "MINER",
    "OLD MAN": "OLD MAN",
    "ORACLE": "ORACLE",
    "RED SAGE": "RED SAGE",
    "SAMOS": "SAMOS",
    "SCULPTOR": "SCULPTOR",
    "WARRIOR": "WARRIOR",
    "WILLARD": "WILLARD",
    "WOMAN": "WOMAN",
    "YELLOW SAGE": "YELLOW SAGE"
  }
}