{
  "cutscenes": {
    "assistant-firecanyon-resolution": [
      "SUPER! IHR HABT DIE 20 ENERGIEZELLEN, UM MEINEN HITZESCHILD ZU AKTIVIEREN!",
      "SEID ABER VORSICHTIG,",
      "DER SCHILD SCHÜTZT DEN ZOOMER NUR BIS ZU EINER TEMPERATUR VON 500 GRAD.",
      "ALSO LASST IHN NICHT ZU HEISS LAUFEN.",
      "WENN IHR ÜBER GLÜHENDE LAVA FLIEGT, HEIZT IHN DAS GANZ SCHÖN SCHNELL AUF.",
      "WENN IHR 500 GRAD ERREICHT, IST ES AUS!",
      "AUS?! DU MEINST WIE IN \"AUS UND VORBEI\"?!",
      "DER FEUER-CANYON IST SEHR HEISS,",
      "ACHTET AUF SPRUNGMÖGLICHKEITEN, UM DEN ABSTAND ZUR LAVA ZU VERGRÖSSERN.",
      "ICH HABE AUCH MEHRERE BLAUE KÜHLBALLONS STEIGEN LASSEN,",
      "MIT DENEN IHR DIE TEMPERATUR DES SCHILDES SCHNELL SENKEN KÖNNT.",
      "ACH, JA, WENN IHR DURCH DEN CANYON SEID, VERGESST JA NICHT, DAS TELEPORTTOR",
      "IM LABOR DES BLAUEN WEISEN ZU AKTIVIEREN.",
      "DANN KÖNNEN WIR UNS ZU EUCH HINÜBERTELEPORTIEREN!",
      "VIEL GLÜCK!"
    ],
    "assistant-introduction-blue-eco-switch": [
      "HEY, BABY. WOLLEN WIR NICHT ZUSAMMEN EIN PAAR RUNDEN AUF DIESEM A-GRAV ZOOMER DREHEN?",
      "REGEL NUMMER EINS: ICH VERABREDE MICH NICHT MIT TIEREN.",
      "ACH, DU WEISST JA GAR NICHT, WAS DIR ENTGEHT, EH HEH HEH...",
      "HÖR ZU, WENN IHR BESCHÄFTIGUNG BRAUCHT, MEIN VATER HAT VON EINEM",
      "ALTEN PRECURSOR-ROHRSYSTEM TIEF UNTER DER ERDE ERZÄHLT.",
      "AM ENDE VON EINIGEN ROHREN SIND ÖFFNUNGEN, AUS DENEN DAS ECO HERAUSSTRÖMT,",
      "ANDERE SIND VERRIEGELT, SODASS DAS ECO EINGESCHLOSSEN IST.",
      "ES MUSS MÖGLICH SEIN, DIE VERRIEGELTEN ÖFFNUNGEN AUFZUMACHEN.",
      "ICH HAB RAUSGEFUNDEN, DASS EIN TEIL DER ROHRE UNTER DEM VERBOTENEN TEMPEL LIEGT.",
      "SUCHT DORT MAL NACH EINEM SCHALTER."
    ],
    "assistant-introduction-race-bike": [
      "HEY BABY, WAS IST'N DAS HIER?",
      "SEI VORSICHTIG! ICH VERSUCHE, HERAUSZUFINDEN, WIE MAN DEN ZOOMER MITHILFE DER",
      "PRECURSOR-TRANS-PADS TRANSPORTIEREN KANN.",
      "WENN IHR AN EINES DIESER PADS KOMMT, KANN ICH DIE POSITION EURES KOMMUNIKATORS ERMITTELN",
      "UND EUCH DEN ZOOMER SCHICKEN!",
      "HALTET AUF DER NEBELINSEL AUSSCHAU NACH SOLCHEN TRANS-PADS, ODER SONSTWO!"
    ],
    "assistant-lavatube-end-resolution": [
      "HEY! WO IST DENN DER KLEINE SCHRUBBELIGE?",
      "ES IST FURCHTBAR! VATER IST VERSCHWUNDEN!",
      "GOL UND MAIA HABEN MÖGLICHERWEISE AUCH IHN ENTFÜHRT!",
      "IMMER MIT DER RUHE, SÜSSE. ICH HABE ALLES UNTER KONTROLLE.",
      "UNTER KONTROLLE? LURKER-ARMEEN BREITEN SICH IM GANZEN LAND AUS,",
      "DIE WEISEN SIND ENTFÜHRT WORDEN,",
      "GOL UND MAIA HABEN GENUG ECO, UM IHREN FÜRCHTERLICHEN PLAN AUSZUFÜHREN!",
      "UM SIE AUFZUHALTEN, WERDET IHR EUCH DURCH IHRE ZITADELLE KÄMPFEN MÜSSEN!",
      "ÄH... JA. HAST DU... SCHÖN GESAGT.",
      "IHR MÜSST MEINEN VATER RETTEN, BEVOR ES ZU SPÄT IST.",
      "UND JAK? SEI VORSICHTIG.",
      "JA. WIR SIND ES!"
    ],
    "assistant-lavatube-start-resolution": [
      "HAHA! IN ORDNUNG!",
      "MIT DIESEN ZUSÄTZLICHEN ENERGIEZELLEN MÜSSTE ICH ES SCHAFFEN, DEN HITZESCHILD",
      "MIT GENUG ENERGIE ZU VERSORGEN, UM DER LAVA STANDZUHALTEN.",
      "ABER DER HITZESCHILD HAT AUCH SEINE GRENZEN!",
      "ER HÄLT JETZT TEMPERATUREN VON BIS ZU 800 GRAD STAND, ABER NICHT MEHR.",
      "BEHALTET DIE ANZEIGE IM AUGE.",
      "NICHT AUSZUDENKEN, WAS DIESE TEMPERATUREN MIT EUREM ZOOMER MACHEN,",
      "WENN DER HITZESCHILD VERSAGT.",
      "JA, DIE HITZE.",
      "ÄH, WAS?! DER ZOOMER?! HEY, WAS IST MIT UNS?!",
      "KÖNNEN WIR NICHT EINEN SICHEREN WEG ZU GOLS ZITADELLE FINDEN?",
      "GANZ RUHIG. ICH HABE NOCH MEHR KÜHLBALLONS IN DAS LAVA-ROHR GESCHICKT.",
      "DIE KÖNNT IHR BENUTZEN, UM DIE TEMPERATUR ZU REGULIEREN.",
      "UND VERGESST NICHT, DAS TELEPORTTOR IM LABOR DES GELBEN WEISEN ZU AKTIVIEREN.",
      "WIR ZÄHLEN AUF EUCH."
    ],
    "assistant-reminder-1-blue-eco-switch": [
      "WENN IHR IM VERBOTENEN PRECURSOR-TEMPEL SUCHT, SCHAFFT IHR ES BESTIMMT,",
      "DIE VERSCHLOSSENE BLAUE ECO-ÖFFNUNG AM WÄCHTERSTRAND AUFZUMACHEN."
    ],
    "assistant-reminder-1-generic": [
      "HEY, JUNGS! SAMMELT WEITER ENERGIEZELLEN, IHR BRAUCHT SIE, UM WEITER NACH NORDEN ZU REISEN."
    ],
    "assistant-reminder-1-race-bike": [
      "ICH WEISS JETZT, WIE MAN DIE TRANS-PADS BENUTZT.",
      "GEHT ZUR NEBELINSEL UND ICH SCHICKE EUCH DEN ZOOMER RÜBER."
    ],
    "assistant-village2-introduction": [
      "WOW!",
      "ICH GLAUBE, ICH WERDE MICH NIE AN DIESES KRIBBELN BEIM TELEPORTIEREN GEWÖHNEN.",
      "...HEY!",
      "SIEHT AUS, ALS HÄTTE DER BLAUE WEISE EINE PARTY GESCHMISSEN.",
      "OH, JE! IN FELSDORF IST DIE HÖLLE LOS!",
      "WOW, UND WAS FÜR EINE PARTY!",
      "NEIN, NEIN! ICH MEINTE, FELSDORF WIRD GERADE MIT BRENNENDEN FELSBLÖCKEN BOMBARDIERT!",
      "OH! SIEHT SO AUS, ALS HÄTTE DER BLAUE WEISE AN EINER SCHWEBEMASCHINE GEARBEITET,",
      "UM DIE BROCKEN VORZUSCHAFFEN.",
      "FALLS SIE FUNKTIONIERT, BRAUCHEN WIR ENERGIEZELLEN, UM SIE ANZUTREIBEN.",
      "DA WERDET IHR WOHL NOCH MEHR BESORGEN MÜSSEN.",
      "WIR SEHEN UNS BESSER SEINE AUFZEICHNUNGEN AN.",
      "JAK, SIEH MAL NACH, WIE ES DEN DORFBEWOHNERN GEHT",
      "UND DANN KOMM ZURÜCK UND BERICHTE MIR.",
      "UND NIMM DIE RATTE MIT!"
    ],
    "assistant-village2-introduction-flutflut": [
      "WIEDER ZURÜCK, JUNGS?",
      "\"JUNGE\"?",
      "HEY, BABY, ICH BIN EIN AUSGEWACHSENER...",
      "ÄH...",
      "PELZIGER... WIESEL?",
      "HEY, WISST IHR, WAS? MIT ERLAUBNIS DER VOGEL-BEOBACHTERIN",
      "HABE ICH DAS FLUT-FLUT-BABY MIT EINEM SATTEL AUSGERÜSTET.",
      "IM SUMPF SCHEINT NÄMLICH AUCH EIN TRANS-PAD ZU SEIN UND...",
      "WENN IHR ES GEFUNDEN HABT, SCHICKE ICH EUCH DAS FLUT-FLUT IN VOLLER REITAUSRÜSTUNG.",
      "MIT SEINEN GROSSEN SPRÜNGEN HILFT ES EUCH BEIM ÜBERQUEREN DES TEERS."
    ],
    "assistant-village2-introduction-robbers": [
      "HEY, IHR ZWEI!",
      "ICH WEISS, WO NOCH EINE ENERGIEZELLE IST!",
      "IN DEN AUFZEICHNUNGEN DES BLAUEN WEISEN STEHT,",
      "DASS IHM EIN PAAR FLIEGENDE LURKER EINE GESTOHLEN HABEN",
      "UND DAMIT ZUM PRECURSOR-BECKEN GEFLOGEN SIND.",
      "IHR KÖNNT DIE LURKER MIT EUREM ZOOMER JAGEN,",
      "BIS IHR DEN MIT DER ENERGIEZELLE GEFUNDEN HABT.",
      "DER ZOOMER STEHT AUF DEM TRANS-PAD IN DER NÄHE DES EINGANGS ZUM PRECURSOR-BECKEN."
    ],
    "assistant-village2-introduction-room": [
      "SCHEINBAR FÜHRT DAS PRECURSOR-BAUWERK VOR DER KÜSTE",
      "ZU EINER VERLORENEN UNTERWASSERSTADT.",
      "DER BLAUE WEISE HAT VERSUCHT, RAUSZUFINDEN,",
      "WIE ER EINE DER KAMMERN AN DIE WASSEROBERFLÄCHE HOLEN KANN.",
      "ER HATTE LEIDER KEINEN ERFOLG.",
      "SEHT ES EUCH MAL AN!",
      "ÄH... GIBT ES DORT NICHT VIELE...",
      "LURKER-HAIE IN DEN GEWÄSSERN?",
      "WIESO? HAST DU ANGST?",
      "ICH? AUF KEINEN FALL!",
      "ICH FRAG NUR WEGEN JAK...",
      "DU WEISST JA...",
      "WAS ER FÜR EIN ANGSTHASE IST.",
      "NUN JA, WENN IHR BIS ZUM KORALLENRIFF SCHWIMMT,",
      "GLAUBE ICH, LASSEN EUCH DIE LURKER-HAIE IN RUHE.",
      "DIE MÖGEN KEIN FLACHES WASSER."
    ],
    "assistant-village2-reminder-1-flutflut": [
      "DAS FLUT-FLUT WIRD EUCH IM SUMPF VON NUTZEN SEIN.",
      "SUCHT DAS TRANS-PAD, DANN SCHICKE ICH EUCH DAS FLUT-FLUT."
    ],
    "assistant-village2-reminder-1-robbers": [
      "ICH WERDE EUCH DEN ZOOMER IN DIE NÄHE DES PRECURSOR-BECKENS TELEPORTIEREN,",
      "DAMIT IHR DIESE FLIEGENDEN LURKER JAGEN KÖNNT, ALLES KLAR?"
    ],
    "assistant-village2-reminder-1-room": [
      "SEID IHR SCHON ZUR VERLORENEN PRECURSOR-STADT GESCHWOMMEN?",
      "VERSUCHT DOCH, DIE KAMMER ZU HEBEN, DIE DEN BLAUEN WEISEN INTERESSIERTE."
    ],
    "assistant-village2-resolution": [
      "TOLL!",
      "DIE ENERGIEZELLEN FÜR DIE MASCHINE!",
      "DAS SOLLTE AUSREICHEN, UM DEN FELSBLOCK ZU HEBEN.",
      "NA, ALSO!",
      "ABER PASST AUF, WENN IHR AUF DAS LURKER-MONSTER DORT OBEN TREFFT.",
      "MOMENT!",
      "ÄH...",
      "ICH BLEIB' HIER UND BESCHÜTZE KEIRA!",
      "JAK, DU WIRST BESTIMMT AUCH OHNE MICH MIT DEM MONSTER FERTIG.",
      "OH, WIE HELDENHAFT."
    ],
    "assistant-village3-reminder": [
      "HEY, JUNGS! SAMMELT WEITER ENERGIEZELLEN.",
      "IHR BRAUCHT SIE, UM WEITER NACH NORDEN ZU REISEN."
    ],
    "billy-accept": [
      "GUT! DIESE RATTEN KÖNNEN JEDERZEIT ZURÜCKKOMMEN.",
      "ERSCHIESST SIE, DAMIT WENIGSTENS EIN LECKERCHEN ÜBRIGBLEIBT."
    ],
    "billy-introduction": [
      "HALLO, FREUNDE! GEFÄLLT EUCH MEIN SCHÖNER SUMPF? DAS GEHÖRT ALLES MIR,",
      "ZUMINDEST DAS, WAS NICHT IM SCHLAMM VERSINKT! HA, HA, HA!",
      "SO, WIE ES HIER RIECHT, IST DEINE BADEWANNE SCHON GANZ SCHÖN LANGE IM SCHLAMM VERSUNKEN!",
      "WAS? BADEWANNE? ICH HAB HIER GANZ ANDERE PROBLEME...",
      "IN DER GEGEND TREIBEN EIN PAAR WIDERLICHE LURKER IHR UNWESEN",
      "UND GREIFEN SICH HIER ECHT ALLES AB.",
      "UND SIE HABEN MEIN ZAHMES HIPHOG FARTHY VERSCHEUCHT...",
      "ES IST JETZT SCHON SO LANGE WEG...",
      "ICH STELLE IMMER SEIN LIEBLINGSFRESSEN RAUS, ABER DIESE SUMPFRATTEN STEHLEN ES JEDES MAL!",
      "WENN IHR DIESE VERDAMMTEN VIECHER IN SCHACH HALTET,",
      "RIECHT FARTHY GANZ SICHER DIE LECKEREIEN UND KOMMT ZURÜCK!",
      "KÖNNT IHR MIR HELFEN?"
    ],
    "billy-reject": [
      "WENN IHR EUCH DAS NATÜRLICH ANDERS ÜBERLEGT,",
      "DANN WISST IHR JA, WO IHR MICH FINDET! (LACHT)"
    ],
    "billy-reminder-1": [
      "NA, WOLLT IHR MIR JETZT DOCH NOCH HELFEN?"
    ],
    "billy-resolution": [
      "BRAT' MIR EINER'N STORCH, KANNST DU ABER SCHIESSEN! VIELEN DANK FÜR DIE HILFE!"
    ],
    "bird-lady-beach-resolution": [
      "OH, JE, HOFFENTLICH GEHT'S DEM ARMEN KLEINEN GUT.",
      "HIER, EINE ENERGIEZELLE FÜR EUREN MUT.",
      "MAMA!",
      "MAMA!",
      "OH, NEIN! NEIN! NEIN! NEIN! NEIN!",
      "SCHAUT MAL, IST DAS NICHT SÜSS? ES GLAUBT, DU WÄRST SEINE MAMA.",
      "HÄ? ICH BIN NICHT DEINE MAMA! HAB ICH ETWA FEDERN?",
      "AH, LIEBE AUF DEN ERSTEN BLICK! OH...",
      "HÖRT MAL, JUNGS, ICH NEHME DAS KLEINE KÜKEN MIT INS DORF",
      "UND KÜMMERE MICH ZUSAMMEN MIT DEM WEISEN DARUM."
    ],
    "bird-lady-introduction": [
      "ACH, HERRJE, SO EIN FURCHTBAR KRANKES VÖGELCHEN.",
      "HAH! SIEHST AUCH NICHT GERADE GESUND AUS, LADY!",
      "OH, ENTSCHULDIGUNG.",
      "ICH DACHTE, DU WÄRST EIN ORANGEGEFLECKTER BAUCHRINGFRING.",
      "WISST IHR, GESTERN HABEN EIN PAAR SCHRECKLICH BÖSE WESEN",
      "HIER AM STRAND EINE FLUT-FLUT-MUTTER GEFANGEN.",
      "JETZT LIEGT DIESES ARME KLEINE WAISENEI IM NEST OBEN AUF DER KLIPPE",
      "UND ICH KOMME NICHT DRAN.",
      "KÖNNT IHR DA DRAUFKLETTERN UND ES RUNTERSCHUBSEN?",
      "ICH HABE UNTEN ETWAS HEU HINGELEGT, UM ES AUFZUFANGEN.",
      "TUT EINER ALTEN FRAU EINEN GEFALLEN UND IHR BEKOMMT EINE ENERGIEZELLE DAFÜR."
    ],
    "bird-lady-reminder-1": [
      "OH, HALLO NOCHMAL. HABT IHR JUNGS DAS BLAUE EI AUF DER KLIPPE GEFUNDEN?",
      "SCHUBST ES RUNTER UND IHR BEKOMMT EINE ENERGIEZELLE!"
    ],
    "bird-lady-reminder-2": [
      "SEID IHR JUNGS ETWA IMMER NOCH HIER? HA, HA, HA!",
      "DEM ARMEN KLEINEN BLAUEN EI AUF DEM ABHANG IST BESTIMMT SCHRECKLICH KALT.",
      "SCHUBST ES VON DER KLIPPE RUNTER UND RETTET ES,",
      "DAFÜR BEKOMMT IHR EINE ENERGIEZELLE!"
    ],
    "bluesage-resolution": [
      "GUT GEMACHT, JUNGS! DER ALTE SAMOS HATTE RECHT MIT EUCH!",
      "ACH, DU HEILIGES PRECURSOR-METALL!",
      "WIR DÜRFEN NICHT ZULASSEN, DASS DIESE HEIMTÜCKISCHE MASCHINE ALLES ZERSTÖRT!",
      "ICH WERDE VERSUCHEN, DIE SCHUTZSCHILDTÜR IN BEWEGUNG ZU SETZEN,",
      "INDEM ICH EINEN ENERGIESTRAHL",
      "ZWISCHEN MIR UND DEM GROSSEN PORTAL DARUNTER ERZEUGE!",
      "ÄH... JA. MACH DAS MAL. WIR, ÄH... WERDEN NOCH MEHR HILFE HOLEN.",
      "VOLLKOMMEN IRRE!"
    ],
    "death-0181": [
      "NICHT INS LICHT KOMMEN, JAK! NICHT INS LICHT KOMMEN!"
    ],
    "death-0182": [
      "WO DU SCHON MAL DA UNTEN BIST...",
      "MASSIERST DU MIR DIE FÜSSE?"
    ],
    "death-0184": [
      "WO DU SCHON MAL DU UNTEN BIST...",
      "MASSIERST DU MIR DIE FÜSSE?"
    ],
    "death-0186": [
      "KEINE SORGE, ICH WERDE DICH...",
      "NICHT RÄCHEN."
    ],
    "death-0187": [
      "AH, JA...",
      "BESSER DU ALS ICH."
    ],
    "death-0191": [
      "UH, DAS HAT WEHGETAN.",
      "SOLL ICH VERSTÄRKUNG HOLEN?"
    ],
    "death-0193": [
      "ERSTER SCHRITT: AM LEBEN BLEIBEN.",
      "ZWEITER SCHRITT...",
      "MACH SOWAS BLOSS NICHT NOCH MAL MIT MIR!"
    ],
    "death-0195": [
      "ICH WAR DIREKT HINTER DIR, JAK!",
      "...EHRLICH. GLAUB MIR."
    ],
    "death-0197": [
      "SANITÄTER! 'NE TRAGE!",
      "ÄH, EIN ATEMFRISCH?"
    ],
    "death-0199": [
      "ICH WERDE WAS ECHT BEWEGENDES AUF DEINEM BEGRÄBNIS SAGEN, WIE...",
      "\"WER WIRD MICH JETZT ZURÜCKVERWANDELN?!\""
    ],
    "death-0202": [
      "SAG \"GUTE NACHT\" JAK!"
    ],
    "explorer-introduction": [
      "OH, HALLO, MEIN LIEBER JUNGE.",
      "DU KOMMST MIR JETZT ABER GERADE EIN WENIG UNGELEGEN.",
      "WEISST DU, ICH WOLLTE SCHON GESTERN ZU MEINER REISE AUFBRECHEN,",
      "ABER ICH HABE SCHEINBAR ZU WENIG PRECURSOR-ORBS.",
      "ICH HÄTTE SCHWÖREN KÖNNEN, DASS ICH 90 STÜCK HATTE.",
      "ABER ICH VERMUTE, DEIN JUNGER FREUND,",
      "DIESER LÄSTIGE, FURCHTBAR HÄSSLICHE KLEINE KERL HIER,",
      "HAT MIR AUS JUX GERADE EIN PAAR ENTWENDET.",
      "NUN DENN,",
      "WÜRDEST DU DEINEM LIEBEN ALTEN ONKEL FREUNDLICHERWEISE 90 PRECURSOR-ORBS LEIHEN,",
      "DAMIT ER AUFBRECHEN KANN? ICH BIETE DIR EINE ENERGIEZELLE DAFÜR."
    ],
    "explorer-reminder-1": [
      "WAS? SO VIELE HAST DU NICHT? HARUMPH!",
      "TJA, MIT WENIGER ALS 90 PRECURSOR-ORBS KANN ICH NICHT AUFBRECHEN,",
      "MEIN JUNGE."
    ],
    "explorer-reminder-2": [
      "NUN JA, 90 PRECURSOR-ORBS FÜR EINE ENERGIEZELLE",
      "SIND EIN AUSGESPROCHEN FAIRES GESCHÄFT."
    ],
    "explorer-resolution": [
      "AH, IHR WOLLT DAS GESCHÄFT ALSO DOCH MACHEN? PRÄCHTIG, AUSGESPROCHEN PRÄCHTIG!",
      "HEY, HABT IHR DIE VEREINBARTEN PRECURSOR-ORBS?",
      "HM, HOFFENTLICH VERGEUDET IHR DIESE SCHWER VERDIENTE ENERGIEZELLE NICHT.",
      "MACHT'S GUT, CIAO CIAO, BYE BYE!"
    ],
    "farmer-introduction": [
      "MUSS DIE YAKOWS MELKEN, MUSS DIE YAKOWS MELKEN...",
      "OH! IHR SEID'S... ICH RUH MICH NUR EIN BISSCHEN AUS.",
      "HAB DEN GANZEN TAG VERSUCHT, DIESE STREITLUSTIGEN KÜHE",
      "ZURÜCK IN DEN PFERCH ZU KRIEGEN! EIN PAAR SELTSAME TYPEN WOLLTEN SIE SCHON STEHLEN.",
      "KÖNNTET IHR WOHL EINEM ALTEN MANN HELFEN UND SIE IN DEN PFERCH BRINGEN?"
    ],
    "farmer-reminder-1": [
      "HEY! MEINE YAKOWS SIND JA IMMER NOCH DRAUSSEN!",
      "SEID BITTE SO NETT UND HOLT SIE JETZT REIN."
    ],
    "farmer-reminder-2": [
      "DIESE BLÖDEN YAKOWS STROLLEN IMMER NOCH RUM!",
      "JETZT BRINGT SIE DOCH ENDLICH MAL IN DEN PFERCH!"
    ],
    "farmer-resolution": [
      "AH, GUT GEMACHT, MEIN JUNGE. DIE VERLAUSTEN VIECHER SIND JETZT IM PFERCH.",
      "NUN KANN ICH BERUHIGT SCHLAFEN. HIER IST EINE ENERGIEZELLE FÜR DEINE MÜHE."
    ],
    "finalbosscam-white-eco": [
      "HELLES ECO?! ES EXISTIERT ALSO WIRKLICH!",
      "SIE DÜRFEN ES NICHT BEKOMMEN!"
    ],
    "fisher-accept": [
      "MUSST DREI SACHEN WISSEN, WENN DU FISCHST.",
      "ERSTENS: KANNST ZWEI ARTEN VON FISCHEN FANGEN, EINPFÜNDER UND FÜNFPFÜNDER.",
      "ZWEITENS: LÄSSTE 20 PFUND VON DEN GUTEN FISCHEN ENTWISCHEN,",
      "DU, DANN NEHM ICH DIR DAS NETZ WEG.",
      "DRITTENS GIBT'S GIFTIGE AALE IM FLUSS,",
      "AUCH WENN DU NUR EINEN VON DEN BURSCHEN ERWISCHST, VERGIFTET ER DEN GANZEN FANG!"
    ],
    "fisher-introduction": [
      "WAS HAST'N DA IM KORB?",
      "ACH, NICHT DER REDE WERT.",
      "DIE MONSTER DA AM OZEAN HABEN EIN STÜCK AUS MEINEM BOOT RAUSGEBISSEN",
      "UND NUN VERLEIBEN SIE SICH MEINEN FANG EIN!",
      "EGAL, WAS ICH MACHE, ICH FANG' HIER IM FLUSS EINFACH KEINEN FISCH MEHR.",
      "UUH, VIELLEICHT IST'S DEIN MUNDGERUCH.",
      "MEINST, DU KANNST DAS BESSER? VERSUCH MAL, MIT 'NEM WINZIGEN NETZ FLUSSFISCHE ZU FANGEN!",
      "KRIEGST 'NE ENERGIEZELLE VON MIR, WENN DU 200 PFUND VON DEN VIECHERN FÄNGST!",
      "UND ICH LASS DICH UND DEN KNIRPS HIER MEIN SCHNELLBOOT BENUTZEN,",
      "UM ZUR NEBELINSEL ZU KOMMEN.",
      "NA, WOLLT IHR ES VERSUCHEN?"
    ],
    "fisher-reject": [
      "NAJA, NUN, WENN IHR ES EUCH ANDERS ÜBERLEGEN TUT,",
      "DANN WISST IHR JA, WO IHR MICH FINDET."
    ],
    "fisher-reminder-1": [
      "WOLLT'S WOHL MIT DEM FLUSS AUFNEHMEN, WAS?"
    ],
    "fisher-resolution": [
      "IHR HABT'S GESCHAFFT! HABT 200 PFUND FISCH GEFANGEN!",
      "NICHT SCHLECHT FÜR EIN PAAR LANDRATTEN!",
      "HIER, DIE ENERGIEZELLE.",
      "UND IHR KÖNNT EUCH MEIN BOOT VOM DOCK IM DORF HOLEN, WENN IHR ES BRAUCHT!"
    ],
    "gambler-introduction-1": [
      "OH, NEIN. NICHT NOCH SO EIN \"HELD\".",
      "DER KAMPF DIESES SOGENANNTEN HELDEN GEGEN DAS MONSTER",
      "HAT MICH MEINE UNTERHOSE GEKOSTET.",
      "VERTRAUT MIR, SETZT ALLES AUF DAS MONSTER.",
      "NACH DIESER WETTE BIN ICH VÖLLIG BLANK!",
      "ICH SCHLAG' EUCH WAS VOR, HÖRT ZU.",
      "BESORGT MIR 90 ORBS, DANN KANN ICH ENDLICH AUS DIESEM ELENDEN FASS RAUS,",
      "DAFÜR KRIEGT IHR EINE ENERGIEZELLE.",
      "UND WENN IHR EIN SPIELCHEN WAGEN WOLLT, ICH HAB' EINE WETTE PARAT:",
      "MEIN GROSSES COMEBACK!",
      "SCHLAGT DIE REKORDZEIT BEIM RENNEN IN DER TOTENSCHLUCHT IM PRECURSOR-BECKEN!",
      "ICH KASSIERE EIN NETTES SÜMMCHEN",
      "UND IHR BEKOMMT VON MIR NOCH EINE ZUSÄTZLICHE ENERGIEZELLE."
    ],
    "gambler-reminder-money": [
      "HEY, DENKT AN MEINE ORBS.",
      "90 FÜR MICH UND EINE FÜR EUCH BEIDE. EINE ENERGIEZELLE MEINE ICH NATÜRLICH!"
    ],
    "gambler-reminder-race": [
      "NA, WORAUF WARTET IHR NOCH?",
      "DIESES FASS WIRD LANGSAM UNGEMÜTLICH!",
      "SCHLAGT DIE BESTZEIT FÜR DIE STRECKE IN DER TOTENSCHLUCHT,",
      "DANN GEWINNEN WIR BEIDE!"
    ],
    "gambler-resolution-money": [
      "HAHAHA! OH, JA!",
      "DIESE ORBS WERDEN MIR WIEDER AUS MEINEM FASS RAUSHELFEN!",
      "UND HIER IST DIE ENERGIEZELLE, DIE ICH DIR VORHIN VERSPROCHEN HABE!"
    ],
    "gambler-resolution-race": [
      "HA, TOLL GELAUFEN, JUNGCHEN.",
      "ICH WUSSTE, DASS DU ES SCHAFFST! WIR WERDEN'S WEIT BRINGEN!",
      "HIER IST DEINE ENERGIEZELLE UND ICH WERD' MIR JETZT MEIN GELD HOLEN!"
    ],
    "geologist-introduction": [
      "IHR ZWEI SEHT WIE FÄHIGE LEUTE AUS.",
      "ICH LEITE GERADE EIN FORSCHUNGSPROJEKT",
      "UND VIELLEICHT KÖNNT IHR MICH UNTERSTÜTZEN.",
      "HEY, DAS IST HIER UNSER ABENTEUER,",
      "DU SOLLST UNS HELFEN!",
      "NAJA, VIELLEICHT KÖNNEN WIR EINANDER HELFEN.",
      "SEIT JAHREN ERFORSCHE ICH DAS GRABVERHALTEN DER BLITZMAULWÜRFE",
      "IM PRECURSOR-BECKEN NAHE UNSERES DORFES.",
      "ABER JETZT HABEN DIE BÖSEN LURKER DIE MAULWÜRFE AN DIE OBERFLÄCHE GETRIEBEN!",
      "UND BLIND, WIE SIE SIND, FINDEN SIE DEN WEG UNTER DIE ERDE NICHT MEHR.",
      "TREIBT SIE DOCH BITTE WIEDER IN IHRE TUNNEL ZURÜCK,",
      "DAMIT WÜRDET IHR IHNEN DAS LEBEN RETTEN.",
      "ICH GEB' EUCH AUCH EINE ENERGIEZELLE DAFÜR, OKAY?",
      "KLAR, BLITZMAULWÜRFE. GANZ TOLL.",
      "OKAY, FÜR ZWEI ENERGIEZELLEN.",
      "NETTER VERSUCH.",
      "ABER WENN IHR ZWEI MIR 90 PRECURSOR-ORBS",
      "FÜR MEIN FORSCHUNGSPROJEKT BESORGT,",
      "BEKOMMT IHR VON MIR NOCH EINE ZUSÄTZLICHE ENERGIEZELLE.",
      "EINVERSTANDEN?"
    ],
    "geologist-reminder-moles": [
      "HABT IHR DIE BLITZMAULWÜRFE ZURÜCK UNTER DIE ERDE GETRIEBEN?",
      "IHR BEEILT EUCH BESSER, DIREKTES SONNENLICHT SCHADET IHNEN!"
    ],
    "geologist-reminder-money": [
      "ICH BRAUCHE DIESE ORBS UNBEDINGT FÜR MEINE FORSCHUNGEN!"
    ],
    "geologist-resolution-moles": [
      "DANKE, DASS IHR DIE MAULWÜRFE GERETTET HABT, DAS WAS SO LIEB VON EUCH!",
      "HIER IST DIE ENERGIEZELLE, SIE HILFT EUCH WEITER.",
      "JETZT KANN ICH MICH WIEDER MEINER FORSCHUNG WIDMEN!"
    ],
    "geologist-resolution-money": [
      "OH, IHR HABT DIE ORBS!",
      "HIER IST DIE VEREINBARTE ENERGIEZELLE."
    ],
    "green-sagecage-daxter-sacrifice": [
      "HELLES ECO! DAS KÖNNTE MICH ZURÜCKVERWANDELN, HAH!",
      "ODER... ES KÖNNTE DEN ROBOTER AUFHALTEN.",
      "HMM... WUSCHELIG BLEIBEN ODER DIE WELT RETTEN? MAL NACHDENKEN...",
      "OKAY, NA GUT, DANN RETTEN WIR EBEN DIE WELT, ABER MACHT SCHNELL,",
      "BEVOR ICH'S MIR ANDERS ÜBERLEGE!"
    ],
    "green-sagecage-introduction": [
      "WIRD AUCH LANGSAM ZEIT, DASS IHR ZWEI HIER AUFTAUCHT!",
      "SCHÖNEN GUTEN TAG, AUCH! LÄSST MAN DICH JETZT DIE BÖDEN HIER WISCHEN?",
      "WIR HABEN KEINE ZEIT ZUM SCHERZEN, DAXTER.",
      "GOL UND MAIA HABEN UNS ENTFÜHRT, UM MIT UNSERER ENERGIE",
      "IHRE SCHEUSSLICHE MASCHINE ANZUTREIBEN.",
      "WIE ES SCHEINT, HABEN SIE DIE FUNKTIONIERENDEN TEILE EINES PRECURSOR-ROBOTERS",
      "MIT DEN AUS DEM GANZEN LAND ZUSAMMENGETRAGENEN ARTEFAKTEN VERBUNDEN,",
      "EIGENE TEUFLISCHE VERÄNDERUNGEN VORGENOMMEN UND EINE KREATUR ERSCHAFFEN,",
      "DIE ALS EINZIGE DIE DUNKLEN PRECURSOR-ECO-STATIONEN ÖFFNEN KANN.",
      "WENN DU UNS VIER BEFREIEN KANNST,",
      "KÖNNEN WIR ALLE MIT VEREINTEN KRÄFTEN DAS SCHUTZSCHILD UM DEN ROBOTER ZERSTÖREN,",
      "BEVOR SIE MIT IHM DIE GANZE WELT VERNICHTEN."
    ],
    "green-sagecage-outro-beat-boss-a": [
      "TU DOCH WAS!",
      "NEEEEIN!"
    ],
    "green-sagecage-outro-beat-boss-b": [
      "NUN JA, ES SCHEINT, ALS HÄTTE ICH EUCH JUNGS FALSCH EINGESCHÄTZT,",
      "IHR HABT DOCH DAS ZEUG ZU HELDEN!",
      "OH, DAXTER, JETZT MUSST DU IMMER SO BLEIBEN.",
      "MACH DIR KEINE SORGEN UM MICH, SÜSSE.",
      "DU WEISST DOCH, ES HEISST: \"KLEINER KERL, ABER GROSS WAS DAHINTER.\"",
      "JAK, DU BESITZT EIN UNGLAUBLICHES TALENT, ECO ZU KANALISIEREN!",
      "SAMOS, VIELLEICHT HATTEST DU DOCH RECHT MIT DEM BURSCHEN!",
      "UND KEIRA, OHNE DEINE HILFE UND DEINEN EINFALLSREICHTUM",
      "WÄRE NICHTS DAVON MÖGLICH GEWESEN.",
      "HA, HA, HA. VIELLEICHT HABEN WIR JA EINEN NEUEN WEISEN GEFUNDEN, JETZT,",
      "WO GOL UND MAIA FORT SIND.",
      "JA, GOL UND MAIA... DAS DUNKLE ECO HAT SIE MÖGLICHERWEISE GETÖTET.",
      "MÖGLICHERWEISE...",
      "ACH, WEN JUCKT'S? HOLT SIE HER, WIR MACHEN SIE NOCHMAL FERTIG! ODER, JAK?",
      "ICH SAGTE, \"ODER, JAK?\"",
      "WOW! NIMM MAL 'NE KALTE DUSCHE, DU HELD!"
    ],
    "green-sagecage-outro-beat-boss-enough-cells": [
      "HEILIGE YAKOW! WAS IST DAS DENN?",
      "WOW, DAS IST EINE ALTE PRECURSOR-TÜR!",
      "ES SCHEINT, ALS LIESSE SIE SICH ÖFFNEN, WENN WIR ALLE 100 LÖCHER MIT ENERGIEZELLEN FÜLLEN!",
      "ÄHM, WIR SIND HELDEN, WISST IHR NOCH? WIR HABEN 100 ENERGIEZELLEN!"
    ],
    "green-sagecage-outro-beat-boss-need-cells": [
      "HEILIGE YAKOW! WAS IST DAS DENN?",
      "WOW, DAS IST EINE ALTE PRECURSOR-TÜR!",
      "ES SCHEINT, ALS LIESSE SIE SICH ÖFFNEN, WENN WIR ALLE 100 LÖCHER MIT ENERGIEZELLEN FÜLLEN!",
      "OH, MANN, JETZT GEHT DAS SCHON WIEDER LOS!"
    ],
    "green-sagecage-outro-big-finish": [
      "WOW! WAS... IST DAS?",
      "OH, ES IST WUNDERSCHÖN...",
      "BEI ALLEN PRECURSORN..."
    ],
    "green-sagecage-outro-preboss": [
      "DU KOMMST ZU SPÄT, SAMOS.",
      "SOBALD ICH UNBEGRENZT DUNKLES ECO BESITZE, WERDE ICH DEN SCHLÜSSEL ZUR SCHÖPFUNG HABEN!",
      "DAS IST WAHNSINN! WENN DU SO VIEL DUNKLES ECO FREISETZT, WIRD ALLES ZERSTÖRT! ALLES!",
      "SIEH DOCH, WAS ES AUS EUCH GEMACHT HAT!",
      "ES HAT UNS EINE ART SCHÖNHEIT GESCHENKT, DIE DU NIE VERSTEHEN WÜRDEST.",
      "SCHÖNHEIT? HABT IHR BEIDEN IN LETZTER ZEIT MAL IN DEN SPIEGEL GESCHAUT?",
      "WENN DU DENKST, EIN HAARIGER WINZLING ZU SEIN, WÄRE SCHLIMM,",
      "WARTE NUR, BIS WIR DIE ECO-STATIONEN GEÖFFNET HABEN!",
      "UND IHR ZWEI SEID NUR WEGEN MEINER HILFE SO WEIT GEREIST.",
      "NARREN! LEHNT EUCH ZURÜCK UND GENIESST DIE NEUERSCHAFFUNG DER WELT!",
      "JAK! NIMM DEN AUFZUG UND HALTE DIESEN ROBOTER AUF!"
    ],
    "green-sagecage-resolution": [
      "TOLL GEMACHT, JUNGS! JETZT SEID IHR WAHRE HELDEN!",
      "ICH VEREINE JETZT MEINE GRÜNE ECO-KRAFT MIT DEN ANDEREN DREI WEISEN",
      "UND ZUSAMMEN ÖFFNEN WIR DIE TÜR DES SCHUTZSCHILDES,",
      "DAS DEN PRECURSOR-ROBOTER UMGIBT.",
      "JA, JA, FÜR DEN ANFANG SCHON GANZ GUT.",
      "UND WENN IHR DIESEN SCHILD GEÖFFNET HABT, WAS MACHT IHR DANN MIT DEM ROBOTER?",
      "GAR NICHTS, DAXTER. WIR MÜSSEN NUR DAS SCHUTZSCHILD OFFEN HALTEN.",
      "DANN LIEGT ES AN EUCH BEIDEN HIER, DEN ROBOTER ZU ZERSTÖREN.",
      "OH, KLASSE. JETZT KANN ICH DEM KERL HELFEN, DER MICH IN EINER RATTE VERWANDELT HAT",
      "UND DIE EINZIGE PERSON VERNICHTEN, DIE MICH ZURÜCKVERWANDELN KANN!",
      "RETTET ZUERST EINMAL DIE WELT, DANN VERSUCHEN WIR,",
      "GOL DAZU ZU BRINGEN, DAXTER ZU HELFEN."
    ],
    "mayor-introduction": [
      "OH... (MURMELT) JETZT SAGT MIR BLOSS NICHT, DASS IHR ZWEI AUCH EIN PROBLEM HABT!",
      "ERST WERDEN IN DER NÄHE DES DORFES MONSTER GESICHTET UND JETZT DAS!",
      "SEHT IHR DIE WINDMÜHLENFLÜGEL? DA OBEN, JUNGS, JA? DIE STEHEN STILL,",
      "DAS BEDEUTET, IM DORF GIBT'S KEINEN STROM!",
      "DER ECO-STRAHL AUS DEM DSCHUNGEL-TEMPEL IST UNTERBROCHEN WORDEN, JUNGS",
      "UND NIEMAND TRAUT SICH, NACHZUSEHEN, WAS PASSIERT IST!",
      "IST DIE RECHNUNG BEZAHLT?",
      "JA? HMM, OH, DU BIST JA WITZIG.",
      "WÜRDET IHR ZWEI DEN ECO-STRAHL REPARIEREN? FÜR EINE ENERGIEZELLE?",
      "OH, NOCH ETWAS...",
      "IHR ZWEI WOLLT NICHT ZUFÄLLIG EINE KLEINIGKEIT",
      "FÜR DIE KAMPAGNE ZU MEINER WIEDERWAHL SPENDEN?",
      "DAS WÄRE MIR GLATT NOCH EINE ENERGIEZELLE WERT!",
      "DAS MINIMUM FÜR EINE SPENDE BETRÄGT, ÄHM, JA, BESCHEIDENE 90 PRECURSOR-ORBS!"
    ],
    "mayor-reminder-beams": [
      "SCHON ZURÜCK? UND OHNE DIE ECO-STRAHLEN ZU REPARIEREN?",
      "(SCHLUCHZT) EUER DORF BRAUCHT EUCH, JUNGS!"
    ],
    "mayor-resolution-beams": [
      "OH HO HO, WAS FÜR EIN WUNDERVOLLER ANBLICK! ICH DANKE EUCH!",
      "UND DAS GANZE DORF WIRD MIR DANKEN.",
      "OH, JUNGS, DANK EUCH HABEN WIR WIEDER STROM UND MEINE WIEDERWAHL IST GESICHERT!",
      "UND DAFÜR, MEIN JUNGE, HAST DU DIR EINE ENERGIEZELLE VERDIENT!"
    ],
    "mayor-resolution-donation": [
      "IHR WOLLT ALSO ETWAS SPENDEN? GUT... HOFFENTLICH EIN SCHÖNES SÜMMCHEN!",
      "JUHU! OHHH, DAS IST EINE GROSSZÜGIGE SPENDE!",
      "ICH-ICH-ICH HOFFE NUR,",
      "D-D-DA-DASS DIESE ENERGIEZELLE EUREN EINSATZ GEBÜHREND BELOHNT!"
    ],
    "minershort-introduction-gnawers": [
      "HM, WARUM MACHT IHR BEIDEN EUCH NICHT NÜTZLICH?",
      "DIE LURKER SIND DABEI, DIE DUNKLEN HÖHLEN DA DRÜBEN ZU DURCHGRABEN.",
      "SIE SCHEINEN NACH PRECURSOR-ARTEFAKTEN ZU SUCHEN.",
      "DIE ARTEFAKTE KÖNNEN SIE RUHIG HABEN, DAS IST MIR EGAL.",
      "DAS IST UNS EGAL!",
      "WILLARD, FÜTTER' DEINEN VOGEL.",
      "MIR GEHT'S NUR UM DIE EDELSTEINE!",
      "ABER ICH KOMME NICHT AN DIE EDELSTEINE IN DER HÖHLE RAN,",
      "DENN WENN SIE FERTIG SIND, WERDEN SIE DIE HÖHLE ZUM EINSTÜRZEN BRINGEN!",
      "WENN IHR DIE LURKER AUSSCHALTET, DIE AN DEN STÜTZBALKEN NAGEN,",
      "WÜRDET IHR DIE HÖHLE FÜR MICH RETTEN.",
      "JETZT MACHT SCHON!"
    ],
    "minershort-introduction-orbs": [
      "HEY, GORDY, ICH, ÄH, DENKE, WIR HABEN BESUCH.",
      "DU DENKST, WILLARD? TAGCHEN, FREUNDE, AUF DER DURCHREISE?",
      "JA, WIR AUCH. TJA, WIR MÜSSEN WEITER, ÄHM, NICHTS ZU SEHEN HIER.",
      "ÄH, ICH DACHTE, DAS SEI EIN UNBEZAHLBARER EDELSTEIN-",
      "WILLARD!",
      "EIGENTLICH WOLLEN WIR ENERGIEZELLEN, KEINE EDELSTEINE.",
      "WIR HABEN VIER STÜCK DAVON. WOLLT IHR SIE?",
      "WAS EUCH DAS SPATZENHIRN HIER SAGEN WILL, IST,",
      "DASS WIR VIELLEICHT EIN PAAR ENERGIEZELLEN ÜBRIG HABEN",
      "UND UNS VIELLEICHT DAVON TRENNEN KÖNNTEN.",
      "FÜR 90 ORBS PRO ZELLE.",
      "WO HAB' ICH DAS BLOSS SCHON MAL GEHÖRT?",
      "HEY, WIE WOLLT IHR BEIDEN GENIES DIESEN RIESENEDELSTEIN EIGENTLICH HIER WEGBEKOMMEN?",
      "TJA, SCHLAUMEIER, WIR HABEN NOCH ZWÖLF JAHRE GRABEN VOR UNS,",
      "UM UNS WAS EINFALLEN ZU LASSEN.",
      "ÄH, GORDY, WÜRDE ES NICHT SCHNELLER GEHEN, WENN DU MITGRÄBST?"
    ],
    "minershort-introduction-switch": [
      "PSST, JUNGS. ÄHHM...",
      "BIRDIE UND ICH HABEN DA EINE HÖHLE ERFORSCHT, DIE WÜRDE EUCH GEFALLEN!",
      "SIE WAR VOLL MIT HÜBSCHEM ORANGENEM METALL",
      "UND LAG ECHT GUT VERSTECKT HINTER EIN PAAR BÄUMEN IM SCHNEEGEBIRGE!",
      "ICH HAB'S GORDY ERZÄHLT,",
      "ABER DER HAT MICH NUR ANGESCHRIEN, WEIL ICH NICHT GEGRABEN HAB'!",
      "WIESO GRÄBST DU NICHT?!",
      "ENTSCHULDIGUNG!"
    ],
    "minershort-reminder-1-gnawers": [
      "WÜRDET IHR EUCH ENDLICH UM DIE LURKER KÜMMERN,",
      "DIE AN DEN STÜTZBALKEN DER DUNKLEN HÖHLE NAGEN?",
      "DIE BALKEN HALTEN DAS SCHLIESSLICH NICHT EWIG AUS!"
    ],
    "minershort-reminder-1-orbs": [
      "VERGESST UNSERE ABMACHUNG NICHT. BRINGT UNS 100 ORBS.",
      "DU HATTEST DOCH 90 GESAGT.",
      "WILLARD!",
      "NA SCHÖN. 90 ORBS PRO ZELLE."
    ],
    "minershort-reminder-1-switch": [
      "HABT IHR DIE HÖHLE GEFUNDEN?",
      "DA HINTER DEN BÄUMEN IM SCHNEEGEBIRGE UND DIE WÜRDE EUCH GEFALLEN.",
      "JA, BALD GEH' ICH DA HIN UND VERSTECK' MICH VOR GORDY,",
      "DER SCHREIT MICH BLOSS DAUERND AN!",
      "WILLARD!"
    ],
    "minershort-reminder-2-orbs": [
      "ÄH, GORDY?",
      "90 ORBS PRO ENERGIEZELLE, WILLARD! ARGH!"
    ],
    "minershort-resolution-1-orbs": [
      "ACH, SCHON GUT.",
      "HIER HABT IHR EINE ENERGIEZELLE FÜR EURE ORBS."
    ],
    "minershort-resolution-2-orbs": [
      "OH! DIESMAL DARF ICH, JA!",
      "HIER IST EINE...",
      "HIER IST, ÄHHH...!",
      "EINE ENERGIEZELLE!",
      "JA, JA, WAS ER GRAD' GESAGT HAT.",
      "DAS WAR'S. IHR HABT UNS VÖLLIG AUSGENOMMEN!",
      "KEINE! ENERGIEZELLEN! MEHR!"
    ],
    "oracle-intro-1": [
      "WER WECKT DAS ORAKEL AUF?",
      "WARTET, EINER VON EUCH HAT DAS INNERE LICHT!",
      "SEIT ANBEGINN DER ZEIT SUCHE ICH UND WARTE AUF DIE RÜCKKEHR DES WAHREN HELDEN.",
      "BRINGT MIR 120 PRECURSOR-ORBS FÜR JEDE ENERGIEZELLE, DIE ICH BESITZE."
    ],
    "oracle-intro-2": [
      "HÜTET EUCH VOR DEM DUNKLEN LICHT,",
      "DENN ES BIRGT EIN SCHLIMMES SCHICKSAL FÜR EINEN VON EUCH.",
      "BRINGT MIR 120 PRECURSOR-ORBS FÜR JEDE ENERGIEZELLE, DIE ICH BESITZE."
    ],
    "oracle-intro-3": [
      "SUCHT DAS REINE LICHT, DENN IN SEINER FLAMME RUHEN DIE ANTWORTEN.",
      "VERDIENT MEINE ENERGIEZELLEN, INDEM IHR MIR 120 PRECURSOR-ORBS FÜR JEDE DAVON DARBRINGT."
    ],
    "oracle-left-eye-1": [
      "IHR HABT EUCH ALS WÜRDIG ERWIESEN. HIER IST EINE ENERGIEZELLE."
    ],
    "oracle-left-eye-2": [
      "FÜR DEIN OPFER ÜBERREICHE ICH DIR EINE ENERGIEZELLE"
    ],
    "oracle-left-eye-3": [
      "FÜR EURE MÜHEN ERHALTET IHR EINE ENERGIEZELLE ALS BELOHNUNG."
    ],
    "oracle-reminder-1": [
      "BRINGT MIR 120 PRECURSOR-ORBS UND ICH BELOHNE EUCH MIT EINER ENERGIEZELLE."
    ],
    "oracle-reminder-2": [
      "BRINGT MIR 120 PRECURSOR-ORBS UND EINE ENERGIEZELLE SOLL EURE BELOHNUNG SEIN."
    ],
    "oracle-reminder-3": [
      "IHR MÜSST MIR 120 PRECURSOR-ORBS FÜR JEDE ENERGIEZELLE IN MEINEM BESITZ BRINGEN."
    ],
    "oracle-right-eye-1": [
      "FÜR EURE GABE ERHALTET IHR EINE WEITERE ENERGIEZELLE."
    ],
    "oracle-right-eye-2": [
      "HIER IST EINE WEITERE ENERGIEZELLE FÜR EURE SUCHE."
    ],
    "oracle-right-eye-3": [
      "IHR HABT EUCH EINE WEITERE ENERGIEZELLE VERDIENT."
    ],
    "redsage-resolution": [
      "(LACHT) ENDLICH KOMMT IHR MICH RETTEN.",
      "WISST IHR, WIE LANGE ICH SCHON HIER BIN? WIESO HABT IHR SO LANGE GEBRAUCHT? (LACHT)",
      "UND WIE HEISST IHR?",
      "ICH BIN DAXTER! DAS IST JAK, GEHÖRT ZU MIR.",
      "GUT GEMACHT, DAXTER. DU BIST EIN WAHRER HELD.",
      "IHR MÜSST GOL DARAN HINDERN, DEN ROBOTER ZU STARTEN.",
      "MIT MEINER ECO-KRAFT HELFE ICH EUCH, DIE SCHUTZSCHILDTÜR ZU ÖFFNEN."
    ],
    "sage-bluehut-introduction-crop-dusting": [
      "TJA, DIE SITUATION HIER SIEHT SCHLIMMER AUS ALS EIN LURKER-GESICHT.",
      "BEVOR DER BLAUE WEISE VERSCHWAND,",
      "MACHTE ER NOTIZEN ÜBER SCHWIERIGKEITEN IN ALLEN ANGRENZENDEN GEBIETEN.",
      "BESONDERS INTERESSANT FINDE ICH DIE DUNKLE-ECO-INFEKTION",
      "EINIGER UNSCHULDIGER PFLANZEN IM PRECURSOR-BECKEN.",
      "KEIRA WIRD EUREN A-GRAV-ZOOMER ZUM NÄCHSTEN TRANS-PAD TELEPORTIEREN.",
      "FLIEGT MIT DEM ZOOMER ZU EINER GRÜNEN-ECO-ÖFFNUNG",
      "UND BRINGT DANN GRÜNES ECO ZU DEN BEFALLENEN PFLANZEN.",
      "DAS HEILT SIE.",
      "LASST ABER KEINE PLFANZE AUS,",
      "SONST INFIZIEREN NÄMLICH DIE KRANKEN PFLANZEN ERNEUT DIE GESUNDEN.",
      "UND DAXTER...",
      "FANG ENDLICH AN, ZU WISCHEN!",
      "BESONDERS IN DEN ECKEN!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "ICH HOFFE, IHR HABT AUCH WAS ZU ESSEN DABEI, DENN DAS IST ERST DER ANFANG.",
      "LAUT DEM BLAUEN WEISEN WIMMELT ES",
      "IM SUMPF AUF DER ANDEREN SEITE DER BUCHT NUR SO VON LURKERN.",
      "SCHEINBAR WOLLEN SIE EINEN ZEPPELIN BENUTZEN,",
      "UM EIN WICHTIGES PRECURSOR-ARTEFAKT AUS DEM SCHLAMM ZU BERGEN.",
      "UND IHR ZWEI MÜSST UNBEDINGT DORT HINÜBER, UM DIE HALTESEILE ZU LÖSEN.",
      "WER WEISS, WOZU SIE DAS ARTEFAKT BENUTZEN WOLLEN?",
      "ABER ES IST SICHER NICHTS GUTES, WIE DER MUNDGERUCH VON IHM HIER."
    ],
    "sage-bluehut-reminder-1-crop-dusting": [
      "ICH GLAUBE FAST, ICH SEHE NICHT RICHTIG!",
      "WEIL ICH DOCH GENAU WEISS...",
      "...DASS IHR BEIDEN DORT UNTEN IM PRECURSOR-BECKEN SEID",
      "UND DIE VOM DUNKLEN ECO BEFALLENEN PFLANZEN RETTET."
    ],
    "sage-bluehut-reminder-1-prec-arm": [
      "WIESO SEID IHR SCHON ZURÜCK?",
      "VON MEINEM BALKON AUS KANN ICH",
      "DEN LURKER-ZEPPELIN IMMER NOCH ÜBER DEM SUMPF SCHWEBEN SEHEN.",
      "IHR HABT EURE AUFGABE OFFENSICHTLICH NOCH NICHT ERFÜLLT.",
      "JETZT MACHT ENDLICH!"
    ],
    "sage-intro-sequence-a": [
      "MEIN LEBEN LANG HABE ICH DIE ANTWORTEN GESUCHT, DIE MEIN VATER",
      "UND MEINES VATERS VATER NIE GEFUNDEN HABEN.",
      "WER WAREN DIE PRECURSOR?",
      "WARUM ERSCHUFEN SIE DIE RIESIGEN MONOLITHEN,",
      "DIE ÜBERALL AUF UNSEREM PLANETEN VERSTREUT SIND?",
      "WIE HABEN SIE DAS ECO BEZWUNGEN, DIE LEBENSENERGIE DIESER WELT?",
      "WAS WAR IHR PLAN UND WIESO VERSCHWANDEN SIE?",
      "ICH HABE DIE PFLANZEN BEFRAGT, ABER SIE ERINNERN SICH NICHT.",
      "DIE PFLANZEN HABEN DIE FELSEN BEFRAGT, ABER DIE FELSEN WISSEN ES NICHT MEHR.",
      "NICHT EINMAL DIE FELSEN KÖNNEN SICH ERINNERN...",
      "JEDE FASER MEINES KÖRPERS SAGT MIR,",
      "DASS SICH DIE ANTWORTEN IM BESITZ EINES JUNGEN MANNES BEFINDEN,",
      "DER SICH SEINES SCHICKSALS NICHT BEWUSST IST, DEM NICHTS DARAN LIEGT,",
      "DIE WAHRHEIT ZU FINDEN, DER MEINE FÜHRUNG ABLEHNT!",
      "ABER WARUM SOLLTE ER AUCH SCHON AUF DEN ALTEN SAMOS, DEN WEISEN, HÖREN?",
      "ICH BIN JA NUR DER HERRSCHER DES GRÜNEN ECOS, EINER DER WEISESTEN MENSCHEN DER WELT!",
      "SO SCHEINT ES,",
      "DASS DIE ANTWORT NICHT ETWA DURCH SORGFÄLTIGE FORSCHUNG",
      "ODER VERNÜNFTIGES ÜBERLEGEN GEFUNDEN WIRD.",
      "OH, NEIN! WIE SO VIELE SCHICKSALHAFTE GEHEIMNISSE",
      "FÄNGT ALLES MIT EINER KLEINEN UNGEHORSAMKEIT AN.",
      "HEY! ÄH, JAK? DER GRÜNE KERL HAT UNS DOCH VERBOTEN, HIERHER ZU KOMMEN!"
    ],
    "sage-intro-sequence-d1": [
      "WAS IN GRÜNEM TEUFELSNAMEN WOLLT IHR ZWEI?",
      "WIR- WIR- WIR WAREN- DA WAR- ICH- ICH WAR-",
      "DU, SEI STILL! ANSTATT MEINEM RAT ZU FOLGEN, SEID IHR BEIDEN",
      "AN DEM EINZIGEN ORT HERUMGESTREUNT, DEN ICH EUCH VERBOTEN HATTE: DER NEBELINSEL!",
      "DAS STIMMT UND ICH, ÄH-",
      "UND DAXTER, DU HAST ENDLICH DAS ÜBERFÄLLIGE BAD GENOMMEN,",
      "ABER IN EINER WANNE VOLL MIT DUNKLEM ECO.",
      "ALSO, ALTER MANN, WILLST DU HIER JETZT RUMQUATSCHEN",
      "ODER HILFST DU MIR RAUS AUS DEM SCHLAMASSEL?!",
      "ICH WERDE WEITER HERUMQUATSCHEN, DENN ICH FINDE, DU SIEHST VIEL BESSER AUS ALS VORHER.",
      "UND AUSSERDEM... ICH KÖNNTE DIR GAR NICHT HELFEN, AUCH, WENN ICH WOLLTE.",
      "WAS?!",
      "ES GIBT NUR EINE EINZIGE PERSON, DIE DAS DUNKLE ECO LANGE GENUG ERFORSCHT HAT,",
      "UM DICH VIELLEICHT ZURÜCKZUVERWANDELN:",
      "GOL ACHERON, DER WEISE.",
      "ABER ER LEBT WEIT ENTFERNT IM NORDEN. WEIT, WEIT IM NORDEN.",
      "SEIT EWIGKEITEN HAT NIEMAND MEHR MIT IHM GESPROCHEN.",
      "ICH WÜRDE EUCH JA DORTHIN TELEPORTIEREN, ABER AUCH DAS KANN ICH NICHT.",
      "KEINER DER DREI ANDEREN WEISEN HAT ES FÜR NOTWENDIG ERACHTET,",
      "SEIN TOR ANZUSCHALTEN, SCHON SEIT LANGER ZEIT NICHT MEHR!"
    ],
    "sage-intro-sequence-d2": [
      "DER EINZIGE ANDERE WEG ZU FUSS NACH NORDEN FÜHRT DURCH DEN FEUER-CANYON,",
      "ABER DER HEISSE BODEN SCHMILZT SOGAR PRECURSOR-METALL,",
      "IHR KÖNNT DA NICHT EINFACH SO DURCHGEHEN.",
      "ABER IHR KÖNNTET DURCHFLIEGEN! WENN IHR EINEN ZOOMER MIT HITZESCHUTZSCHILD HÄTTET.",
      "ZUFÄLLIG ARBEITE ICH IM MOMENT GERADE AN SO EINER MASCHINE.",
      "MIT NUR ZWANZIG ENERGIEZELLEN HÄTTE SIE GENUG ENERGIE,",
      "UM DER HITZE DES CANYONS ZU WIDERSTEHEN. NICHT WAHR, PAPI?",
      "JA, KEIRA, DAS KÖNNTE KLAPPEN. ABER WO SOLLEN DER JUNGE",
      "UND DIE HALBE PORTION DA",
      "ZWANZIG ENERGIEZELLEN HERBEKOMMEN?",
      "VON DEN DORFBEWOHNERN!",
      "DIE MEISTEN VON DENEN HABEN IRGENDWO EIN ODER ZWEI ENERGIEZELLEN RUMLIEGEN.",
      "UND AUCH, WENN SIE SIE NICHT HERGEBEN WOLLEN,",
      "MIT EIN PAAR NETTEN PRECURSOR-ORBS KANN MAN IHRE MEINUNG SCHON ÄNDERN.",
      "UND BESTIMMT GIBT ES DRAUSSEN IN DER WILDNIS NOCH MEHR ENERGIEZELLEN,",
      "DIE NUR AUF EIN PAAR MUTIGE ABENTEURER WARTEN.",
      "NUN, EINEN MUTIGEN ABENTEURER HABEN WIR JA SCHON.",
      "MUTIGE ABENTEURER?",
      "IHR BEIDE WÜRDET OHNE ANLEITUNG NICHT MAL AUS DEM DORF RAUSFINDEN!",
      "BEVOR IHR MIT IRGENDETWAS ANFANGT, SOLLTET IHR LIEBER DURCH DAS WARPTOR GEHEN",
      "UND AM FELSGEYSIR EIN WENIG ÜBEN.",
      "ÄHM, DA GIBT'S NICHT NOCH MEHR VON DIESEM DUNKLEN ECO-ZEUGS, ODER?",
      "ICH WILL NICHT NOCHMAL REINFALLEN UND DANN SO AUSSEHEN WIE DU!",
      "REIN DA, BEVOR ICH EUCH BEIDE IN UNKRAUT VERWANDLE!"
    ],
    "sage-intro-sequence-e": [
      "GUT GEMACHT, JUNGS, ABER DAS IST NOCH GAR NICHTS IM VERGLEICH ZU DEN ABENTEUERN,",
      "DIE NOCH VOR EUCH LIEGEN.",
      "ÄH, IST GAR KEIN PROBLEM. WIR SIND GEWAPPNET, WAS, JAK?",
      "WIR WÜRDEN JA GERNE NOCH BLEIBEN UND QUATSCHEN, GRÜNER HÄUPTLING,",
      "ABER ES JUCKT UNS SCHON, AUF ABENTEUER ZU GEHEN.",
      "SCHÖN, SCHÖN. DANN STÜRZT EUCH INS ABENTEUER.",
      "UND WENN IHR SCHON BEIM \"ABENTEUERN\" SEID, MACHT EUCH DOCH EIN WENIG NÜTZLICH!",
      "MEINE VERFLIXTEN GRÜNEN ECO-SAMMLER SIND SCHON WIEDER VERSTOPFT.",
      "GEHT ANS ANDERE ENDE DES STRANDES UND REINIGT SIE, JA?",
      "FOLGT DEN LAMPEN, SIE FÜHREN EUCH GERADEWEGS DORTHIN.",
      "UND JETZT, ALLE...",
      "RAUS HIER!"
    ],
    "sage-introduction-misty-cannon": [
      "OH, IHR SEID'S, DIE GROSSEN BEZWINGER.",
      "GUT, ICH HABE DA ETWAS ERNSTES MIT EUCH ZU BESPRECHEN.",
      "ES SCHEINT, ALS SEIEN DIE LURKER AUF DER NEBELINSEL ENORM AKTIV.",
      "VON MEINEM BEOBACHTUNGSTURM AUS KANN ICH ERKENNEN,",
      "WIE SIE DIE PRECURSOR-ECO-STATION BOMBARDIEREN.",
      "FALLS SIE SIE ÖFFNEN UND DAS DUNKLE ECO FREISETZEN, WERDEN WIR AM ENDE",
      "NOCH SO HERUMLAUFEN WIE DIESE HÄSSLICHE KLEINE FLOHQUASTE HIER.",
      "JAK, WIR MÜSSEN DEINE... TAUGLICHKEIT PRÜFEN.",
      "BRING DEN FISCHER DAZU, DIR SEIN BOOT ZU LEIHEN UND FAHR ZUR NEBELINSEL.",
      "DU MUSST AUF DIE SPITZE DER PRECURSOR-ECO-STATION",
      "UND DIE VERMALEDEITE KANONE AUSSER GEFECHT SETZEN.",
      "UND WAS... IST MIT MIR?",
      "DU? DU KANNST MEINE FUSSBÖDEN WISCHEN, IN LETZTER ZEIT GLÄNZEN SIE NICHT MEHR SO SCHÖN."
    ],
    "sage-reminder-1-ecorocks": [
      "NA, IHR SEID MIR JA ZWEI TOLLE ABENTEURER!",
      "SCHON ZURÜCK",
      "UND HABT NOCH NICHT EINMAL MEINE BLOCKIERTEN ECO-ERNTER IN ORDNUNG GEBRACHT!",
      "SIE SIND AM ANDEREN ENDE DES STRANDES, JUNGS.",
      "JETZT...",
      "MACHT ENDLICH!"
    ],
    "sage-reminder-1-generic": [
      "WAS MACHT IHR DENN HIER? IHR SOLLT ENERGIEZELLEN SAMMELN!",
      "LASST MICH IN FRIEDEN, BIS IHR GENUG HABT!"
    ],
    "sage-reminder-1-misty-cannon": [
      "DAS BOMBARDMENT WIRD SCHLIMMER!",
      "SUCH DEN FISCHER IM DSCHUNGEL, HOL DIR DIE ERLAUBNIS, SEIN BOOT ZU BENUTZEN",
      "UND FAHR ZUR NEBELINSEL, UM ENDLICH DIE KANONE ZU STOPPEN.",
      "UND DU, DAXTER. FANG AN, AUFZUWISCHEN. SIEHT JA SCHLIMM AUS HIER!"
    ],
    "sage-reminder-2-generic": [
      "IHR ZWEI VERSTEHT DEN ERNST DER LAGE WOHL IMMER NOCH NICHT.",
      "HIER GEHT ES UM MEHR ALS NUR EINEN DUMMEN JUNGENSTREICH.",
      "HIER GEHT UM DAS LEBEN, SO, WIE WIR ES KENNEN.",
      "JETZT MACHT EUCH ENDLICH AUF UND STELLT EUCH EUREM SCHICKSAL."
    ],
    "sage-village3-introduction": [
      "AH! ICH FRAG' MICH JEDES MAL, OB ICH NOCH IN EINEM STÜCK AUS DIESEN DINGERN RAUSKOMME!",
      "HEILIGE YAKOW! DAS LABOR DES ROTEN WEISEN SIEHT JA NOCH SCHLIMMER AUS ALS DAS DES BLAUEN!",
      "TJA, SIEHT SO AUS, ALS HÄTTE HIER EIN KAMPF STATTGEFUNDEN.",
      "(LACHT)",
      "ICH WÜRDE ES NICHT GERADE EINEN \"KAMPF\" NENNEN, ODER, SCHWESTERHERZ?",
      "GEWISS NICHT. DER ROTE WEISE HAT SO SCHNELL AUFGEGEBEN...",
      "HAT KEINEN SPASS GEMACHT.",
      "GOL? BIST DU DAS?",
      "BIST JETZT WOHL VÖLLIG ÜBERGESCHNAPPT, WAS?",
      "UND MAIA! HAB ICH DIR NICHT GESAGT, DAS DUNKLE ECO WÜRDE EUCH BEIDE VERÄNDERN?",
      "ACH, NIE GLAUBT JEMAND DEM ALTEN SAMOS...",
      "WAS HABT IHR BEIDEN MIT DEM BLAUEN UND DEM ROTEN WEISEN GEMACHT?",
      "MACH' DIR KEINE SORGEN UM DEINE BUNTEN FREUNDE, DU ALTER NARR.",
      "SIE SIND VÖLLIG SICHER IN UNSERER ZITADELLE. UNSERE EHRENGÄSTE.",
      "SIE SIND SO LIEBENSWÜRDIG, UNS ZU HELFEN. BEI EINEM KLEINEN PROJEKT.",
      "DU HATTEST UNRECHT, SAMOS. MAN KANN DAS DUNKLE ECO KONTROLLIEREN!",
      "WIR HABEN SEINE GEHEIMNISSE GELÜFTET",
      "UND KÖNNEN NUN DIE WELT NACH UNSEREN WÜNSCHEN NEU GESTALTEN.",
      "DU KANNST DAS DUNKLE ECO NICHT EINFACH SO KONTROLLIEREN! SOGAR DIE PRECURSOR-",
      "BIS JETZT MUSSTEN WIR UNS MIT DEM BISSCHEN ECO ZUFRIEDEN GEBEN,",
      "DAS WIR AN DER ERDOBERFLÄCHE FINDEN KONNTEN.",
      "ABER BALD HABEN WIR ZUGANG ZU DEN RIESIGEN LAGERN",
      "VON DUNKLEM ECO TIEF UNTER DER ERDE.",
      "NICHT DIE SILOS!",
      "DOCH, DIE ECO-STATIONEN!",
      "WIR WERDEN SIE ÖFFNEN UND DAS DUNKLE ECO DER GANZEN WELT WIRD UNS GEHÖREN!",
      "ABER DAS IST UNMÖGLICH! NUR EIN PRECURSOR-ROBOTER-",
      "ACH, REG' DICH NICHT SO AUF, SAMOS. MIT DIR HABEN WIR NOCH GROSSE PLÄNE.",
      "(LACHT)",
      "MOMENT MAL!",
      "DAS WAR GOL?",
      "DERSELBE GOL, DER MICH ZURÜCKVERWANDELN SOLL?",
      "GOL IST DER KERL, DER UNS TÖTEN WILL?",
      "ICH BIN ERLEDIGT.",
      "WIR SIND VIELLEICHT ALLE ERLEDIGT.",
      "WENN SIE DIE SILOS ÖFFNEN, WIRD DAS DUNKLE ECO ALLES VERDERBEN UND ZERSTÖREN,",
      "WAS DAMIT IN BERÜHRUNG KOMMT!",
      "WIR MÜSSEN EINFACH IHRE ZITADELLE ERREICHEN, UM SIE AUFZUHALTEN!",
      "DER SCHNELLSTE WEG DORTHIN FÜHRT DURCH DAS LAVA-ROHR AM GRUND DIESES KRATERS.",
      "MIT EIN PAAR WEITEREN ENERGIEZELLEN MÜSSTE EUCH DAS HITZESCHILD DES ZOOMERS",
      "SICHER ÜBER DIE LAVA BRINGEN.",
      "IN ORDNUNG, MEIN JUNGE. TU, WAS DU KANNST.",
      "NIMM' DIE FLOHQUASTE MIT UND SAMMLE NOCH MEHR ENERGIEZELLEN."
    ],
    "sage-village3-introduction-dark-eco": [
      "ACH, DU HEILIGES ECO!",
      "IN DEN SPINNENHÖHLEN SCHEINEN SICH EINE GANZE MENGE LURKER ZU BEFINDEN!",
      "TOLL, HÖRT SICH JA RICHTIG GEMÜTLICH AN.",
      "LASS MICH RATEN. ES GIBT SPINNEN IN DEN SPINNENHÖHLEN, RICHTIG?",
      "NATÜRLICH GIBT ES SPINNEN IN SPINNENHÖHLEN!",
      "ABER DAS IST EUER KLEINSTES PROBLEM!",
      "DIE LURKER SIND HINTER KRISTALLEN AUS KONZENTRIERTEM DUNKLEN ECO HER.",
      "IHR MÜSST DIE KRISTALLE ZERSTÖREN, BEVOR DIESE MONSTER SIE IN DIE FINGER BEKOMMEN!",
      "NA LOS, JETZT!"
    ],
    "sage-village3-introduction-rams": [
      "ICH BIN FROH, DASS IHR ZWEI HIER SEID. ES GIBT LURKER-AKTIVITÄTEN IN DEN BERGEN.",
      "SCHEINBAR HABEN SIE EINIGE EINGEFRORENE DUNKLE ECO-VORRÄTE IN DEN GLETSCHERN ENTDECKT,",
      "DIE SIE JETZT ZU BERGEN VERSUCHEN.",
      "WÄHREND IHR DA OBEN NACH ENERGIEZELLEN SUCHT, HALTET DOCH BITTE DIE LURKER AUF",
      "UND GOL DAVON AB, NOCH MEHR DUNKLES ECO IN DIE FINGER ZU BEKOMMEN."
    ],
    "sage-village3-reminder-1-dark-eco": [
      "IHR MÜSST DIE DUNKLEN ECO-KRISTALLE IN DEN SPINNENHÖHLEN ZERSTÖREN!"
    ],
    "sage-village3-reminder-1-rams": [
      "WIR DÜRFEN NICHT ZULASSEN, DASS DIE LURKER DIE DUNKLEN ECO-KANISTER BEKOMMEN.",
      "BEGEBT EUCH AUF DIESEN VERSCHNEITEN GIPFEL UND HALTET SIE AUF!"
    ],
    "sculptor-introduction": [
      "HEY... DU HAARIGER KLEINER KUMPEL!",
      "OH... ICH DACHTE, DU WÄRST MEINE MUSE.",
      "DEINE WAS?",
      "HAST DU NOCH NIE EINE MUSE GESEHEN?",
      "DAS IST EIN KLEINES LEUCHTENDES EICHHÖRNCHEN,",
      "SO GROSS WIE DU, SEHR MUTIG UND IMMER GUT DRAUF!",
      "OH, JETZT KAPIER ICH! WIE EIN KUMPELCHEN, HÄ?",
      "ALSO, ES IST SO: OHNE MEINE MUSE KANN ICH NICHT BILDHAUERN.",
      "ABER WENN SIE DA IST, SEHE ICH NUR SCHÖNHEIT IN ALLEN DINGEN, WISST IHR?",
      "IM MOMENT KÖNNTE ICH MICH NICHT MAL AUS 'NER KISTE RAUSMEISSELN.",
      "ICH GLAUBE, SIE IST ZUR NEBELINSEL GELAUFEN.",
      "ACH, ICH HOFFE BLOSS, IHR GEHTS GUT.",
      "EINE ENERGIEZELLE, WENN IHR SIE ZURÜCKBRINGT!",
      "MOMENT MAL! WIR WERDEN AUF KEINEN FALL ZURÜCK ZUR NEBELINSEL GEHEN!",
      "ODER DOCH?"
    ],
    "sculptor-reminder-1": [
      "OH, HEY, LEUTE! HABT IHR MEINE MUSE SCHON GEFUNDEN?"
    ],
    "sculptor-resolution": [
      "OH, MEINE MUSE! IHR HABT SIE GERETTET! OH, MANN, IHR SEID DIE GRÖSSTEN!",
      "HIER, NEHMT DIESE ENERGIEZELLE,",
      "ICH BRAUCHE SIE NICHT MEHR, MEINE INSPIRATION IST WIEDER DA!"
    ],
    "sidekick-human-intro-sequence-b": [
      "SUCHT WEITER NACH ARTEFAKTEN UND NACH ECO.",
      "WENN DIE EINWOHNER PRECURSOR-GEGENSTÄNDE BESITZEN:",
      "IHR WISST, WAS ZU TUN IST.",
      "BESTRAFT JEDEN HART, DER DAS DORF VERLÄSST.",
      "WIR WERDEN ZUR RECHTEN ZEIT ANGREIFEN."
    ],
    "sidekick-human-intro-sequence-c": [
      "WAS WOLLEN WIR ÜBERHAUPT HIER, JAK? MIR LÄUFT'S HIER KALT DEN RÜCKEN RUNTER!",
      "AH!",
      "BLÖDER PRECURSOR-SCHROTT!",
      "UAH! WAS IST DAS FÜR DUNKLES ZEUG DA? SIEHT JA NICHT GERADE EINLADEND AUS.",
      "DER WEISE PLAPPERT STÄNDIG ÜBER DIE PRECURSOR, DIE DAS ZEUG HIER ERBAUT HABEN.",
      "\"WOHIN SIND SIE GEGANGEN? WARUM ERBAUTEN SIE DIESEN SCHROTT?\"",
      "ICH MAG PRECURSOR-ORBS UND ENERGIEZELLEN GENAU SO WIE JEDER ANDERE,",
      "ABER WENN DU MICH FRAGST, WAREN DAS SCHON ECHTE LOSER.",
      "AH! WIE HAST DU DAS GEMACHT?",
      "JAK, ICH GLAUB', ES GIBT ÄRGER!",
      "MANN, WAR DAS HEISS.",
      "WIR HÄTTEN NIE HERKOMMEN SOLLEN, HÄTTEST DU AUF MICH GEHÖRT, DANN...",
      "WAS?",
      "AAAAAAAAHHHHHHHH!!",
      "OKAY, OKAY. ALLES KLAR, MIR GEHT'S GUT...",
      "AAAAAAAAHHHHHHHH!!"
    ],
    "warrior-introduction": [
      "OH... MEIN KOPF TUT SO WEH.",
      "NA, IST BESTIMMT KEIN WICHTIGES KÖRPERTEIL BEI DIR!",
      "MACH' DICH LOCKER, HARTER BURSCHE!",
      "JA, ICH WAR EINMAL EIN HARTER BURSCHE.",
      "VIELLEICHT SOGAR DER HÄRTESTE.",
      "FAST EIN JAHR LANG HAB' ICH DIESES DORF GANZ ALLEIN",
      "GEGEN DIESE SCHEUSSLICHEN KREATUREN VERTEIDIGT!",
      "DOCH DANN KAM DIESES SCHRECKLICHE MONSTER UND BOMBARDIERTE UNS MIT FELSBROCKEN.",
      "MIT GLÄNZENDER RÜSTUNG KLETTERTE ICH TAPFER DEN HÜGEL HINAUF,",
      "UM ES ZUM KAMPF AUFZUFORDERN!",
      "ABER ES HAT MICH WINDELWEICH GEKLOPFT, WIE EIN YAKOW-STEAK.",
      "DANN GREIF'S DOCH MAL MIT DEINEM GEJAMMER AN!",
      "DAS IST ECHT TÖDLICH!",
      "NACH MEINER LETZTEN BITTEREN NIEDERLAGE",
      "HAT ES DEN DURCHGANG ZU SEINEM UNTERSCHLUPF",
      "MIT EINEM 30-TONNEN-FELSBLOCK VERSPERRT,",
      "SODASS MAN ES NUN NICHT MEHR ANGREIFEN KANN.",
      "DESHALB ERFAND UNSER WEISER MANN, MEISTER DES BLAUEN ECOS UND GENIE DER MECHANIK,",
      "EINE MASCHINE, UM DEN FELSBLOCK WEGZURÄUMEN!",
      "DOCH BEVOR WIR SIE EINSCHALTEN KONNTEN, VERSCHWAND ER",
      "UND NAHM LEIDER ALLE SEINE ENERGIEZELLEN MIT.",
      "WENIGSTENS HAB' ICH GENUG PONTONS AUS DER BRÜCKE ENTFERNT,",
      "SO KANN DAS MONSTER NICHT HIER HERUNTERKOMMEN UND MIR WEHTUN.",
      "JA, GANZ, GANZ TOLL GEMACHT, MANN. ABER...",
      "DU MUSST SIE, ÄH... WIEDER IN DIE BRÜCKE EINSETZEN, OKAY?",
      "OH, NA KLAR. DA KANN ICH MIR JA GLEICH 'N STRICK NEHMEN!",
      "(SEUFZT)",
      "NA SCHÖN, OKAY.",
      "BRINGT MIR 90 PRECURSOR-ORBS UND ICH GEBE DIE PONTONS WIEDER FREI.",
      "ABER ICH KÄMPFE NICHT NOCH EIN MAL MIT DIESEM MONSTER!"
    ],
    "warrior-reminder-1": [
      "LASST EUCH RUHIG ZEIT BEIM BESORGEN DER PRECURSOR-ORBS.",
      "ICH HABE NICHT VOR, DIE PONTON-BRÜCKE SO BALD ZU REPARIEREN."
    ],
    "warrior-resolution": [
      "OH.",
      "DAS IST JA TOLL.",
      "IHR HABT MIR DIE PRECURSOR-ORBS GEBRACHT.",
      "NA SCHÖN.",
      "ICH REPARIERE DIE BRÜCKE.",
      "ABER MIT DIESEM MONSTER MÖCHTE ICH NICHTS MEHR ZU TUN HABEN!"
    ],
    "yellowsage-resolution": [
      "WER HÄTTE GEDACHT, DASS ICH MICH EINES TAGES",
      "VON EINEM JUNGEN UND SEINER RATTE RETTEN LASSEN MÜSSTE!",
      "AHHH, DIESE PEINLICHKEIT WERDE ICH GOL UND MAIA GANZ SICHER HEIMZAHLEN!",
      "DANACH KÖNNEN WIR UNS JA UM DEN RATTENEINTOPF KÜMMERN..."
    ]
  },
  "hints": {
    "ASSTLP02": [
      "HMM, ICH MUSS DEN HITZESCHILD HIER IN GANG KRIEGEN..."
    ],
    "ASSTLP03": [
      "WIR BRAUCHEN ENERGIEZELLEN, UM DEN HITZESCHILD ZU AKTIVIEREN..."
    ],
    "ASSTLP23": [
      "WIE HAT ER BLOSS DIESE SCHWEBEMASCHINE ZUM FUNKTIONIEREN GEBRACHT?"
    ],
    "ASSTLP24": [
      "OB UNS ALL DIESE ZELLEN AUCH GENUG ENERGIE LIEFERN WERDEN?"
    ],
    "ASSTLP30": [
      "HM, MAL SEHEN..."
    ],
    "ASSTLP31": [
      "HMM."
    ],
    "ASSTLP33": [
      "AHA!"
    ],
    "ASSTLP34": [
      "HMM... WAS HABEN GOL UND MAIA BLOSS VOR?"
    ],
    "ASSTLP35": [
      "HMM... WIR MÜSSEN UNBEDINGT ZUR PRECURSOR-STADT."
    ],
    "ASSTLP36": [
      "HMM... DER HITZESCHILD BRAUCHT NOCH MEHR ENERGIE, UM DER LAVA STANDZUHALTEN."
    ],
    "ASSTLP37": [
      "ACH... WIR MÜSSEN DIE ANDEREN WEISEN RETTEN!"
    ],
    "BIL-AM01": [
      "MM-HMM, ICH LIEBE DIESEN SCHLAMM."
    ],
    "BIL-AM02": [
      "VERDAMMTE SUMPFRATTE."
    ],
    "BIL-AM03": [
      "JETZT BRAUCHE ICH EINEN ORDENTLICHEN SCHLUCK VON MAMAS MEDIZIN."
    ],
    "BIL-AM04": [
      "JIPPIE!"
    ],
    "BIL-AM05": [
      "ICH BRAUCHE JETZT MEINE BRAUNE MEDIZIN."
    ],
    "BIL-AM06": [
      "ICH BRAUCH' WAS ZUM ABKÜHLEN."
    ],
    "BIL-AM07": [
      "VERDAMMTE HITZE... MICH JUCKT'S ÜBERALL."
    ],
    "BIL-AM08": [
      "VERDAMMT... VON DIESER HITZE KRIEG' ICH NOCH AUSSCHLAG."
    ],
    "BIL-AM1A": [
      "MM-HMM! ICH LIEBE DIESEN SCHLAMM!"
    ],
    "BIL-AM2A": [
      "VERDAMMTE SUMPFRATTE!"
    ],
    "BIL-AM2B": [
      "VERDAMMTE SUMPFRATTE!"
    ],
    "BIL-LO02": [
      "KOMM-KOMM-KOMM-KOMM!"
    ],
    "BIL-LO03": [
      "FARTHY!"
    ],
    "BIL-LO2A": [
      "KOMM JETZT HER, KOMM!"
    ],
    "BIL-LO2B": [
      "KOMM! KOMM!"
    ],
    "BIL-TA01": [
      "ERSCHIESS SIE!"
    ],
    "BIL-TA02": [
      "GUTER SCHUSS!"
    ],
    "BIL-TA03": [
      "DA DRÜBEN!"
    ],
    "BIL-TA04": [
      "VERDAMMT!"
    ],
    "BIL-TA05": [
      "'NE RATTE HAT DAS FRESSEN!"
    ],
    "BIL-TA06": [
      "UND NOCH EINE..."
    ],
    "BIL-TA07": [
      "NUR NOCH EINE ÜBRIG..."
    ],
    "BIL-TA08": [
      "VOLLTREFFER."
    ],
    "BIL-TA1A": [
      "ERSCHIESS SIE!"
    ],
    "BIL-TA2A": [
      "GUTER SCHUSS!"
    ],
    "BIL-TA3A": [
      "DA DRÜBEN!"
    ],
    "BIL-TA4A": [
      "OH, VERDAMMT!"
    ],
    "BIL-TA4B": [
      "VERDAMMT!"
    ],
    "BIL-TA5A": [
      "'NE RATTE HAT DAS FRESSEN!"
    ],
    "BIR-AM01": [
      "SEID IHR SCHON BEIM EI?"
    ],
    "BIR-AM02": [
      "JA, DA! EIN STÜCKCHEN WEITER NOCH!"
    ],
    "BIR-AM03": [
      "GUT, UND JETZT SCHUBST ES, ABER SACHTE!"
    ],
    "BIR-AM04": [
      "OH, JE, DAS WAR ABER NICHT SACHTE!"
    ],
    "BIR-AM05": [
      "NA LOS, SCHUBST DAS EI VON DER KLIPPE!"
    ],
    "BIR-AM06": [
      "OH!"
    ],
    "BIR-AM07": [
      "HIER, VÖGELCHEN! HIER, VÖGELCHEN!"
    ],
    "BIR-AM08": [
      "HIER, MEIN VÖGELCHEN!"
    ],
    "BIR-AM09": [
      "SEID VORSICHTIG, DA OBEN IST'S GEFÄHRLICH!"
    ],
    "BIR-AM10": [
      "VORSICHTIG, GANZ RUHIG, JETZT!"
    ],
    "BIR-AM11": [
      "GUT GEMACHT! WIR TREFFEN UNS HIER UNTEN BEIM EI!"
    ],
    "BIR-AM12": [
      "DU MUSST EIN WAHRER TIERFREUND SEIN!"
    ],
    "BIR-AM13": [
      "SEHT IHR DA OBEN NOCH ANDERE VÖGEL?"
    ],
    "BIR-LO01": [
      "(KUSS) (PFEIFEN)"
    ],
    "BIR-LO02": [
      "OH, SO EIN HÜBSCHES DING!"
    ],
    "BIR-LO03": [
      "SIEH MAL AN, EIN MUCKY-MUCK."
    ],
    "BIR-am08": [
      "HIER, MEIN VÖGELCHEN..."
    ],
    "BLU-AM01": [
      "ETWAS HILFE WÄRE NICHT SCHLECHT!"
    ],
    "BLU-AM02": [
      "OH, DAS IST JA EIN SCHÖNES SCHLAMASSEL!"
    ],
    "BLU-AM03": [
      "OH, WAS FÜR EIN RÄTSEL."
    ],
    "CHI-AM01": [
      "OH, WAS FÜR EINE KATASTROPHE, EINE KATASTROPHE!"
    ],
    "CHI-AM02": [
      "JETZT WOLLEN SIE AUCH NOCH, DASS ICH IN DEN DSCHUNGEL GEHE - I-ICH!...",
      "DA KÄMPFE ICH LIEBER MIT 'NEM WÜTENDEN FLUT-FLUT!"
    ],
    "CHI-AM03": [
      "...E-ERST GREIFT EIN M-MONSTER DAS BOOT DES FISCHERS AN U-UND JETZT - JETZT DAS...",
      "WAS - W-WAS KANN DENN SONST NOCH SCHIEFGEHEN?"
    ],
    "CHI-AM04": [
      "ÄHM... I-ICH, ÄHM... ICH... ÄHM...",
      "VIELLEICHT BESEITIGT EINE... Ä-ÄHM... STEUERERHÖHUNG DIESEN SCHLAMASSEL?"
    ],
    "CHI-AM05": [
      "PROBLEME... PROBLEME... PROBLEME!"
    ],
    "CHI-AM06": [
      "(SCHLUCHZT) JETZT WERDE ICH BESTIMMT NICHT WIEDERGEWÄHLT..."
    ],
    "CHI-AM07": [
      "(JAMMERT) WAS IST MIT DEM ENERGIESTRAHL DES DORFES GESCHEHEN?"
    ],
    "CHI-AM08": [
      "(JAMMERT) WARUM...?"
    ],
    "CHI-LO01": [
      "...WINDMÜHLE, MONSTER, STROM, WIEDERWAHLEN..."
    ],
    "CHI-LO02": [
      "...W-WAHLEN, MONSTER, WIEDERWAHLEN..."
    ],
    "EXP-AM01": [
      "ICH MUSS BALD ZU MEINER REISE AUFBRECHEN, ICH BRAUCHE PRECURSOR-ORBS!"
    ],
    "EXP-AM02": [
      "HM, MAL SEHEN, WO SOLL ICH ZUERST HIN?"
    ],
    "EXP-AM03": [
      "AH, ICH VERMISSE DIE LANDSTRASSE."
    ],
    "EXP-AM04": [
      "ES GIBT SO VIEL ZU SEHEN UND SO WENIG ZEIT DAFÜR."
    ],
    "EXP-AM05": [
      "HMPF, ZU MEINER ZEIT KONNTE MAN NOCH REISEN, OHNE VON MONSTERN ANGEGRIFFEN ZU WERDEN!"
    ],
    "EXP-LO02": [
      "ICH BRAUCHE MEHR PRECURSOR-ORBS."
    ],
    "EXP-LO1A": [
      "(MURMELT)"
    ],
    "FAR-AM01": [
      "(SCHNARCHT) HIER, BESSIE... HIER, BESSIE BESSIE... MEIN MÄDCHEN..."
    ],
    "FAR-AM02": [
      "MUSS DIE ERNTE EINBRINGEN, BEVOR DIE JUNEKÄFER SIE HOLEN..."
    ],
    "FAR-AM2A": [
      "MUSS DIE ERNTE EINBRINGEN, BEVOR DIE JUNEKÄFER SIE HOLEN..."
    ],
    "FAR-LO01": [
      "(SCHNARCHT)"
    ],
    "FAR-LO1A": [
      "(SCHNARCHT)"
    ],
    "FIS-AM01": [
      "GRR, THESE DARN FISH... I NEVER CATCH ME A SINGLE ONE."
    ],
    "FIS-AM02": [
      "DIE MONSTER, DIE'N STÜCK AUS'M BOOT RAUSGEBISSEN HABEN, WERDEN MICH NOCH RUINIEREN."
    ],
    "FIS-AM03": [
      "VERFLUCHTE MISTDINGER!",
      "KOMMT IN'S KÖRBCHEN, BLÖDE FISCHE...",
      "HE, HE, HE, HE, HE..."
    ],
    "FIS-AM04": [
      "TJA, ICH LIEB' DEN GERUCH VON FISCH AM MORGEN."
    ],
    "FIS-AM05": [
      "TJA, ALSO, JETZT KÖNNT' ICH 'N SALZFISCH AUF ROGGENBROT VERTRAGEN."
    ],
    "FIS-AM06": [
      "HMM, DAS WAR VIELLEICHT 'N RIESE, DER MIT DA ABGEHAUEN IS'..."
    ],
    "FIS-LO01": [
      "(MURMELT) SO WAS..."
    ],
    "FIS-LO03": [
      "(LACHT)"
    ],
    "FIS-LO04": [
      "BLÖDE FISCHE... WOLLEN EINFACH NICH' IN MEIN NETZ!"
    ],
    "FIS-LO05": [
      "(LACHT)"
    ],
    "FIS-TA01": [
      "NACH LINKS!"
    ],
    "FIS-TA02": [
      "NACH RECHTS!"
    ],
    "FIS-TA03": [
      "DA KOMMT'N GROSSER!"
    ],
    "FIS-TA04": [
      "DIR IS'N RIESEN KERL ERWISCHT!"
    ],
    "FIS-TA05": [
      "LASS SO EINEN NICHT NOCHMA' DURCH!"
    ],
    "FIS-TA06": [
      "RUHIG, JUNGE."
    ],
    "FIS-TA07": [
      "DEINE SEGEL HÄNGEN IM WIND, JUNGCHEN."
    ],
    "FIS-TA08": [
      "AH, ENTWISCHT!"
    ],
    "FIS-TA09": [
      "DU KÖNNTEST EIN GRÖSSERES NETZ BRAUCHEN."
    ],
    "FIS-TA10": [
      "WIEDER VORBEI!"
    ],
    "FIS-TA11": [
      "RUHIG HALTEN! HAST'S FAST GESCHAFFT!"
    ],
    "FIS-TA1A": [
      "LINKS!"
    ],
    "FIS-TA2A": [
      "RECHTS!"
    ],
    "GAM-AM01": [
      "HEY, EINE ZWANZIG-ZU-EINS CHANCE IST NICHT SO SCHLECHT!"
    ],
    "GAM-AM02": [
      "ACH, ES WAR 'NE SICHERE SACHE!"
    ],
    "GAM-AM03": [
      "HEHEHEHE... NÄCHSTES MAL WERD' ICH DEN JACKPOT KNACHEN!"
    ],
    "GAM-AM04": [
      "ACH, WENN ICH NUR EINEN ORB FÜR JEDE VERPASSTE CHANCE BEKOMMEN WÜRDE..."
    ],
    "GAM-AM05": [
      "NAJA, VIELLEICHT KOMMEN FÄSSER JA WIEDER IN MODE!"
    ],
    "GAM-AM06": [
      "OH, ICH BRAUCH' NE GLÜCKSSTRÄHNE."
    ],
    "GAM-AM07": [
      "AH, WIE STEHEN DIE WETTEN, DASS ICH MICH NICHT IN DIE BELAGERTE STADT TRAUE?"
    ],
    "GAM-AM08": [
      "ICH DACHTE, DAS WAR EIN GUTER TIPP!"
    ],
    "GAM-AM09": [
      "NEUER TAG, NEUE WETTE."
    ],
    "GAM-AM10": [
      "WETTEN, KEINER KANN'S MIT DIESEM MONSTER AUFNEHMEN?"
    ],
    "GAM-AM11": [
      "HAHA, ICH HOL' MIR MEIN GELD UND ZIEHE WEITER."
    ],
    "GAM-AM12": [
      "NAJA, MAN KANN NICHT IMMER GEWINNEN."
    ],
    "GAM-AM13": [
      "HEY, WARUM LACHT IHR? FINDET IHR DAS ETWA LUSTIG?"
    ],
    "GEO-AM01": [
      "HMM, INTERESSANTE SCHICHT..."
    ],
    "GEO-AM02": [
      "ARME KLEINE MAULWÜRFE..."
    ],
    "GEO-AM03": [
      "INTERESSANT..."
    ],
    "GEO-AM04": [
      "VIEL GLÜCK, JUNGS!"
    ],
    "GEO-AM05": [
      "GEMEINE LURKER..."
    ],
    "GEO-AM06": [
      "AUCH STEINE HABEN GEFÜHLE..."
    ],
    "GEO-AM07": [
      "HALTET DURCH, IHR KLEINEN!"
    ],
    "GEO-AM08": [
      "JETZT KANN ICH MICH WIEDER MEINER FORSCHUNG WIDMEN!"
    ],
    "GEO-LO01": [
      "ICH MUSS ZU MEINER FORSCHUNGSARBEIT ZURÜCK."
    ],
    "GEO-LO02": [
      "HMM, DIESER STEIN IST SEHR ALT..."
    ],
    "GOL-AM01": [
      "IHR GEBT EINFACH NICHT AUF, WAS?"
    ],
    "GOL-AM02": [
      "BALD GEHÖRT DAS DUNKLE ECO UNS!"
    ],
    "GOL-AM03": [
      "ERLEDIGT SIE!"
    ],
    "GOL-AM04": [
      "FEUER FREI!"
    ],
    "GOL-AM05": [
      "JAGT SIE IN DIE LUFT!"
    ],
    "GOL-AM06": [
      "WAS? DIE SCHON WIEDER?!"
    ],
    "GOL-AM07": [
      "ES IST ZU SPÄT!"
    ],
    "GOL-AM08": [
      "IHR GEHÖRT MIR!"
    ],
    "GOL-AM09": [
      "JETZT HABE ICH EUCH!"
    ],
    "GOL-AM10": [
      "HA, HA, HA, HA, HA!"
    ],
    "GOL-AM11": [
      "KEINE GNADE!"
    ],
    "GOL-AM12": [
      "NIMM DAS!"
    ],
    "GOL-AM13": [
      "NETTER VERSUCH!"
    ],
    "GOL-AM14": [
      "HALT STILL!"
    ],
    "GOL-AM15": [
      "ERBÄRMLICH!"
    ],
    "GOL-AM16": [
      "NEEEIN!"
    ],
    "GOL-AM18": [
      "WIR WERDEN DIE ECO-STATION GANZ ÖFFNEN UND EUCH ZWEI VERNICHTEN!"
    ],
    "GOL-AM19": [
      "HELLES ECO! ES EXISTIERT ALSO WIRKLICH!"
    ],
    "GOL-AM20": [
      "DAS LASSEN WIR UNS NICHT GEFALLEN!"
    ],
    "MAI-AM01": [
      "ERLEDIGE SIE BEIDE, EIN FÜR ALLE MAL!"
    ],
    "MAI-AM02": [
      "MACH SIE FERTIG!"
    ],
    "MAI-AM03": [
      "HA, HA, HA!"
    ],
    "MAI-AM04": [
      "ECO HILFT EUCH JETZT NICHT MEHR!"
    ],
    "MAI-AM05": [
      "TU DOCH WAS!"
    ],
    "MAI-AM06": [
      "AAAAH!"
    ],
    "MAI-AM07": [
      "NEEEEEIN!"
    ],
    "MAI-AM08": [
      "WIR WERDEN DIE ECO-STATION GANZ ÖFFNEN UND EUCH ZWEI VERNICHTEN!"
    ],
    "MAI-AM09": [
      "SIE DÜRFEN ES NICHT BEKOMMEN!"
    ],
    "MIN-LO01": [
      "BALD WERDE ICH REICH SEIN...",
      "ÄH, DU MEINST, WIR WERDEN REICH SEIN.",
      "JA, WIE AUCH IMMER."
    ],
    "MIN-LO03": [
      "GRAB, WILLARD, GRAB!",
      "JA, DOCH, ABER WARUM GRÄBST DU DENN NICHT?",
      "ICH, ÄH, MUSS DOCH DAS, ÄH, DENKEN ÜBERNEHMEN!"
    ],
    "MIN-LO04": [
      "ÄH, GORDY? KANN ICH DAS GRABEN MAL KURZ UNTERBRECHEN?",
      "MANN, ICH BRECH' DIR GLEICH WAS! GRAB WEITER!"
    ],
    "MIN-LO05": [
      "OH, ICH BIN AM VERHUNGERN, GORDY!",
      "DANN FRISS DEINEN VOGEL!"
    ],
    "MIN-LO06": [
      "ÄH, GORDY? ICH BRAUCH' 'NE SPITZERE HACKE!",
      "WAS DU BRAUCHST, IST MEHR GRIPS!"
    ],
    "MSH-AM01": [
      "HAHA, ICH WERDE REICH SEIN!"
    ],
    "MSH-AM02": [
      "GRABE, GRABE, GRABE!"
    ],
    "MSH-AM03": [
      "WILLARD! DENK' NICHT, ARBEITE!"
    ],
    "MSH-AM04": [
      "(LACHT) ICH WERDE DER REICHSTE MANN DER WELT SEIN! (LACHT)"
    ],
    "MSH-AM05": [
      "OHH! SO EINEN RIESIGEN EDELSTEIN HAT NOCH NIEMAND GESEHEN! (LACHT)"
    ],
    "MSH-AM06": [
      "WOHLSTAND, ICH KOMME!"
    ],
    "MSH-AM07": [
      "MEINE EDELSTEINE! ALLES MEINE EDELSTEINE!"
    ],
    "MSH-AM09": [
      "ACH, WIE VIEL GELD ICH FÜR DIESES BABY BEKOMMEN WERDE! (LACHT)"
    ],
    "MSH-AM10": [
      "SIEHT AUS WIE EIN SELTENER CRYSTITE ZLARCONIA!"
    ],
    "MSH-AM11": [
      "NICHT SO SCHNELL, DIE GEHÖREN ALLE MIR! MIR, SAG' ICH!"
    ],
    "MSH-AM12": [
      "UND, WILLARD? WAS WIRST DU DENN MIT DEINEM VIERTEL - ÄH, DEINER HÄLFTE, ANFANGEN?"
    ],
    "MSH-AM1A": [
      "ICH WERDE REICH SEIN!"
    ],
    "MSH-AM2A": [
      "GRABE, GRABE, GRABE!"
    ],
    "MSH-AM3A": [
      "WILLARD, DENK' NICHT, ARBEITE!"
    ],
    "MTA-AM01": [
      "ÄH, SIND WIR BALD FERTIG?"
    ],
    "MTA-AM02": [
      "ÄH, MANN, KÖNNEN WIR MAL 'NE PAUSE MACHEN?"
    ],
    "MTA-AM03": [
      "JUNGE, HAB' ICH 'N HUNGER!"
    ],
    "MTA-AM04": [
      "(RIECHT) ÄH, ICH GLAUBE, ICH MUSS BIRDIES KÄFIG MAL WIEDER SAUBER MACHEN."
    ],
    "MTA-AM05": [
      "DAS IST ABER EIN SCHRECKLICH GROSSER EDELSTEIN!"
    ],
    "MTA-AM06": [
      "ÄHM... ICH WOLLTE SCHON IMMER HOLZFÄLLER WERDEN..."
    ],
    "MTA-AM07": [
      "WOW, GORDY HAT MIR DIE HÄLFTE VON ALLEM VERSPROCHEN, WAS ICH TRAGEN KANN!"
    ],
    "MTA-AM08": [
      "HAHA, BIRDIE IST MEIN BESTER FREUND!"
    ],
    "MTA-AM09": [
      "ICH LIEBE MEINEN KLEINEN BIRDIE!"
    ],
    "RED-AM01": [
      "IST DA IRGENDJEMAND?"
    ],
    "RED-AM02": [
      "TJA..."
    ],
    "RED-AM03": [
      "WAS HAT EUCH AUFGEHALTEN?"
    ],
    "SAGELP03": [
      "DIESE BEIDEN KÖNNTEN NOCH NICHT EINMAL IHRE EIGENEN OHREN FREIBEKOMMEN..."
    ],
    "SAGELP04": [
      "ER WIRD SEINEM ONKEL NIE DAS WASSER REICHEN KÖNNEN,",
      "GANZ GLEICH, WAS DIE ANDEREN BEHAUPTEN."
    ],
    "SAGELP05": [
      "HALLO, BLAUER WEISER? HALLO? WO ZUM TEUFEL KANN ER NUR SEIN?!"
    ],
    "SAGELP06": [
      "ACH, DU MEINE GÜTE..."
    ],
    "SAGELP11": [
      "HALLO? IRGENDJEMAND, BITTE MELDEN!"
    ],
    "SAGELP20": [
      "HMM... HMM... HMM... HMM..."
    ],
    "SAGELP21": [
      "MAN MUSS DIESE LURKER AUFHALTEN."
    ],
    "SAGELP22": [
      "VERSTEHE..."
    ],
    "SAGELP23": [
      "NEIN..."
    ],
    "SAGELP24": [
      "WAS KANN IHM NUR ZUGESTOSSEN SEIN?"
    ],
    "SAGELP31": [
      "DAS IST GAR NICHT GUT."
    ],
    "SAGELP32": [
      "DUNKLE ECO-KRISTALLE?"
    ],
    "SAGELP33": [
      "MAIA UND GOL STECKEN BIS ÜBER BEIDE OHREN DRIN!"
    ],
    "SAGELP34": [
      "DIE KRÄFTE DES DUNKLEN ECOS LASSEN SICH NICHT KONTROLLIEREN!"
    ],
    "SAGELP35": [
      "DUNKLES ECO IN DEN GLETSCHERN?"
    ],
    "SAGELP36": [
      "ACH! DA SIND LURKER-TRUPPEN IN DEN BERGEN!"
    ],
    "SAGELP37": [
      "WAS HAT GOL NUR VOR...?"
    ],
    "SAGELP38": [
      "HAT ER VIELLEICHT...?"
    ],
    "SCU-AM01": [
      "ACH... ICH KANN ES EINFACH NICHT MEHR."
    ],
    "SCU-AM02": [
      "ACH, HÄTTE ICH DOCH BLOSS EINE INSPIRATION."
    ],
    "SCU-AM03": [
      "ICH BIN SO INSPIRIERT WIE... DIESER FELS."
    ],
    "SCU-AM04": [
      "ACH... WO IST BLOSS MEINE MUSE?"
    ],
    "SCU-AM05": [
      "ICH KANN SO NICHT ARBEITEN!"
    ],
    "SCU-AM06": [
      "OH, MANN... OB SIE WOHL JE ZU MIR ZURÜCKKOMMT?"
    ],
    "SCU-LO01": [
      "ACH..."
    ],
    "SKSP009F": [
      "SCHNAPP' DIR WELCHE! SCHNAPP' DIR WELCHE, HA, HA, HA!"
    ],
    "WAR-LO1A": [
      "(HEULT)"
    ],
    "WAR-LO1B": [
      "(HEULT)"
    ],
    "WAR-LO1C": [
      "(HEULT)",
      "(HEULT) NEIN, NEIN, NEIN, NEIN..."
    ],
    "YEL-AM01": [
      "DIE ZEIT WIRD KNAPP!"
    ],
    "YEL-AM02": [
      "HEY! HOLT MICH HIER RAUS!"
    ],
    "YEL-AM03": [
      "WENN ICH HIER RAUSKOMME, DANN IST ABER JEMAND FÄLLIG!"
    ],
    "asstv100": [
      "OKAY, IHR HABT GENUG ENERGIEZELLEN, UM DIE STÄRKE DES HITZESCHILDES ZU ERHÖHEN.",
      "FAHRT MIT DER HÖLZERNEN LORE DEN SCHACHT AM LAVA-GEYSIR HINUNTER.",
      "ICH TREFFE EUCH AM EINGANG DES LAVA-ROHRS, DAMIT ICH DEN ZOOMER EINSTELLEN KANN. BEEILT EUCH!"
    ],
    "asstv101": [
      "HAHA, OKAY! IHR HABT GENUG ENERGIEZELLEN, UM DIE STÄRKE DES HITZESCHILDES ZU ERHÖHEN!",
      "TREFFT EUCH AM VULKANKRATER WIEDER MIT MIR,",
      "ICH WERDE AM LAVA-ROHR UNTEN AM SCHACHT BEIM LAVA-GEYSIR WARTEN.",
      "BRINGT MIR DIE ENERGIEZELLEN!"
    ],
    "asstv102": [
      "BEEILT EUCH MIT DEN ENERGIEZELLEN!",
      "ICH WARTE AM SCHACHT DER HÖLZERNEN LORE IN DER NÄHE DES LAVA-GEYSIRS."
    ],
    "asstv103": [
      "VERGESST NICHT, DAS TELEPORTTOR EINZUSCHALTEN, DAMIT WIR DURCH KÖNNEN.",
      "IHR MÜSST INS LABOR DES ROTEN WEISEN",
      "IM ZENTRUM DES VULKANKRATERS GEHEN, UM ES EINZUSCHALTEN.",
      "WIR KÖNNEN NICHT DURCH, SOLANGE ES NICHT EINGESCHALTET IST."
    ],
    "asstv104": [
      "HEY, WIR SIND IMMER NOCH IN FELSDORF!",
      "SCHALTET DAS TELEPORTTOR EIN!"
    ],
    "asstv105": [
      "WIR WOLLEN ZU EUCH IN DEN VULKANKRATER KOMMEN!",
      "GEHT INS LABOR DES ROTEN WEISEN UND SCHALTET DAS TOR EIN!"
    ],
    "asstva73": [
      "HEY, JUNGS! NACH MEINEN BERECHNUNGEN BRAUCHT MAN 72 ENERGIEZELLEN, UM DEN HITZESCHILD",
      "GEGEN DIE LAVA AUF DEM WEG ZU GOL UND MAIAS ZITADELLE ZU WAPPNEN."
    ],
    "asstva74": [
      "IHR HABT NICHT GENUG ENERGIEZELLEN, UM DURCH DIE LAVA ZU KOMMEN!",
      "IHR KÖNNT NICHT ZU GOL UND MAIAS ZITADELLE GELANGEN, BIS IHR 72 ENERGIEZELLEN GESAMMELT HABT!"
    ],
    "asstvb02": [
      "WOW, HABT IHR DAS GESEHEN? AUF DER GANZEN WELT SIND BLAUE ECO-ÖFFNUNGEN AKTIVIERT WORDEN!",
      "ICH HAB' DOCH GEWUSST, DASS ES EINE MÖGLICHKEIT GIBT, SIE AUFZUMACHEN.",
      "ES MUSS NOCH ANDERE ORTE GEBEN,",
      "VON DENEN AUS MAN AUCH DIE RESTLICHEN ECO-ÖFFNUNGEN AUFMACHEN KANN."
    ],
    "asstvb03": [
      "GUT! IHR HABT ALLE LURKER DARAN GEHINDERT, WEITER MINEN ABZUWERFEN!",
      "SIE HABEN DIE GEWÄSSER UM UNSER DORF SCHON SEIT WOCHEN UNSICHER GEMACHT.",
      "BRINGT EUREN ZOOMER ZURÜCK ZUM TRANS-PAD UND ICH TEELPORTIERE IHN WIEDER HIERHER!"
    ],
    "asstvb04": [
      "GUT, IHR HABT GENUG ENERGIEZELLEN GESAMMELT, UM MEINEN HITZESCHILD ZU AKTIVIEREN!",
      "KLETTERT DIE KLIPPE HINTER DEM HAUS DES FARMERS HOCH",
      "UND TREFFT MICH AM EINGANG ZUM FEUER-CANYON!",
      "BRINGT DIE ENERGIEZELLEN MIT UND BEEILT EUCH!",
      "MEIN VATER SAGT, ER HABE HIER WIEDER MEHR LURKER GESEHEN."
    ],
    "asstvb08": [
      "BEEILT EUCH MIT DEN ENERGIEZELLEN, ICH WARTE AM ANFANG DES FEUER-CANYONS,",
      "OBEN AUF DER KLIPPE, HINTER DEM HAUS DES FARMERS!"
    ],
    "asstvb09": [
      "IHR HABT KEINE 20 ENERGIEZELLEN, UM MEINEN HITZESCHILD ZU AKTIVIEREN!",
      "YOU CAN'T CROSS FIRE CANYON UNTIL YOU COLLECT ENOUGH POWER CELLS."
    ],
    "asstvb20": [
      "GUT GEFLOGEN! DIESE LURKER SIND KEINE WIRKLICHEN GEGNER FÜR DEN ZOOMER!",
      "JETZT HABEN WIR EINE ENERGIEZELLE MEHR!"
    ],
    "asstvb21": [
      "GUT GEMACHT! SEID IHR NICHT FROH, DASS IHR UNSERE KLEINE FLUT-FLUT-FREUNDIN GERETTET HABT?",
      "SIE WIRD EUCH VIELLEICHT NOCH EINMAL BEHILFLICH SEIN KÖNNEN.",
      "JETZT BRINGT SIE ZUM TRANS-PAD, DANN HOLE ICH SIE NACH HAUSE."
    ],
    "asstvb22": [
      "WOW! IHR HABT EIN PAAR DER UNTERWASSER-RUINEN AN DIE OBERFLÄCHE GEHOBEN!",
      "WIE ES SCHEINT, KANN MAN MIT ECO MEHR MACHEN, ALS WIR BISHER WUSSTEN.",
      "UND MIT DER KAMMER IST AUCH EINE ENERGIEZELLE HOCHGEKOMMEN.",
      "KLETTERT RAUF UND HOLT SIE!"
    ],
    "asstvb23": [
      "TOLLE ARBEIT! DEN BEWOHNERN VON FELSDORF IST EIN RIESIGER STEIN VOM HERZEN GEFALLEN!",
      "ABER ES BLEIBT LEIDER KEINE ZEIT ZUM FEIERN! FLIEGT MIT DEM ZOOMER DEN GEBERGSPASS HINAUF,",
      "ABER SEID VORSICHTIG! DIE LURKER HABEN DEN GANZEN PASS VERMINT!",
      "WENN IHR DEN VULKANKRATER ERREICHT,",
      "MÜSST IHR UNBEDINGT IM LABOR DES ROTEN WEISEN DAS TELEPORTTOR AKTIVIEREN,",
      "DAMIT VATER UND ICH ZU EUCH STOSSEN KÖNNEN."
    ],
    "asstvb24": [
      "OH, JE! DIESE LURKER SIND AUF DEM WEG ZU EINER SPRENGKAPSEL AM ENDE DES CANYONS!",
      "WENN SIE DIE VOR EUCH ERREICHEN, SPRENGEN SIE DEN GANZEN PASS IN DIE LUFT!",
      "IHR MÜSST VOR IHNEN DORT SEIN UND DIE SPRENGKAPSEL ZERSTÖREN ODER ALLES IST AUS!"
    ],
    "asstvb25": [
      "GUT GEMACHT! IHR WART VOR IHNEN BEI DER SPRENGKAPSEL!",
      "DAS LABOR DES ROTEN WEISEN LIEGT GLEICH DA VORNE!",
      "SCHALTET DAS TELEPORTTOR EIN, DAMIT WIR ZU EUCH KÖNNEN!"
    ],
    "asstvb28": [
      "HEY! VERGESST DEN WEISEN UND MICH NICHT!",
      "IHR MÜSST DAS TELEPORTTOR EINSCHALTEN, SODASS WIR DURCHKOMMEN KÖNNEN!",
      "ES BEFINDET SICH IM LABOR DES BLAUEN WEISEN, AM ENDE DES FEUER-CANYONS.",
      "WENN IHR UNS NICHT DURCHKOMMEN LASST, KÖNNEN WIR EUCH AUCH NICHT HELFEN!"
    ],
    "asstvb29": [
      "HEY! WIR WARTEN IMMER NOCH!",
      "SCHALTET ENDLICH DAS TELEPORTTOR EIN!"
    ],
    "asstvb30": [
      "HEY! WIR KÖNNEN NICHT DURCHKOMMEN, WENN DAS TELEPORTTOR NICHT EINGESCHALTET IST!"
    ],
    "asstvb40": [
      "DIESES GERÄT IST EIN KOMMUNIKATOR, DAMIT KÖNNEN MEIN VATER UND ICH",
      "EUCH JEDERZEIT BEI EURER SUCHE RATSCHLÄGE GEBEN."
    ],
    "asstvb41": [
      "DIESE SCHWEBENDEN EIFÖRMIGEN DINGER SIND PRECURSOR-ORBS.",
      "WENN IHR GENUG DAVON SAMMELT, GEBEN EUCH EIN PAAR DER DORFBEWOHNER",
      "EINE ENERGIEZELLE DAFÜR."
    ],
    "asstvb42": [
      "DAS IST EINE ENERGIEZELLE, DAS WICHTIGSTE PRECURSOR-ARTEFAKT, DAS IHR FINDEN KÖNNT.",
      "IHR MÜSST 20 DAVON SAMMELN, DAMIT ICH DEN HITZESCHILD",
      "FÜR EUREN A-GRAV-ZOOMER AKTIVIEREN KANN."
    ],
    "asstvb44": [
      "HEY, IHR HABT EINE MEINER SPÄHFLIEGEN GEFUNDEN!",
      "ICH HABE SIEBEN DAVON IN JEDES GEBIET ENTSANDT, UM NACH ENERGIEZELLEN ZU SUCHEN,",
      "ABER DIE LURKER MÜSSEN SIE ALLE EINGEFANGEN HABEN."
    ],
    "asstvb45": [
      "WOW! DIESE LETZTE SPÄHFLIEGE HATTE EINE ENERGIEZELLE!",
      "ICH WETTE, WENN IHR ALLE SIEBEN IN EINEM GEBIET FINDET,",
      "BEKOMMT IHR BESTIMMT NOCH MEHR ENERGIEZELLEN."
    ],
    "asstvb46": [
      "SEID VORSICHTIG IM OZEAN, DIE GEWÄSSER WIMMELN NUR SO VOR LURKER-HAIEN",
      "UND ICH HABE NOCH NIE ERLEBT, DASS JEMAND EINEN DAVON BESIEGT HAT.",
      "HALTET EUCH VON IHNEN FERN, WENN EUCH EUER LEBEN LIEB IST!"
    ],
    "asstvb47": [
      "DENK DRAN, DAS IST EINE ENERGIEZELLE. IHR MÜSST SO VIELE SAMMELN WIE NUR MÖGLICH!"
    ],
    "asstvb48": [
      "DAS IST EINE BLAUE ECO-ÖFFNUNG!",
      "HIER IST DAS BLAUE ECO VIEL KONZENTRIERTER ALS BEI DEN SCHWEBENDEN HAUFEN,",
      "DESHALB BEKOMMST DU HIER EINE VOLLE LADUNG DAVON,",
      "DIE DU FÜR DIE MAXIMALE ZEITDAUER NUTZEN KANNST."
    ],
    "asstvb71": [
      "IHR HABT NICHT GENUG ENERGIEZELLEN, UM DIE MASCHINE DES BLAUEN WEISEN ZU BETREIBEN.",
      "WIR KÖNNEN DIESEN FELSBLOCK NICHT BEWEGEN, BIS IHR 45 ENERGIEZELLEN GESAMMELT HABT."
    ],
    "asstvb72": [
      "SOLANGE WIR NICHT WISSEN, WARUM DER BLAUE WEISE VERSCHWUNDEN IST,",
      "MÜSST IHR 45 ENERGIEZELLEN SAMMELN, UM SEINE MASCHINE ANZUTREIBEN.",
      "GEHT UND BESORGT SIE!"
    ],
    "asstvb75": [
      "DIESE GONDEL SCHEINT NICHT ZU FUNKTIONIEREN.",
      "ICH WERDE MAL DARAN HERUMBASTELN UND VERSUCHEN, SIE WIEDER IN GANG ZU KRIEGEN."
    ],
    "asstvb76": [
      "ICH HABE DIE GONDEL WIEDER AKTIVIERT! SIE KANN EUCH INS SCHNEEGEBIRGE BRINGEN.",
      "BENUTZT SIE, WANN IHR WOLLT."
    ],
    "sagevb01": [
      "IHR SCHEINT EUCH ENDLICH DAZU ENTSCHLOSSEN ZU HABEN,",
      "MEINE ERNTER FREIZUSETZEN.",
      "ICH WÜRDE EUCH JA GERNE GRATULIEREN, ABER IHR HABT SO VIEL ZU TUN,",
      "DA WILL ICH EURE ZEIT NICHT VERSCHWENDEN.",
      "ÜBRIGENS, FALLS EURE PLÄNE FEHLSCHLAGEN,",
      "KÖNNTE DAXTER BESTIMMT JEDERZEIT IM DORF ANHEUERN UND SICH UM DAS RATTENPROBLEM KÜMMERN.",
      "(LACHT)"
    ],
    "sagevb02": [
      "ICH MUSS ZUGEBEN, ICH BIN BEEINDRUCKT! IHR ZWEI HABT'S TATSÄCHLICH GESCHAFFT!",
      "JETZT KÖNNEN DIE LURKER DIE PRECURSOR-ECO-STATION NICHT ÖFFNEN",
      "UND DAMIT DIE WELT AUCH NICHT MIT DUNKLEM ECO ÜBERFLUTEN",
      "UND NOCH NIE DAGEWESENE ZERSTÖRUNG ANRICHTEN.",
      "...HÖR ENDLICH AUF, SO BLÖDE ZU GRINSEN, DAXTER! IHR ZWEI HABT NOCH VIEL ZU TUN!",
      "ALSO LOS!"
    ],
    "sagevb03": [
      "IHR BEEIDRUCKT MICH IMMER MEHR!",
      "ABER VIELLEICHT LIEGT DAS AUCH NUR AN MEINEN NIEDRIGEN ERWARTUNGEN!",
      "OKAY, GENUG DER SCHMEICHELEI! WEITERMACHEN!"
    ],
    "sagevb04": [
      "GUT GEMACHT, JAK! DEIN ONKEL WÄRE STOLZ AUF DICH!",
      "DAS WAR DER RIESIGE ARM EINES PRECURSOR-ROBOTERS.",
      "ICH HABE NOCH NIE EINEN IN SOLCH GUTEM ZUSTAND GESEHEN.",
      "ICH KANN MIR NICHT VORSTELLEN, WAS DIE LURKER DAMIT VORHATTEN,",
      "ABER ES IST BESSER, DASS SIE IHN NICHT BEKOMMEN HABEN.",
      "WENN DU SO WEITERMACHST...",
      "ACH, NEIN. EIN HELD WIRST DU NIE WERDEN.",
      "ABER GIB' NICHT AUF, DU MACHST DAS GANZ HERVORRAGEND!"
    ],
    "sagevb21": [
      "DIESE KLEINEN GRÜNEN ENERGIEBÄLLE AUF DEM BODEN SIND EINE ECO-ART.",
      "HEBE 50 KLEINE ODER EINEN GROSSEN GRÜNEN ECO AUF, DANN WIRD DEINE GESUNDHEIT VERBESSERT."
    ],
    "sagevb22": [
      "DAS HIER IST BLAUES ECO, ES ENTHÄLT DIE BEWEGUNGSENERGIE.",
      "MIT BLAUEM ECO KANNST DU SCHNELL RENNEN,",
      "KISTEN AUFBRECHEN UND SOGAR EINIGE PRECURSOR-ARTEFAKTE AKTIVIEREN,",
      "WENN DU IN IHRE NÄHE KOMMST."
    ],
    "sagevb23": [
      "SCHAU, WIE SICH MIT JEDEM AUFGEHOBENEN BLAUEN ECO-HAUFEN DIE ZEIT VERLÄNGERT,",
      "IN DER DU ES BENUTZEN KANNST."
    ],
    "sagevb24": [
      "DAS IST EINE PRECURSOR-TÜR. SIE LÄSST SICH NUR ÖFFNEN,",
      "WENN DU BLAUES ECO DURCH DEINEN KÖRPER LAUFEN LÄSST."
    ],
    "sagevb25": [
      "GUT GEMACHT, DAS BLAUE ECO HAT DIE TÜR GEÖFFNET.",
      "MIT BLAUEM ECO KANNST DU SELBST DEN PRECURSOR-ARTEFAKTEN,",
      "DIE SCHON SEIT JAHREN NICHT MEHR AKTIVIERT WORDEN SIND, ENERGIE EINHAUCHEN."
    ],
    "sagevb26": [
      "DURCH DEINE SCHUTZBRILLE KANNST DU DEINE FORTSCHRITTE IM SPIEL ANSEHEN."
    ],
    "sagevb27": [
      "WENN DU SPRINGST UND DANN IN DER LUFT GLEICH NOCHMAL SPRINGST,",
      "KANNST DU AUF EINEN HÖHER GELEGENEN VORSPRUNG GELANGEN."
    ],
    "sagevb28": [
      "WENN DU VON FEINDEN UMZINGELT BIST, BENUTZE DIE ROTIER-TRET-METHODE."
    ],
    "sagevb29": [
      "DAS WAR'S NOCH NICHT! VERSUCH'S NOCHMAL!"
    ],
    "sagevb30": [
      "NA LOS, JAK! ROTIERE UND TRETE."
    ],
    "sagevb31": [
      "BENUTZE DIE ROTIER-TRET-METHODE FÜR EINEN RUNDUMSCHLAG."
    ],
    "sagevb32": [
      "BENUTZE BEI EINEM FRONTALANGRIFF EINEN BOXHIEB."
    ],
    "sagevb33": [
      "DAS IST DOCH KEIN BOXHIEB! JETZT ZEIG' UNS MAL, WIE DU RICHTIG BOXT!"
    ],
    "sagevb34": [
      "JAK! VERSUCH'S MIT EINEM BOXHIEB."
    ],
    "sagevb35": [
      "TOLL! MIT DEM BOXHIEB KANNST DU DICH SCHNELL DURCHKÄMPFEN, WENN'S BRENZLIG WIRD."
    ],
    "sagevb36": [
      "MANCHMAL MUSST DU MIT GRÖSSERER KRAFT ZUSCHLAGEN.",
      "UM EINE DIESER KISTEN ZU ÖFFNEN, MUSST DU HOCH SPRINGEN",
      "UND DANN MIT DEN HÄNDEN VORAN ABTAUCHEN."
    ],
    "sagevb37": [
      "MIT EIN BISSCHEN ÜBUNG KANNST DU AUCH VERSUCHEN, EINIGE DIESER BEWEGUNGEN ZU VERBINDEN."
    ],
    "sagevb38": [
      "DU KANNST NICHT ZURÜCK DURCH'S SPRUNGTOR,",
      "BIS DU ALLE VIER ENERGIEZELLEN AUF DIESER INSEL GEFUNDEN HAST."
    ],
    "sagevb39": [
      "SUPER! DU HAST ALLE ENERGIEZELLEN AUF DER INSEL GEFUNDEN.",
      "KOMM ZURÜCK ZUM SPRUNGTOR, DAMIT ICH DICH ZURÜCK INS LABOR BEFÖRDERN KANN! BEEIL DICH!"
    ],
    "sksp0001": [
      "HEY! DIE SÜSSE KEIRA-MAUS HATTE RECHT! HIER GIBT'S WIRKLICH TRANS-PADS!"
    ],
    "sksp0002": [
      "GLAUB' MIR, DIESE DUNKLEN ECO-BOXEN SIND ÜBERHAUPT NICHTS GUTES!"
    ],
    "sksp0003": [
      "ICH WETTE, WENN WIR ALLE VON DIESEN NIEDLICHEN SPÄHFLIEGEN IN EINEM LEVEL FINDEN,",
      "IST BESTIMMT EINE DABEI MIT EINER ENERGIEZELLE!"
    ],
    "sksp0004": [
      "JAWOLL, EIN SCHATZ!"
    ],
    "sksp0005": [
      "SO HART SEHEN DIESE HOLZ- UND METALLKISTEN NUN AUCH NICHT AUS!",
      "ICH WETTE, MIT EINEM TAUCHSPRUNG KRIEGT MAN SIE AUF!"
    ],
    "sksp0006": [
      "DIESE METALLKISTEN SIND JA DICKER ALS DER SCHÄDEL EINER YAKOW!",
      "ABER ES MUSS DOCH WAS GEBEN, WOMIT MAN SIE AUFKRIEGT!"
    ],
    "sksp0007": [
      "NUR EIN WORT: ENERGIEZELLEN.",
      "DIE MÜSSEN WIR FINDEN UND IM MOMENT SIND WIR DARIN GAR NICHT GUT!"
    ],
    "sksp0008": [
      "WIR BRAUCHEN ORBS. ORBS, JAK!",
      "WIE SOLLEN WIR DENN JEMALS ENERGIEZELLEN KAUFEN, WENN WIR KEINE ORBS SAMMELN?!"
    ],
    "sksp0009": [
      "WAS FÜR EIN SELTSAMES DING! ICH WETTE, WIR KRIEGEN DAS AUF,",
      "WENN DU DICH MIT DIESEM BLUBBERNDEN BLAUEN ECO-ZEUGS AUFLÄDST."
    ],
    "sksp0010": [
      "HEY! KOMM, WIR SEHEN UNS MAL DAS SPEEDBOOT VON DEM ALTEN FISCHKOPP AM DOCK AN!"
    ],
    "sksp0011": [
      "VIELLEICHT FRAGEN WIR MAL DEN FISCHER UNTEN AM DSCHUNGELFLUSS,",
      "OB WIR UNS SEIN SPEEDBOOT AUSLEIHEN KÖNNEN, UM DAMIT RÜBER ZUR NEBELINSEL ZU ZISCHEN!"
    ],
    "sksp0013": [
      "HAST DU GESEHEN, WAS FÜR EIN RIESENSTÜCK DIESER LURKER-HAI",
      "AUS DEM BOOT DES FISCHERS GEBISSEN HAT?",
      "AM BESTEN, WIR HALTEN VIEL ABSTAND ZU DIESEN VIECHERN,",
      "ICH GLAUBE NICHT, DASS WIR ES MIT SO EINEM HÖLLENTIER AUFNEHMEN KÖNNEN!"
    ],
    "sksp0014": [
      "WIR HABEN GENUG ORBS FÜR EINE ENERGIEZELLE ZUSAMMENGESCHNORRT.",
      "KOMM, WIR GEHEN ZURÜCK UND TAUSCHEN SIE ENDLICH EIN!"
    ],
    "sksp0015": [
      "DAS MUSS EINS VON DEN PRECURSOR-ORAKELN SEIN, VON DENEN DER WEISE DAUERND ERZÄHLT!",
      "HOFFENTLICH SIND DIE NICHT GENAU SO HÄSSLICH WIE ER!"
    ],
    "sksp0017": [
      "WOW, GUCK DIR BLOSS MAL DIESE IRRE SKULPTUR AUF DEN FELSEN DA DRÜBEN AN!"
    ],
    "sksp0018": [
      "WIR SOLLTEN DIESEM SCHWÄTZER VON EINEM BÜRGERMEISTER SAGEN,",
      "DASS ER VERDAMMT TIEF IN UNSERER SCHULD STEHT,",
      "WEIL WIR DEN ENERGIESTRAHL DES DORFES WIEDER ANGESCHLOSSEN HABEN!"
    ],
    "sksp0019": [
      "HEY, SEEMÖWEN! KOMM, WIR MACHEN UNS EINEN SPASS UND JAGEN SIE."
    ],
    "sksp0020": [
      "JA, HA, HA! KOMM, DAS MACHEN WIR NOCHMAL!"
    ],
    "sksp0021": [
      "DA SIND DIESE SEEMÖWEN SCHON WIEDER... SCHNAPPEN WIR SIE UNS!"
    ],
    "sksp0022": [
      "JA, HA, HA, HA, HA, HA, HA, HA, HA! JUHUHUU!"
    ],
    "sksp0023": [
      "WUHUU!"
    ],
    "sksp0024": [
      "JA, HA, HA! YEAH!"
    ],
    "sksp0025": [
      "WOW! SIE HABEN EINE LAWINE AUSGELÖST! KOMM, WIR SEHEN UNS DAS MAL AN!"
    ],
    "sksp0026": [
      "HEY! DIESER PELIKAN HAT SICH GERADE EINE ENERGIEZELLE GESCHNAPPT!",
      "KOMM, WIR TRETEN IHM MAL ORDENTLICH IN DEN VOGELHINTERN!"
    ],
    "sksp0027": [
      "SCHNELL! WIR MÜSSEN DIE ENERGIEZELLE KRIEGEN, BEVOR DER PELIKAN SIE WIEDER ERWISCHT!"
    ],
    "sksp0028": [
      "TRITT DAS EI, HEHE, TRITT ES, TRITT ES!"
    ],
    "sksp0029": [
      "AH, VIELLEICHT SOLLTEN WIR MAL MIT DER VOGEL-BEOBACHTERIN REDEN,",
      "UM ZU SEHEN, OB WIR KEIN RÜHREI AUS DEM FLUT-FLUT-EI GEMACHT HABEN!"
    ],
    "sksp0030": [
      "HEY, VERSUCH MAL, GEGEN DIE FELSEN ZU BOXEN, UM SIE BEISEITE ZU SCHIEBEN!"
    ],
    "sksp0031": [
      "UUH! KOMM, WIR JAGEN MIT DER KANONE ALLES IN DIE LUFT!"
    ],
    "sksp0034": [
      "AWOOGA! AWOOGA! TAUCH NACH DIESEN EIERN, JAK, TAUCH!"
    ],
    "sksp0035": [
      "SUPER, JETZT HABEN WIR HIER EINEN PRECURSOR-STARTER,",
      "ABER DEINE ENERGIE IST NICHT VOLL AUFGELADEN MIT DIESEM BLAUEN ZEUG,",
      "ALSO BRINGT UNS DAS ÜBERHAUPT NICHTS!"
    ],
    "sksp0037": [
      "DIESE TURMDINGSBUMSE, DIE IM GANZEN DSCHUNGEL VERTEILT SIND,",
      "MÜSSEN DEN ECO-STRAHL WIEDER UMLENKEN.",
      "KOMM, WIR BASTELN MAL DARAN HERUM!"
    ],
    "sksp0038": [
      "HMM, WENN DAS BLAUE ECO EINE BRÜCKE BAUEN KANN,",
      "DANN WETTE ICH, DASS ES AUCH EINE TÜR ÖFFNEN KANN!",
      "KOMM, WIR GEHEN ZURÜCK UND LADEN DICH WIEDER AUF!"
    ],
    "sksp0039": [
      "HEY, DA SIND KLEINE BLITZSPUREN AN DIESEN PFOSTEN",
      "UND AUS DER ECO-ÖFFNUNG DA DRÜBEN KOMMEN BLITZE.",
      "DENKST DU, WAS ICH DENKE?"
    ],
    "sksp0040": [
      "KOMM, WIR KLETTERN AUF DIESE MASCHINE UND ZERSTÖREN DEN SPIEGEL,",
      "DER DEN PRECURSOR-STRAHL ABLENKT!"
    ],
    "sksp0041": [
      "WIR MÜSSEN AUF DIE SPITZE DIESES TURMES!"
    ],
    "sksp0043": [
      "VIELLEICHT SOLLTEN WIR MAL DEN FISCHER AUSFINDIG MACHEN.",
      "SOVIEL ICH WEISS, SOLL ER AM UNTEREN FLUSS IM DSCHUNGEL FISCHEN!"
    ],
    "sksp0049": [
      "RICHTE DEN STRAHL AUS, INDEM DU DEN NÄCHSTEN TURM ANPEILST!"
    ],
    "sksp0050": [
      "ZERSTÖRE DEN SPIEGEL, JAK!"
    ],
    "sksp0051": [
      "SCHNAPP' DIR DIE KÄFER, JAK, SCHNAPP' DIR DIE KÄFER!"
    ],
    "sksp0052": [
      "LASS UNS ZUM NÄCHSTEN TURM GEHEN UND DORT AUCH DEN ECO-STRAHL WIEDER ANSCHLIESSEN!"
    ],
    "sksp0053": [
      "HEY! WIR KÖNNEN JA DEM STRAHL FOLGEN, DANN KOMMEN WIR AUTOMATISCH ZUM NÄCHSTEN TURM!"
    ],
    "sksp0054": [
      "WIR MÜSSEN DICH MIT DIESEM BLAUEN ZEUG AUFLADEN, UM DIE TÜR ZU ÖFFNEN!"
    ],
    "sksp0056": [
      "HEY! ICH SEHE DIE MUSE DES BILDHAUERS!"
    ],
    "sksp0059": [
      "HIER DRIN GEFÄLLT'S MIR GAR NICHT!",
      "JETZT HALTEN WIR DICH ABER MAL AUS DEM ZEUG RAUS, OKAY?"
    ],
    "sksp0060": [
      "OH, HIER LÄUFT'S MIR KALT DEN RÜCKEN RUNTER!",
      "UND GLAUB MIR, DAS IST EINE GANZ NEUE ERFAHRUNG,",
      "WENN MAN FELL HAT!"
    ],
    "sksp0062": [
      "LASS UNS DIESE BALLONLURKER UMPFLÜGEN UND KLEINHOLZ AUS IHNEN MACHEN!"
    ],
    "sksp0063": [
      "AUS DEN LURKERN SOLLEN WIR KLEINHOLZ MACHEN, JAK, NICHT AUS DEN MINEN!",
      "REGEL NUMMER EINS: HALT DICH IMMER VON DEN MINEN FERN!"
    ],
    "sksp0064": [
      "GUCK AUCH HINTER DICH!",
      "WIR WISSEN DOCH NOCH, WAS DAS LETZTE MAL HIER DRINNEN PASSIERT IST!"
    ],
    "sksp0067": [
      "FALL JA NICHT IN DEN NEBEL UNTER UNS!",
      "ICH GLAUB' NÄMLICH NICHT, DASS WIR ES DANN NOCH ZURÜCKSCHAFFEN!"
    ],
    "sksp0069": [
      "DAS IST EIN HINTERHALT, JAK! EIN HINTERHALT!"
    ],
    "sksp0070": [
      "MACH EINEN TAUCHSPRUNG AUF DIE WIPPE!"
    ],
    "sksp0071": [
      "HOL DAS ROTE ECO!"
    ],
    "sksp0072": [
      "ROTES ECO VERSTÄRKT DEINE ANGRIFFE!"
    ],
    "sksp0073": [
      "WIR BRAUCHEN BLAUES ECO, UM DAS HIER AUFZULADEN!"
    ],
    "sksp0076": [
      "JAK, WIR MÜSSEN EIN PAAR SPRUNGPLATTFORMEN BENUTZEN,",
      "UM NICHT AUF DEN HEISSEN BODEN ZU KOMMEN!"
    ],
    "sksp0077": [
      "BALLONS GUT, GLÜHENDES HEISSES MAGMA SCHLECHT!"
    ],
    "sksp0078": [
      "FLIEG ÜBER DAS PRECURSOR-ZEUG, UM UNS ABZUKÜHLEN!"
    ],
    "sksp0079": [
      "AHH! ICH WERDE STERBEN! ICH KOMME, GROSSVATER!",
      "DU MUSST DIESES DING AUF DIE ANDERE SEITE BRINGEN, BEVOR ES ÜBERHITZT!"
    ],
    "sksp0080": [
      "MIT DEM HÜPFDREHER KANNST DU ENGERE KURVEN FLIEGEN!"
    ],
    "sksp0081": [
      "AH! VIELLEICHT SOLLTE ICH LIEBER FLIEGEN!"
    ],
    "sksp0082": [
      "DU GIBST DIR MÜHE, DICH VON DIESEN DUNKLEN ECO-KISTEN FERNZUHALTEN, ODER?"
    ],
    "sksp0083": [
      "HUCH! MAL SEHEN, OB WIR DURCH DIESE LURKER AN HÖHE GEWINNEN!"
    ],
    "sksp0084": [
      "ZU NAHE, ZU NAHE!"
    ],
    "sksp0085": [
      "WOW! DIESES BABY WIRD VIEL ZU HEISS!"
    ],
    "sksp0086": [
      "IN EIN PAAR SEKUNDEN SIND WIR GEGRILLTES FLUT-FLUT!"
    ],
    "sksp0087": [
      "TRIFF DIE BALLONS, UM UNS ABZUKÜHLEN!"
    ],
    "sksp0088": [
      "DA KOMMT WIEDER EIN BALLON!"
    ],
    "sksp0089": [
      "HÄTTE ICH DOCH HEUTE BLOSS VERSCHLAFEN!"
    ],
    "sksp0090": [
      "DU HAST EINEN BALLON VERPASST!",
      "WIR BRAUCHEN DIESE BALLONS, SONST WERDEN WIR GEBRATEN!"
    ],
    "sksp0091": [
      "DIESES BABY WIRD ZU HEISS!"
    ],
    "sksp0092": [
      "RIECHT'S HIER ETWA ANGEBRANNT?!"
    ],
    "sksp0093": [
      "ICH GLAUBE, MEIN SCHWANZ BRENNT!"
    ],
    "sksp0094": [
      "GLEICH EXPLODIERT ER!"
    ],
    "sksp0095": [
      "JUHUU! WIR HABEN'S GESCHAFFT!"
    ],
    "sksp0096": [
      "HIER GIBT'S AUCH SPÄHFLIEGEN!"
    ],
    "sksp009a": [
      "HAHA, DEM HABEN WIR'S GEZEIGT, WAS?"
    ],
    "sksp009b": [
      "JAWOLL, NOCH MEHR ORBS!"
    ],
    "sksp009c": [
      "TU MIR DEN GEFALLEN UND HALT DICH VON DIESEN DUNKLEN ECO-KISTEN FERN!"
    ],
    "sksp009d": [
      "JA, HA, HA, HA, HA, HA!"
    ],
    "sksp009e": [
      "WA-HUU!"
    ],
    "sksp009f": [
      "SCHNAPP DIR WELCHE, SCHNAPP DIR WELCHE! HA, HA, HA!"
    ],
    "sksp009g": [
      "DIREKT HINTER DIR, JAK!"
    ],
    "sksp009i": [
      "HABEN WIR JETZT ALLE SPÄHFLIEGEN IN DIESEM GEBIET GEFUNDEN?"
    ],
    "sksp009j": [
      "HEY! SIEHT GANZ SO AUS, ALS BEFINDEN SICH DIE SPÄHFLIEGEN IMMER IN ROTEN KISTEN!"
    ],
    "sksp009k": [
      "JAWOLL! DU HAST ALLE SPÄHFLIEGEN IN DIESEM GEBIET GEFUNDEN!"
    ],
    "sksp0109": [
      "WOW! WIR HABEN DIE REKORDZEIT GESCHLAGEN!"
    ],
    "sksp0110": [
      "ICH HAB'S DIR EINMAL GESAGT UND ICH SAG'S DIR NOCHMAL...",
      "HALT DICH VON DEN DUNKLEN ECO-KISTEN FERN!"
    ],
    "sksp0111": [
      "KOMM, WIR TREIBEN WIEDER DIESE MAULWÜRFE WIEDER ZURÜCK UNTER DIE ERDE!"
    ],
    "sksp0112": [
      "JETZT HOLEN WIR UNS UNSERE ENERGIEZELLEN VON DER GEOLOGIN."
    ],
    "sksp0113": [
      "DAS MÜSSEN DIE INFIZIERTEN PFLANZEN SEIN, VON DENEN DER ALTE HOLZKOPF GEREDET HAT."
    ],
    "sksp0114": [
      "WIR MÜSSEN GRÜNES ECO BENUTZEN, UM DIESE PFLANZEN ZU HEILEN!"
    ],
    "sksp0115": [
      "JAK, FLIEG DURCH DIE GRÜNE ECO-ÖFFNUNG."
    ],
    "sksp0116": [
      "DA IST EINER VON DIESEN FLIEGENDEN LURKERN! VIELLEICHT HAT ER EINE ENERGIEZELLE!"
    ],
    "sksp0117": [
      "DAS IST DAS MAULWURFLOCH!"
    ],
    "sksp0118": [
      "LASS UNS JETZT ÜBER DIE INFIZIERTEN PFLANZEN FLIEGEN!"
    ],
    "sksp0119": [
      "EIN RING GESCHAFFT, ABER ES WARTEN NOCH JEDE MENGE AUF UNS!"
    ],
    "sksp0120": [
      "BEEIL DICH! DA IST DER NÄCHSTE RING!"
    ],
    "sksp0121": [
      "SCHNELL! DU MUSST DURCH ALLE RINGE FLIEGEN, BEVOR SIE ERLÖSCHEN!"
    ],
    "sksp0122": [
      "HEY! DAS GRASS BREMST UNS!"
    ],
    "sksp0123": [
      "SCHNELL! FOLGE DEM ROHR!"
    ],
    "sksp0124": [
      "ICH HABE EIN GANZ SCHLECHTES GEFÜHL BEI DER SACHE."
    ],
    "sksp0125": [
      "WIE ES SCHEINT, MÜSSEN DIESE DINGER MIT BLAUEM ECO AUFGELADEN WERDEN."
    ],
    "sksp0126": [
      "KOMM, WIR HOLEN UNS DIE ENERGIEZELLE VOM DACH DIESER KAMMER!"
    ],
    "sksp0127": [
      "TRITT DEN KLEINEN WICHT DA OBEN!"
    ],
    "sksp0128": [
      "JAK! RENN! DAS DUNKLE ECO STEIGT!"
    ],
    "sksp0129": [
      "AHH! DAS DUNKLE ECO KOMMT NÄHER!"
    ],
    "sksp0130": [
      "AH, ICH GLAUBE, WIR MÜSSEN DIESE PLATTFORMEN EINSCHALTEN ODER SO WAS."
    ],
    "sksp0131": [
      "HEY! ICH GLAUBE, DU KANNST EINEN TAUCHSPRUNG AUF DIESE KERLE MACHEN!"
    ],
    "sksp0133": [
      "ICH WETTE, DIESE DINGER KÖNNEN WIR ALLE AUF EINMAL AUFLADEN!"
    ],
    "sksp0134": [
      "WAS HÄLTST DU DAVON,",
      "VIELLEICHT MAL EIN BISSCHEN VORSICHTIGER MIT DIESEN HEISSEN ROHREN ZU SEIN?"
    ],
    "sksp0135": [
      "DIESES WASSER SIEHT GEFÄHRLICH AUS, WENN ES DIE FARBE WECHSELT!"
    ],
    "sksp0136": [
      "DU MUSST AUS DEM WASSER RAUS, BEVOR ES DIE FARBE WECHSELT!"
    ],
    "sksp0137": [
      "BESTIMMT KÖNNEN WIR DIESE FELSBROCKEN ZERSCHIESSEN,",
      "WENN WIR MIT GELBEM ECO AUFGELADEN SIND!"
    ],
    "sksp0138": [
      "WIR SOLLTEN DIESE GROSSEN FELSBROCKEN ZERSCHIESSEN,",
      "AN DENEN DAS HALTESEIL FESTGEMACHT IST."
    ],
    "sksp0139": [
      "VIELLEICHT SOLLTEN WIR DIESEM SPINNER HELFEN, SEIN VIECH ZU FINDEN."
    ],
    "sksp0140": [
      "DAS FLUT-FLUT KANN LÄNGER GLEITEN, WENN ES IN DER LUFT NOCH MAL SPRINGT!"
    ],
    "sksp0141": [
      "BERÜHR' DIESEN HEISSEN SCHWARZEN TEER NICHT, ODER DU WIRST DIR WEHTUN!"
    ],
    "sksp0142": [
      "HIER KANNST DU SICHER DURCH'S WASSER WATEN."
    ],
    "sksp0143": [
      "AAH! BEFREI' DICH AUS DER ZUNGE!"
    ],
    "sksp0144": [
      "SCHIESS AUF DIE RATTENNESTER, DAMIT NICHT IMMER NOCH MEHR RATTEN DORT RAUSKOMMEN!"
    ],
    "sksp0145": [
      "WOW! DU KANNST FEUERBÄLLE ABSCHIESSEN, WENN DU MIT GELBEM ECO AUFGELADEN BIST!"
    ],
    "sksp0146": [
      "HEY! DAS IST GELBES ECO!"
    ],
    "sksp0147": [
      "AN DIESER STANGE DA DRÜBEN KANNST DU SCHWINGEN!"
    ],
    "sksp0148": [
      "PASS AUF, DIESE BROMBEERRANKE HAT HÖLLISCH VIELE DORNEN!"
    ],
    "sksp0149": [
      "HEY, SIEHT AUS WIE EINES VON DEN ZEPPELIN-HALTESEILEN!"
    ],
    "sksp0150": [
      "SEI VORSICHTIG, WENN DER FROSCH AUFGELADEN IST!"
    ],
    "sksp0151": [
      "LAUF WEG, JAK!"
    ],
    "sksp0152": [
      "PASS AUF, JAK! DAS IST EIN HINTERHALT!"
    ],
    "sksp0153": [
      "HEY, DAS MUSS DAS PRECURSOR-ARTEFAKT SEIN, HINTER DEM DIE LURKER HER SIND!",
      "SIEHT AUS WIE EIN RIESIGER ROBOTER-ARM!"
    ],
    "sksp0154": [
      "DIESER SCHWARZE TEER SIEHT HEISS UND GEFÄHRLICH AUS!"
    ],
    "sksp0155": [
      "SCHIESS MIT DEM GELBEN-ECO-ZEUG AUF DIE FLEDERMÄUSE!"
    ],
    "sksp0156": [
      "VIELLEICHT KÖNNEN WIR UNS UNTER DEN FLEDERMÄUSEN DURCHDUCKEN!"
    ],
    "sksp0157": [
      "HAST DU DAS GESEHEN? NUR NOCH DREI HALTESEILE!"
    ],
    "sksp0158": [
      "WOW! NUR NOCH ZWEI HALTESEILE!"
    ],
    "sksp0159": [
      "DIESER ZEPPELIN WIRD KAUM NOCH GEHALTEN! KOMM, WIR SUCHEN DAS LETZTE HALTESEIL!"
    ],
    "sksp0160": [
      "HEY! HIER IST DAS FLUT-FLUT!"
    ],
    "sksp0161": [
      "ICH HASSE RATTEN! UND DABEI SEHE ICH FAST WIE EINE AUS."
    ],
    "sksp018a": [
      "DIESER FAULE FARMER SCHULDET UNS EINE ENERGIEZELLE!",
      "MIT DEM WERDEN WIR JETZT MAL REDEN!"
    ],
    "sksp0300": [
      "WIR MÜSSEN VOR DEN LURKERN AM ENDE DES PASSES SEIN!"
    ],
    "sksp0301": [
      "KOMM JA NICHT AN DIESE SPRENGLADUNGEN!"
    ],
    "sksp0302": [
      "BLEIB VOR IHNEN, DANN HABEN WIR'S GESCHAFFT!"
    ],
    "sksp0303": [
      "SPRING AUF DAS BLAUE ECO, DANN ZISCHEN WIR LOS WIE DER WIND!"
    ],
    "sksp0304": [
      "HALT DICH VON DEN BÄUMEN FERN, JAK, SIE BREMSEN UNS!"
    ],
    "sksp0305": [
      "JE MEHR BLAUES ECO DU TRIFFST, UMSO SCHNELLER SIND WIR!"
    ],
    "sksp0306": [
      "PASS AUF DIE SPRENGLADUNGEN AUF!"
    ],
    "sksp0307": [
      "FALL NICHT IN DIE LÖCHER!"
    ],
    "sksp0308": [
      "VIELLEICHT SOLLTE ICH LIEBER FLIEGEN!"
    ],
    "sksp0309": [
      "DA IST EINER VON DEN LURKERN!"
    ],
    "sksp0310": [
      "SCHNAPP' SIE DIR, JAK!"
    ],
    "sksp0311": [
      "WIR HABEN EINEN ÜBERHOLT!"
    ],
    "sksp0312": [
      "AHH, EINER DER LURKER HAT UNS ÜBERHOLT!"
    ],
    "sksp0313": [
      "SIE HABEN EINEN RIESEN VORSPRUNG!"
    ],
    "sksp0314": [
      "JA, WIR FÜHREN!"
    ],
    "sksp0315": [
      "SCHNELLER, JAK, SCHNELLER!"
    ],
    "sksp0316": [
      "SPRINGEN, SPRINGEN!"
    ],
    "sksp0317": [
      "FESTHALTEN!"
    ],
    "sksp0318": [
      "JAAAAA!"
    ],
    "sksp0319": [
      "DAS WIRD EIN KOPF-AN-KOPF-RENNEN!"
    ],
    "sksp0320": [
      "SIE SIND VOR UNS AM DETONATOR!"
    ],
    "sksp0321": [
      "GESCHAFFT! WIR HABEN SIE DAVON ABGEHALTEN, DEN PASS ZU SPRENGEN!"
    ],
    "sksp0327": [
      "ICH GLAUBE, DAS WAR DER LETZTE DUNKLE ECO-KRISTALL!"
    ],
    "sksp0328": [
      "VIELLEICHT KANNST DU BESSER SCHIESSEN, WENN DU DURCH DEINE SCHUTZBRILLE ZIELST!"
    ],
    "sksp0329": [
      "OH, NEIN! NOCH MEHR DUNKLES ECO!"
    ],
    "sksp0330": [
      "ICH GLAUBE, WIR HABEN NICHT ALLE DUNKLEN ECO-KRISTALLE GEFUNDEN!"
    ],
    "sksp0331": [
      "SCHIESS AUF DIE LURKER, DIE AN DEN PFOSTEN NAGEN!"
    ],
    "sksp0332": [
      "PASS AUF, DASS DAS LICHT NICHT AUSGEHT!"
    ],
    "sksp0333": [
      "STOSS AN EINEN KRISTALL, DANN BEKOMMST DU LICHT!"
    ],
    "sksp0334": [
      "HAU AB! DIESER KRISTALL EXPLODIERT GLEICH!"
    ],
    "sksp0335": [
      "OH, JE, SIE HABEN EINEN PRECURSOR-ROBOTER GEFUNDEN!"
    ],
    "sksp0336": [
      "MACH' DIE EIER KAPUTT, BEVOR SIE SCHLÜPFEN!"
    ],
    "sksp0337": [
      "HIER DRIN IST'S RICHTIG UNHEIMLICH..."
    ],
    "sksp0338": [
      "SIEHT AUS, ALS GINGEN DIE SPINNENNETZE KAPUTT, WENN MAN ZWEI MAL DAGEGEN SPRINGT!"
    ],
    "sksp0339": [
      "ICH. HASSE. SPINNEN."
    ],
    "sksp0340": [
      "DA KOMMEN BABY-SPINNEN!"
    ],
    "sksp0341": [
      "ICH GLAUBE, WIR SIND HIER IN EINEM SPINNENNEST!"
    ],
    "sksp0342": [
      "PASS' AUF, NOCH MEHR SPINNEN!"
    ],
    "sksp0343": [
      "LOS, RAUS HIER!"
    ],
    "sksp0345": [
      "WIE KOMMEN WIR IN DIESES FORT REIN?"
    ],
    "sksp0346": [
      "VIELLEICHT KANN ROTES ECO DIESEN KERL BESIEGEN!"
    ],
    "sksp0347": [
      "WIR MÜSSEN EINEN ROLLSPRUNG MACHEN!"
    ],
    "sksp0348": [
      "WIR MÜSSEN UNBEDINGT DIESE ECO-ÖFFNUNG AUFBEKOMMEN!"
    ],
    "sksp0349": [
      "DAS DA UNTEN SIEHT AUS WIE EIN ECO-SCHALTER!"
    ],
    "sksp0350": [
      "SCHNAPP IHN DIR, WENN SEINE STACHELN DRIN SIND!"
    ],
    "sksp0351": [
      "DRÜCK' AUF DEN KNOPF!"
    ],
    "sksp0352": [
      "SCHNELL! BEVOR SIE WIEDER RUNTERFALLEN!"
    ],
    "sksp0359": [
      "DU MUSST ROTES ECO BENUTZEN!"
    ],
    "sksp0360": [
      "JAWOLL! WIR HABEN DIE VERSIEGELTEN GELBEN ECO-ÖFFNUNGEN AUFGEMACHT!"
    ],
    "sksp0362": [
      "SIEH MAL! EINE EINGEFRORENE ENERGIEZELLE!"
    ],
    "sksp0363": [
      "NUR EIN FLUT-FLUT KANN SO WEIT SPRINGEN!"
    ],
    "sksp0364": [
      "WIR MÜSSEN UNS BEEILEN, SONST WERDEN WIR GERÖSTET!"
    ],
    "sksp0365": [
      "SUCH' DIR EINEN PFAD AUS, IRGENDEINEN!"
    ],
    "sksp0366": [
      "HALT DICH ENTWEDER VON DEN MINEN FERN ODER SCHIESSE AUF SIE, JAK!"
    ],
    "sksp0367": [
      "SUCH DIR EINEN WEG DURCH DIESE DUNKLEN-ECO-FÄSSER!"
    ],
    "sksp0368": [
      "WEITER SO, TRIFF DIE KÜHLBALLONS!"
    ],
    "sksp0369": [
      "DAS WIRD LANGSAM ZU HEISS HIER!"
    ],
    "sksp0370": [
      "GLEICH EXPLODIERT ER!"
    ],
    "sksp0371": [
      "SCHNAPP DIR DAS BLAUE ECO, JAK!"
    ],
    "sksp0372": [
      "SCHIESS' DIR DEN WEG FREI!"
    ],
    "sksp0373": [
      "UUUH! WAS FÜR EIN FLUG!"
    ],
    "sksp0374": [
      "JA! JETZT WIRST DU GEGRILLT, SCHÄTZCHEN!"
    ],
    "sksp0375": [
      "SCHIESS AUF DEN ENERGIEBEREICH, UM DIE TÜR ZU ÖFFNEN!"
    ],
    "sksp0376": [
      "SCHIESS AUF DEN ENERGIEBEREICH, BEVOR WIR VERBRENNEN!"
    ],
    "sksp0378": [
      "DIE TÜR IST AUF, WEITER JETZT!"
    ],
    "sksp0379": [
      "WIR ZOOMEN!"
    ],
    "sksp0380": [
      "WIR SIND DURCH!"
    ],
    "sksp0381": [
      "ZERSTÖR' DEN GENERATOR, UM DEN WEISEN ZU BEFREIEN!"
    ],
    "sksp0382": [
      "HALT DICH AM RAND FEST!"
    ],
    "sksp0383": [
      "WIR HABEN GESELLSCHAFT, JAK. LAUTER LURKER!"
    ],
    "sksp0384": [
      "ZERSTÖRE DIESE GENERATOREN!"
    ],
    "sksp0385": [
      "DRÜCK' AUF DEN KNOPF!"
    ],
    "sksp0386": [
      "DIESER ROBOTER MACHT MIR ÜBERHAUPT KEINE ANGST!"
    ],
    "sksp0387": [
      "LASS UNS AUF DIESE PLATTFORMEN KLETTERN!"
    ],
    "sksp0388": [
      "VERPASS' DEN NÄCHSTEN STARTER NICHT!"
    ],
    "sksp0389": [
      "VORSICHT!"
    ],
    "sksp0390": [
      "WIR MÜSSEN ALLE WEISEN RETTEN!"
    ],
    "sksp0391": [
      "MEINST DU, GOL WIRD MICH JETZT NOCH ZURÜCKVERWANDELN?"
    ],
    "sksp0392": [
      "DAS IST ALSO GOLS UND MAIAS ZITADELLE. WIE GEMÜTLICH!"
    ],
    "sksp0393": [
      "LANDE AUF DEM NÄCHSTEN STARTER!"
    ],
    "sksp0394": [
      "SCHNAPP' DIR DAS GELBE ECO!"
    ],
    "sksp0395": [
      "SCHIESS AUF DEN ROBOTER, JAK!"
    ],
    "sksp0396": [
      "SCHIESS AUF SEINEN ARM!"
    ],
    "sksp0397": [
      "SCHIESS AUF SEINE WAFFE!"
    ],
    "sksp0398": [
      "SCHIESS AUF SEINEN KOPF!"
    ],
    "sksp0399": [
      "PASS AUF DIE EXPLOSION AUF!"
    ],
    "sksp0400": [
      "ER LÄDT AUF!"
    ],
    "sksp0401": [
      "SCHNAPP' DIR DAS BLAUE ECO!"
    ],
    "sksp0402": [
      "SCHNAPP' DIR DAS ROTE ECO!"
    ],
    "sksp0403": [
      "ICH HAB' EIN GAANZ SCHLECHTES GEFÜHL!"
    ],
    "sksp0404": [
      "BENUTZE DEN STARTER, SCHNELL!"
    ],
    "sksp0405": [
      "JETZT HAST DU DAS VIECH VERÄRGERT!"
    ],
    "sksp0406": [
      "WIR DÜRFEN DIESE KERLE NICHT BERÜHREN!"
    ],
    "sksp0407": [
      "BENUTZE DAS GELBE ECO!"
    ],
    "sksp0408": [
      "SCHIESS AUF DIE KERLE!"
    ],
    "sksp0409": [
      "SCHNAPP' DIR DAS LICHT-ECO, JAK!"
    ],
    "sksp0410": [
      "ER SIEHT WÜTEND AUS!"
    ],
    "sksp0411": [
      "SPRING, UM DEN EXPLOSIONEN ZU ENTGEHEN!"
    ],
    "sksp0412": [
      "JETZT NEHMEN WIR DIE SACHE IN DIE HAND!"
    ],
    "sksp0413": [
      "GUT GESCHOSSEN, PARTNER!"
    ],
    "sksp0414": [
      "DAS HAT GESESSEN!"
    ],
    "sksp0415": [
      "LOS GEHT'S!"
    ],
    "sksp0416": [
      "JA, DU HAST ES GESCHAFFT!"
    ],
    "sksp0417": [
      "SAGT \"AUF WIEDERSEHEN\", GOL UND MAIA!"
    ],
    "sksp0435": [
      "SCHLAG DIESE KNOCHEN WEG!"
    ],
    "sksp0443": [
      "SCHLAG DIESE PFOSTEN VON UNTEN HOCH!"
    ],
    "sksp0444": [
      "WIR WARTEN. HALLO?"
    ],
    "sksp0449": [
      "DRÜCKE DIE START-TASTE ZUM SPIELEN."
    ],
    "sksp0450": [
      "WILLST DU AUFHÖREN?"
    ],
    "sksp0451": [
      "DAS HATTE ICH AUCH NICHT ERWARTET."
    ],
    "sksp0452": [
      "OKAY, BIS SPÄTER DANN."
    ],
    "sksp0455": [
      "MAN, WER SIND DENN BLOSS DIESE GANZEN LEUTE?"
    ],
    "sksp0466": [
      "ICH WAR ECHT GUT. NICHT WAHR, MÄDELS?"
    ],
    "sksp0b42": [
      "JETZT LASS DOCH NICHT ALLE GELBEN FISCHE DURCH,",
      "DAVON WIEGT JEDER FÜNF PFUND UND DAS IST GANZ SCHÖN VIEL, JAK!"
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "VOGEL-BEOBACHTERIN",
    "BLUE SAGE": "BLAUER WEISE",
    "DAXTER": "DAXTER",
    "FARMER": "FARMER",
    "FISHERMAN": "FISCHER",
    "FLUT-FLUT": "FLUT-FLUT",
    "GAMBLER": "GLÜCKSSPIELER",
    "GEOLOGIST": "GEOLOGIN",
    "GOL": "GOL",
    "GORDY": "GORDY",
    "JAK": "JAK",
    "JAK'S UNCLE": "JAKS ONKEL",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "BÜRGERMEISTER",
    "MINER": "MINER",
    "OLD MAN": "FRAU",
    "ORACLE": "ORAKEL",
    "RED SAGE": "ROTER WEISE",
    "SAMOS": "SAMOS",
    "SCULPTOR": "BILDHAUER",
    "WARRIOR": "KRIEGER",
    "WILLARD": "WILLARD",
    "WOMAN": "ALTER MANN",
    "YELLOW SAGE": "GELBER WEISE"
  }
}
