{
  "cutscenes": {
    "assistant-firecanyon-resolution": [
      "SNYGGT! NI HAR DOM 20 ENERGICELLERNA SOM BEHÖVS FÖR ATT DRIVA MIN VÄRMESKÖLD!",
      "VAR FÖRSIKTIGA NU, FÖR SKÖLDEN KOMMER BARA ATT SKYDDA ER ZOOMER",
      "TILLS DEN NÅR 500 GRADER, SÅ FÖRSÖK ATT HÅLLA HENNE SVAL.",
      "ATT FLYGA ÖVER ÖPPEN LAVA KOMMER DEFINITIVT VÄRMA UPP ER SNABBT.",
      "NÅ 500 GRADER, OCH DET ÄR KÖRT.",
      "KÖRT?! SOM I BRINNANDE-SMÄLT-METALL-KÖRT?!",
      "ELDRAVINEN KAN BLI GANSKA VARM, SÅ HÅLL UTKIK EFTER HOPP",
      "FÖR ATT HÅLLA ER BORTA FRÅN DEN VARMA MARKEN.",
      "JAG HAR OCKSÅ SLÄPPT UT ETT ANTAL BLÅA KYLBALLONGER SOM NI KAN ANVÄNDA FÖR ATT FÅ NER",
      "SKÖLDENS TEMPERATUR SNABBT.",
      "ÅH! OCH NÄR NI KOMMER TILL ANDRA SIDAN, GLÖM INTE BORT ATT AKTIVERA",
      "TELEPORTALEN I DEN BLÅ VISMANNENS LABB.",
      "DÅ KAN VI TELEPORTERA DIT SEN OCH MÖTA UPP ER!",
      "LYCKA TILL!"
    ],
    "assistant-introduction-blue-eco-switch": [
      "HALLÅ DÄR SÖTNOS. VAD SÄGS OM ATT DU OCH JAG TAR EN ÅKTUR PÅ DENNA A-GRAV-ZOOMER?",
      "REGEL NUMMER ETT: JAG DEJTAR INTE DJUR.",
      "ÅH DU VET INTE VAD DU GÅR MISTE OM, HE HE.",
      "HÖR HÄR, OM NI BEHÖVER NÅGOT ATT SYSSELSÄTTA ER MED SÅ PRATAR MIN FAR ALLTID",
      "OM ETT URÅLDRIGT PRECURSOR-RÖRSYSTEM SOM FANNS DOLT DJUPT UNDER MARKEN.",
      "NÅGRA AV DOM HÄR RÖREN MYNNAR VID KÄLLOR DÄR ECO FLÖDAR,",
      "MEN NÅGRA HAR BLIVIT STÄNGDA SÅ ATT ECO HÅLLS TILLBAKA.",
      "DET MÅSTE FINNAS ETT SÄTT ATT SLÅ PÅ DOM AVSTÄNGDA KÄLLORNA.",
      "JAG HAR SPÅRAT DELAR AV RÖRSYSTEMET TILLBAKA TILL DET FÖRBJUDNA TEMPLET.",
      "KANSKE BORDE NI LETA DÄR EFTER NÅGON SLAGS KNAPP."
    ],
    "assistant-introduction-race-bike": [
      "HALLÅ DÄR, SÖTNOS. VAD ÄR DET DÄR DU ARBETAR MED?",
      "VAR FÖRSIKTIG MED DET DÄR! JAG FÖRSÖKER LISTA UT ETT SÄTT ATT TRANSPORTERA ZOOMERN",
      "GENOM ATT ANVÄNDA TRANSPORTPLATTORNA SOM PRECURSORS LÄMNADE EFTER SIG ÖVER HELA VÄRLDEN.",
      "OM NI HITTAR EN AV DESSA PLATTORNA SÅ KAN JAG LÅSA IN ER KOMMUNIKATÖRS PLATS",
      "OCH SKICKA ÖVER ZOOMERN TILL ER!",
      "HÅLL UTKIK EFTER EN TRANSPORTPLATTA NÄR NI UTFORSKAR DIMMIGA ÖN, OCH PÅ ALLA ANDRA STÄLLEN NI KOMMER TILL!"
    ],
    "assistant-lavatube-end-resolution": [
      "HALLÅ! VAR ÄR DEN DÄR GAMLA GRÖNA SKRUTTEN?",
      "DET HÄR ÄR FRUKTANSVÄRT! MIN PAPPA ÄR FÖRSVUNNEN!",
      "JAG TROR ATT GOL OCH MAIA KAN HA KIDNAPPAT HONOM OCKSÅ!",
      "TA DET LUGNT, SÖTNOS. JAG HAR ALLT UNDER KONTROLL.",
      "UNDER KONTROLL?!",
      "LURKARMÉER FORTSÄTTER ATT VÄXA RUNT OM HELA LANDET,",
      "VISMÄNNEN HAR BLIVIT KIDNAPPADE,",
      "GOL OCH MAIA HAR SAMLAT IHOP TILLRÄCKLIGT MED ECO",
      "FÖR ATT KUNNA GENOMFÖRA SIN HEMSKA PLAN,",
      "OCH FÖR ATT KUNNA STOPPA DEM, SÅ MÅSTE NI",
      "SLÅ ER FRAM HELA VÄGEN GENOM DERAS CITADELL!",
      "EH... JA. SÅ KAN MAN, EH... NOG SAMMANFATTA DET HELA.",
      "NI MÅSTE RÄDDA MIN FAR INNAN DET ÄR FÖR SENT!",
      "OCH JAK...",
      "VAR FÖRSIKTIG.",
      "JAPP. VI KOMMER ATT VARA FÖRSIKTIGA!"
    ],
    "assistant-lavatube-start-resolution": [
      "HA HA! OK DÅ!",
      "MED DOM HÄR YTTERLIGA KRAFTCELLERNA, SÅ SKULLE JAG KUNNA GE TILLRÄCKLIGT MED ENERGI ÅT VÄRMESKÖLDEN",
      "FÖR ATT KUNNA STÅ EMOT DEN HÄR LAVAN.",
      "MEN SKÖLDEN HAR FORTFARANDE EN GRÄNS.",
      "DEN KAN NU STÅ EMOT TEMPERATURER UPP EMOT 800 GRADER, MEN INTE MER.",
      "SÅ FÖRSÖK ATT HÅLLA ETT ÖGA PÅ ER MÄTARE.",
      "JAG VILL INTE TÄNKA PÅ VAD DOM DÄR TEMPERATURERNA SKULLE GÖRA MED ER ZOOMER",
      "OM SKÖLDEN SKULLE GE VIKA.",
      "JUST DET, HETTAN...",
      "VAD DÅ? ZOOMERN? HÖRRU! VAD KOMMER ATT HÄNDA MED OSS?!",
      "TROR DU INTE ATT VI KAN LETA EFTER EN SÄKRARE VÄG TILL GOLS CITADELL?",
      "HÖR HÄR, JAG HAR SLÄPPT UT FLER KYLBALLONGER INNE I TUNNELN.",
      "SÅ NI KAN ANVÄNDA DOM FÖR ATT HÅLLA NERE TEMPERATUREN.",
      "OCH GLÖM INTE BORT ATT AKTIVERA TELEPORTALEN I DEN GULE VISMANNENS LABB.",
      "VI RÄKNAR MED ER."
    ],
    "assistant-reminder-1-blue-eco-switch": [
      "JAG ÄR SÄKER PÅ ATT OM NI TITTAR I DET FÖRBJUDNA PRECURSOR-TEMPLET",
      "SÅ KOMMER NI HITTA ETT SÄTT ATT AKTIVERA DEN DÄR AVSTÄNGDA BLÅ ECO-KÄLLAN PÅ VÄKTARSTRANDEN."
    ],
    "assistant-reminder-1-generic": [
      "HALLÅ DÄR KILLAR! FORTSÄTT SAMLA KRAFTCELLER.",
      "DOM ÄR NYCKELN TILL ATT KUNNA FORTSÄTTA VÅR RESA NORRUT."
    ],
    "assistant-reminder-1-race-bike": [
      "JAG HAR DEFINITIVT KOMMIT PÅ HUR MAN ANVÄNDER DOM HÄR TRANSPORTPLATTORNA.",
      "STICK IVÄG TILL DIMMIGA ÖN NU SÅ SKICKAR JAG ÖVER ZOOMERN TILL ER."
    ],
    "assistant-village2-introduction": [
      "JISSES!",
      "JAG TROR INTE JAG NÅGONSIN KOMMER VÄNJA MIG VID DEN DÄR KITTLANDE KÄNSLAN AV ATT BLI TELEPORTERAD.",
      "NÄMEN TITTA!",
      "DET VERKAR SOM DEN BLÅ VISMANNEN HADE EN FEST.",
      "KÄRA NÅN! STENBYN BRINNER!",
      "EN RIKTIK BRAKFEST.",
      "NEJ, NEJ! JAG MENAR ATT STENBYN HÅLLER PÅ ATT BOMBARDERAS MED BRINNANDE STENAR!",
      "ÅH! OCH DET SER UT SOM ATT DEN BLÅ VISMANNEN ARBETAR PÅ EN LEVITERINGSMASKIN FÖR ATT KUNNA FLYTTA DOM.",
      "OM VI ANTAR ATT DEN FUNGERAR, SÅ KOMMER VI BEHÖVA KRAFTCELLER FÖR ATT KUNNA GE ENERGI ÅT DEN.",
      "JAG ANTAR ATT NI TVÅ BEHÖVER SAMLA IN NÅGRA FLER.",
      "VI BORDE TA EN TITT PÅ HANS ANTECKNINGAR.",
      "JAK, GÅ OCH SE HUR BYBORNA HAR DET, OCH KOM SEDAN TILLBAKA HIT OCH GE OSS EN UPPDATERING.",
      "OCH TA MED DIG PÄLSBOLLEN!"
    ],
    "assistant-village2-introduction-flutflut": [
      "SÅ NI ÄR REDAN TILLBAKA, POJKAR?",
      "\"POJKE\"?",
      "HÖRRU DU SÖTNOS, JAG ÄR FAKTISKT EN FULLVUXEN...",
      "EH...",
      "NÅNTING... NÅNTING LUDET.",
      "HEJ, VET NI VAD? MED TILLÅTELSE FRÅN VÅR BYS FÅGELSKÅDARE,",
      "SÅ HAR JAG UTRUSTAT FLUTT-FLUTTUNGEN MED EN RIDSADEL.",
      "DET SKALL TYDLIGEN FINNAS EN PRECURSOR-TRANSPORTPLATTA I SUMPIGA TRÄSKET.",
      "OM NI KAN HITTA DEN, SÅ SKICKAR JAG ÖVER FLUTT-FLUTT I FULL RIDMUNDERING.",
      "HENNES LÅNGA HOPP SKULLE KUNNA KOMMA VÄL TILL PASS NÄR NI SKA TA ER ÖVER TJÄRAN."
    ],
    "assistant-village2-introduction-robbers": [
      "HALLÅ DÄR, NI TVÅ!",
      "JAG VET VAR NI KAN HITTA YTTERLIGARE EN KRAFTCELL!",
      "ENLIGT HANS ANTECKNINGAR,",
      "FÖR NÅGRA DAGAR SEDAN SÅ STAL NÅGRA FLYGANDE LURKAR EN FRÅN DEN BLÅ VISMANNEN,",
      "OCH FLÖG IVÄG IN I PRECURSOR-DALEN.",
      "JAG SLÅR VAD OM ATT NI SKULLE KUNNA MEJA NER LURKARNA MED ER ZOOMER",
      "TILLS NI HITTAR DEN SOM HAR KRAFTCELLEN.",
      "NI HITTAR ZOOMERN PÅ TRANSPORTPLATTAN VID INGÅNGEN TILL PRECURSOR-DALEN."
    ],
    "assistant-village2-introduction-room": [
      "TYDLIGEN ÄR DET SÅ ATT PRECURSOR-STRUKTUREN UTANFÖR KUSTEN",
      "LEDER TILL EN FÖRLORAD UNDERVATTENSSTAD.",
      "DEN BLÅ VISMANNEN HAR FÖRSÖKT KOMMA PÅ ETT SÄTT",
      "FÖR HUR HAN SKULLE KUNNA FÅ UPP ETT AV RUMMEN TILL YTAN.",
      "MEN HAN LYCKADES ALDRIG.",
      "NI BORDE GÅ OCH KOLLA IN DET!",
      "UH... FINNS DET INTE MÅNGA, UH...",
      "LURKHAJAR I VATTNEN?",
      "HUR SÅ? ÄR DU RÄDD?",
      "JAG? SÅ KLART INTE!",
      "JAG ÄR BARA OROLIG FÖR JAK!",
      "DU VET, EH, ASSÅ...",
      "DU VET VILKEN FEGIS HAN KAN VARA.",
      "NÅVÄL, OM NI SIMMAR UT ÖVER KORRALREVEN, SÅ TVIVLAR JAG PÅ ATT LURKHAJARNA SKULLE BRY SIG OM ER.",
      "DOM TYCKER INTE OM GRUNT VATTEN."
    ],
    "assistant-village2-reminder-1-flutflut": [
      "JAG ÄR SÄKER PÅ ATT EN FLUTT-FLUTT SKULLE KOMMA VÄL TILL PASS FÖR ER I TRÄSKET.",
      "OM NI HITTAR TRANSPORTPLATTAN SÅ TELEPORTERAR JAG ÖVER HENNE DIT."
    ],
    "assistant-village2-reminder-1-robbers": [
      "JAG KOMMER ATT TELEPORTERA ÖVER ER ZOOMER TILL ER VID PRECURSOR-DALEN,",
      "SÅ NI KAN JAGA I KAPP DOM DÄR FLYGANDE LURKARNA VI PRATADE OM."
    ],
    "assistant-village2-reminder-1-room": [
      "HAR NI SIMMAT UT TILL DEN FÖRLORADE PRECURSOR-STADEN ÄN?",
      "NI BORDE VERKLIGEN  FÖRSÖKA LYFTA UPP RUMMET SOM DEN BLÅ VISMANNEN VAR UTE EFTER."
    ],
    "assistant-village2-resolution": [
      "PERFEKT, NI HAR MED ER CELLERNA TILL MASKINEN!",
      "DOM BORDE GE TILLRÄCKLIGT MED KRAFT FÖR ATT KUNNA LYFTA UPP DEN DÄR STENEN.",
      "SÅ DÄR JA!",
      "VAR FÖRSIKTIGA NU, NÄR NI MÖTER DEN DÄR MONSTERLURKEN UPPE VID TOPPEN.",
      "VÄNTA! ÖH...",
      "JAG STANNAR HÄR OCH SKYDDAR KEIRA!",
      "JAK, JAG TROR ATT DU ÄR REDO FÖR ATT KUNNA HANTERA DET DÄR MONSTRET UTAN MIG.",
      "ÅH, SÅ HIMLA HJÄLTEDÅDIGT AV DIG."
    ],
    "assistant-village3-reminder": [
      "HALLÅ DÄR KILLAR! FORTSÄTT ATT SAMLA KRAFTCELLER.",
      "DOM ÄR NYCKELN TILL ATT KUNNA FORTSÄTTA VÅR RESA NORRUT."
    ],
    "billy-accept": [
      "PERFEKT! DOM DÄR RÅTTORNA KOMMER VARA TILLBAKA NÄR SOM HELST.",
      "SKJUT ALLA RÅTTORNA, OCH HÅLL DOM BORTA",
      "FRÅN ATT ÄTA MINST EN AV DOM DÄR MATBITARNA."
    ],
    "billy-introduction": [
      "GODDAG, VÄNNER! TRIVS NI I MITT TRÄSK?",
      "DET ÄR JAG SOM ÄGER DOM HÄRINGA MARKERNA.",
      "ALLT SOM INTE SJUNKER NER I LERAN, ALLTSÅ! HA HA HA...",
      "AV LUKTEN ATT DÖMA, SÅ MISSTÄNKER JAG ATT DITT",
      "BADKAR SJÖNK NER I LERAN FÖR LÄNGE SEDAN.",
      "VAD ÄR ETT BADKAR?",
      "I ALLA FALL, JAG HAR STÖRRE PROBLEM NU...",
      "DET VERKAR SOM ATT NÅGRA VIDRIGA LURKARKRYP SMYGER OMKRING HÄR,",
      "DOM ROFFAR ÅT SIG ALLT DOM KAN LÄGGA SINA GIRIGA SMÅ LABBAR PÅ.",
      "OCH SKRÄMMER BORT MIN FLODGRIS, FARTHY.",
      "HAN HAR VARIT BORTA I EVIGHETER.",
      "JAG HAR FÖRSÖKT LÄGGA UT HANS FAVORITMAT,",
      "MEN DOM DÄR ELAKA TRÄSKRÅTTORNA BARA STJÄL DOM HELA TIDEN!",
      "OM NI SKULLE KUNNA HÅLLA DOM DÄR IRRITERANDE KRYPEN BORTA TILLRÄCKLIGT LÄNGE,",
      "SÅ ÄR JAG SÄKER PÅ ATT FARTHY SKULLE KÄNNA DOFTEN AV MAT OCH KOMMA TILLBAKA!",
      "SKULLE NI VILJA HJÄLPA MIG?"
    ],
    "billy-reject": [
      "JAHA, OM NI SKULLE ÄNDRA ER, SÅ VET NI VAR JAG ÄR!",
      "HÖ HÖ HÖ HÖ HÖH..."
    ],
    "billy-reminder-1": [
      "ÅH, ÄR NI TILLBAKA FÖR ATT HJÄLPA MIG STOPPA DOM DÄRINGA RÅTTORNA?"
    ],
    "billy-resolution": [
      "NÄMEN DRA MIG BAKLÄNGES! NI VET VERKLIGEN HUR MAN SKJUTER!",
      "TACK SÅ HEMSKT MYCKET FÖR HJÄLPEN."
    ],
    "bird-lady-beach-resolution": [
      "ÅH KÄRA NÅN, JAG HOPPAS DEN LILLE STACKARN HAR KLARAT SIG.",
      "HÄR HAR NI EN KRAFTCELL FÖR ERT HJÄLTEMOD.",
      "MAMMA!",
      "MAMMA!",
      "ÅH NEJ! NEJ, NEJ, NEJ, NEJ!",
      "MEN HAR MAN SETT... ÄR DET INTE GULLIGT? DEN TROR ATT DU ÄR DENS MAMMA.",
      "VA? JAG ÄR INTE DIN MAMMA! SER DU NÅGRA FJÄDRAR HÄR?",
      "ÅH, KÄRLEK VID FÖRSTA ÖGONKASTET! ÅH...",
      "HÖR NI, POJKAR, JAG TAR MED MIG DEN HÄR LILLA KYCKLINGEN TILLBAKA TILL BYN",
      "OCH ÖVERTYGAR VISMANNEN ATT TA HAND OM HENNE."
    ],
    "bird-lady-introduction": [
      "MEN KÄRA NÅN, VILKEN FÖRSKRÄCKLIG LITEN SJUK FÅGEL VI HAR HÄR.",
      "VA! DU SER INTE HELLER SÅ PIGG UT, DAMEN!",
      "ÅH, FÖRLÅT MIG. JAG TRODDE DU VAR EN FLÄCKIG",
      "ORANGE-BUKAD RUGGUGGLA.",
      "VET DU, IGÅR SÅG JAG NÅGRA",
      "FRUKTANSVÄRT ELAKA VARELSER FÅNGA",
      "EN VUXEN FLUTT-FLUTT VID STRANDEN.",
      "SÅ NU FINNS DET ETT STACKARS LITET ÖVERGIVET ÄGG",
      "SOM LIGGER I ETT BO PÅ TOPPEN AV KLIPPAN",
      "OCH JAG KAN INTE NÅ DET.",
      "OM DU SKULLE KUNNA KLÄTTRA UPP DÄR OCH KNUFFA NER DET, SÅ HAR JAG PACKAT",
      "LITE HÖ NERE VID FOTEN FÖR ATT FÅNGA DET SÄKERT.",
      "GÖR EN GAMMAL DAM EN TJÄNST, OCH JAG GER ER EN KRAFTCELL."
    ],
    "bird-lady-reminder-1": [
      "NÄMEN, HALLÅ IGEN. LYCKADES NI POJKAR HITTA DET BLÅ ÄGGET PÅ KLIPPAN?",
      "KNUFFA NER DET ÖVER KANTEN OCH JAG GER ER EN KRAFTCELL!"
    ],
    "bird-lady-reminder-2": [
      "ÄR NI POJKAR FORTFARANDE KVAR HÄR OCH PICKAR? HO HO HO.",
      "JAG SLÅR VAD OM ATT DET DÄR STACKARS LILLA BLÅ ÄGGET PÅ KLIPPAN",
      "HÅLLER PÅ ATT BLI VÄLDIGT KALLT VID DET HÄR LAGET.",
      "GÅ DIT OCH RÄDDA DET GENOM ATT KNUFFA NER DET FRÅN KANTEN AV KLIPPAN,",
      "OCH JAG GER ER EN KRAFTCELL."
    ],
    "bluesage-resolution": [
      "BRA JOBBAT, GOSSAR! GAMLE SAMOS HADE RÄTT OM ER!",
      "HERREJÖSES!",
      "DEN DÄR LÖMSKA MEKANISKA SKAPELSEN",
      "FÅR INTE TILLÅTAS SPRIDA SIN HEMSKA FÖRSTÖRELSE!",
      "JAG SKA FÖRSÖKA AKTIVERA SKÖLDDÖRREN",
      "GENOM ATT LEDA EN STRÅLE AV ENERGI",
      "MELLAN MIG SJÄLV OCH DEN STORA PORTALEN DÄR NERE!",
      "EH... VISST. GÖR DU SÅ. VI KOMMER EH... BARA GÅ OCH SKAFFA MER HJÄLP.",
      "KNÄPPJÖK!"
    ],
    "death-0181": [
      "GÅ INTE IN I LJUSET, JAK! GÅ INTE IN I LJUSET!"
    ],
    "death-0182": [
      "HEJ, JAK! KAN JAG...",
      "FÅ DIN INSEKTSSAMLING?"
    ],
    "death-0184": [
      "MEDAN DU ÄR DÄR NERE, EH...",
      "SKULLE DU KUNNA MASSERA MINA FÖTTER?"
    ],
    "death-0186": [
      "VAR INTE OROLIG! JAG KOMMER HÄMNAS DIG!",
      "...INTE."
    ],
    "death-0187": [
      "NÅ, EH...",
      "HELLRE DIG ÄN MIG."
    ],
    "death-0191": [
      "DET DÄR SÅG UT ATT GÖRA ONT.",
      "SKA JAG KALLA PÅ FÖRSTÄRKNING?"
    ],
    "death-0193": [
      "STEG 1: HÅLL DIG VID LIV!",
      "STEG TVÅ...",
      "TÄNK PÅ ATT INTE GÖRA NÅGOT SÅDANT IGEN!"
    ],
    "death-0195": [
      "JAG VAR PRECIS BAKOM DIG, JAK!",
      "...SÄKERT. JAG LOVAR."
    ],
    "death-0197": [
      "GÖR HEIMLICH! EH... HÄMTA EN BÅR!",
      "USCH...MINT FÖR ANDEDRÄKTEN?"
    ],
    "death-0199": [
      "JAG KOMMER SÄGA NÅGOT RIKTIGT SORGLIGT VID BEGRAVNINGEN, SOM...",
      "...\"HUR SKA JAG KUNNA BLI ÄNDRAD TILLBAKA NU?!\""
    ],
    "death-0202": [
      "SÄG GOD NATT, JAK!"
    ],
    "evilbro-misty-end": [
      "DOM DÄR TVÅ KAN VISA SIG VARA TRUBBEL.",
      "OROA DIG INTE KÄRE BROR, JAG SKICKAR MIN LURKARMÉ FÖR ATT TA HAND OM DOM.",
      "SE BARA TILL ATT DOM INTE KOMMER FÖR NÄRA VÅRA NORRA OPERATIONER.",
      "JAG TROR INTE DOM KOMMER SÅ LÅNGT.",
      "MEN OM DOM GÖR DET, VÄNTAR EN ÖVERRASKNING PÅ DOM I STENBYN.",
      "SÅ...DU TÄNKER SLÄPPA...KLAWW UT UR SIN BUR?",
      "JAG TYCKER DET ÄR VÄRT RISKEN.",
      "SANNERLIGEN..."
    ],
    "explorer-introduction": [
      "NÄMEN, HALLÅ DÄR KÄRA GOSSE.",
      "NI HAR LYCKATS STÖTA PÅ MIG VID ETT MYCKET OTURLIGT TILLFÄLLE.",
      "JAG SKULLE HA BEGETT UT PÅ MINA RESOR IGÅR",
      "MEN DET VERKAR SOM JAG HAR LITE ONT OM PRECURSOR-KULOR.",
      "JAG KUNDE HA SVURIT PÅ ATT JAG HADE 90 STYCKEN,",
      "MEN JAG MISSTÄNKER ATT DIN UNGA VÄN, DU VET, DEN",
      "DÄR LILLA IRRITERANDE MISERABELT FULA",
      "KAN HA TAGIT ALLA SOM NÅGOT SLAGS SPRATT.",
      "HUR SOM, SKULLE DU KUNNA VARA SÅ SNÄLL ATT LÅNA DIN KÄRA GAMLA FARBROR",
      "90 PRECURSOR-KULOR SÅ ATT HAN KAN BEGE SIG IVÄG?",
      "JAG ERBJUDER DIG EN KRAFTCELL I UTBYTE."
    ],
    "explorer-reminder-1": [
      "VAD ÄR DETTA? DU HAR FORTFARANDE INTE HELA MÄNGDEN MED DIG? HMPF!",
      "NÅ, ALLT UNDER 90 PRECURSOR-KULOR",
      "OCH JAG KOMMER INTE HA EN CHANS ATT BEGE MIG IVÄG, KÄRA GOSSE."
    ],
    "explorer-reminder-2": [
      "ÅH SE NU, VI KOM ÖVERENS OM 90 PRECURSOR-KULOR FÖR EN KRAFTCELL.",
      "ETT RIKTIGT JÄMNT UTBYTE."
    ],
    "explorer-resolution": [
      "JAG SER ATT NI TVÅ ÄR TILLBAKA FÖR ATT GENOMFÖRA BYTET. BRA, BRA, MYCKET BRA!",
      "ÄH, DU HAR MED DIG ÖH, DOM PRECURSOR-KULOR VI KOM ÖVERENS OM?",
      "JAG HOPPAS ATT DU FÅR ANVÄNDNING AV DEN HÄR SURT FÖRVÄRVADE KRAFTCELLEN.",
      "TACK SÅ MYCKET, GODDAG, ADJÖ!"
    ],
    "farmer-introduction": [
      "MÅSTE MJÖLKA DOM DÄRINGA JAKORNA, MÅSTE MJÖLKA JAKORNA...",
      "ÅH! DET ÄR NI... JAG VILAR BARA MINA TRÖTTA BEN.",
      "JAG HAR FÖRSÖKT ATT FÅ DOM DÄR ENVISA JAKORNA",
      "TILLBAKA IN I FÅLLAN HELA DAGEN!",
      "NÅGRA MÄRKLIGA VARELSER FÖRSÖKTE STJÄLA DOM TIDIGARE.",
      "TROR DU ATT DU SKULLE KUNNA HJÄLPA EN GAMMAL MAN ATT FÖRSÖKA FÅ DOM ATT GÅ TILLBAKA IN I FÅLLAN?"
    ],
    "farmer-reminder-1": [
      "HALLÅ DÄR! MINA JAKOR ÄR FORTFARANDE LÖSA!",
      "ÖH, SKULLE DU KUNNA HÄMTA IN DOM ÅT MIG NÅGON GÅNG?"
    ],
    "farmer-reminder-2": [
      "DOM DÄR JÄKLA JAKORNA STRÖVAR FORTFARANDE FRITT.",
      "SKA DU INTE TA OCH JAGA IN DOM I FÅLLAN NÅGON GÅNG?"
    ],
    "farmer-resolution": [
      "AH, BRA JOBBAT POJK. DU LYCKADES FAKTISKT FÅ DOM DÄR LUSPUDLARNA TILLBAKA I FÅLLAN.",
      "NU KAN JAG SOVA LUGNT. TA DEN HÄR KRAFTCELLEN FÖR DITT BESVÄR."
    ],
    "finalbosscam-white-eco": [
      "LJUS ECO! DEN FINNS VERKLIGEN!",
      "DOM FÅR INTE LÅTAS FÅ TAG PÅ DET!"
    ],
    "fisher-accept": [
      "DET FINNS TVÅ BRA SORTERS FISK ATT FÅNGA:",
      "ENKILOS FISKAR, OCH FEMKILOS FISKAR.",
      "HÖR PÅ HÄR. OM NI SKULLE MISSA 20 KILO BRA FISK",
      "KOMMER JAG ATT TA TILLBAKA MITT NÄT FRÅN ER!",
      "DET FINNS GIFTIGA ÅLAR I DEN HÄR FLODEN.",
      "OM NI FÅNGAR EN ENDA AV DOM KUSARNA",
      "SÅ KOMMER NI ATT FÖRGIFTA HELA JÄKLA FÅNGSTEN!"
    ],
    "fisher-introduction": [
      "VAD HAR DU DÄR I KORGEN?",
      "INGET ATT SKRYTA OM.",
      "DOM DÄR MONSTREN SOM PATRULLERAR HAVEN",
      "TOG ETT BETT AV MIN FISKERIGG.",
      "OCH NU HÅLLER DOM PÅ ATT ÄTA UPP MIN FÅNGST!",
      "VAD JAG ÄN FÖRSÖKDER, SÅVERKAR JAG INTE KUNNA FÅNGA EN ENDA FISK I DEN HÄR FLODEN.",
      "JÖSSES! KANSKE... ÄR DET DIN ANDEDRÄKT.",
      "TROR NI ATT NI SKULLE LYCKAS BÄTTRE?",
      "FÖRSÖK ATT FÅNGA UPP FISK FRÅN FLODEN MED ETT LITET NÄT!",
      "JAG GER ER EN KRAFTCELL",
      "OM NI LYCKAS FÅNGA 200 KILO AV DOM DÄR SMÅ KRYPEN!",
      "OCH JAG LÅTER DIG OCH DEN LILLA RÄKAN HÄR",
      "ANVÄNDA MIN MOTORBÅT FÖR ATT TA ER TILL DIMMIGA ÖN.",
      "VILL NI FÖRSÖKA ER PÅ UTMANINGEN?"
    ],
    "fisher-reject": [
      "NÅ, OM NI VILL FÖRSÖKA VINNA DEN HÄR KRAFTCELLEN NÅGON GÅNG",
      "SÅ VET NI VAR NI KAN HITTA MIG."
    ],
    "fisher-reminder-1": [
      "VILL NI FÖRSÖKA SLÅ FLODEN, ELLER?"
    ],
    "fisher-resolution": [
      "NI GJORDE DET! NI LYCKADES FÅNGA 200 KILO FISK!",
      "INTE ILLA FÖR ATT VARA ETT PAR LANDKRABBOR!",
      "HÄR HAR NI KRAFTCELLEN JAG LOVADE ER",
      "OCH NI KAN ANVÄNDA MIN BÅT I HAMNEN I BYN",
      "NÄR SOM HELST!"
    ],
    "fishermans-boat-ride-to-village1-alt": [
      "DOM DÄR TVÅ KAN VISA SIG VARA TRUBBEL.",
      "OROA DIG INTE KÄRE BROR, JAG SKICKAR MIN LURKARMÉ FÖR ATT TA HAND OM DOM.",
      "SE BARA TILL ATT DOM INTE KOMMER FÖR NÄRA VÅRA NORRA OPERATIONER.",
      "JAG TROR INTE DOM KOMMER SÅ LÅNGT.",
      "MEN OM DOM GÖR DET, VÄNTAR EN ÖVERRASKNING PÅ DOM I STENBYN.",
      "SÅ...DU TÄNKER SLÄPPA KLAWW UT UR SIN BUR?",
      "JAG TYCKER DET ÄR VÄRT RISKEN.",
      "SANNERLIGEN."
    ],
    "gambler-introduction-1": [
      "ÅH, NEJ. INTE EN TILL \"HJÄLTE\".",
      "JAG FÖRLORADE MINA BYXOR PÅ DEN HÄR SÅ KALLADE HJÄLTENS STORA FIGHT",
      "MOT MONSTRET DÄR UPPE.",
      "TRO MIG, DET ÄR KLOKAST ATT SATSA PENGAR PÅ MONSTRET.",
      "DEN DÄR SATSNINGEN KOSTADE MIG ALLT!",
      "SÅ JAG HAR ETT FÖRSLAG.",
      "KOM HIT MED 90 KULOR FÖR ATT FÅ MIG PÅ FÖTTER IGEN OCH UT UR DEN HÄR TUNNAN,",
      "OCH JAG KOMMER ATT GE ER EN KRAFTCELL I UTBYTE.",
      "OCH OM NI ÄR SUGNA, SÅ HAR JAG EN ANNAN SATSNING PÅ GÅNG.",
      "MIN STORA ÅTERKOMST!",
      "SLÅ REKORDTIDEN ATT FLYGA IGENOM DÖD MANS KLYFTA I PRECURSOR DALEN,",
      "OCH JAG FÅR EN FIN BELÖNING!",
      "OM NI GÖR DET, SÅ GER JAG ER YTTERLIGARE EN KRAFTCELL."
    ],
    "gambler-reminder-money": [
      "HÖRRNI. GLÖM INTE BORT DOM DÄR KULORNA SOM JAG BEHÖVER.",
      "90 KOMMER ATT GE ER EN. EN KRAFTCELL, ALLTSÅ!"
    ],
    "gambler-reminder-race": [
      "NÄ, VAD VÄNTAR NI PÅ?",
      "DEN HÄR TUNNAN BÖRJAR BLI KLIBBIG!",
      "SLÅ DEN BÄSTA TIDEN NERE I DÖD MANS KLYFTA,",
      "OCH VI KOMMER BÅDA ATT BLI VINNARE!"
    ],
    "gambler-resolution-money": [
      "HI HI HI! ÅH, JA!",
      "DOM HÄR KULORNA KOMMER HJÄLPA MIG VINNA MIG TILLBAKA UT UR DEN HÄR TUNNAN!",
      "HÄR HAR NI KRAFTCELLEN SOM JAG LOVADE ER!"
    ],
    "gambler-resolution-race": [
      "ÅH, SNYGGT, KILLEN! JAG VISSTE ATT DEN DÄR REKORDTIDEN SKULLE SLÅS.",
      "HÄR HAR NI ER KRAFTCELL, OCH JAG KAN GÅ OCH HÄMTA MIN STORA BELÖNING!"
    ],
    "geologist-introduction": [
      "NI TVÅ SER UT SOM ETT PAR KAPABLA PERSONER.",
      "JAG HÅLLER PÅ MED ETT FORSKNINGSPROJEKT,",
      "OCH NI SKULLE KANSKE KUNNA HJÄLPA MIG.",
      "HÖRRU, VI ÄR DOM SOM ÄR UTE PÅ ETT STORT UPPDRAG.",
      "VI BER DIG OM HJÄLP.",
      "JAHA, VI KAN KANSKE HJÄLPA VARANDRA.",
      "JAG HAR STUDERAT BLIXTMULLVADARS GRÄVVANOR",
      "I PRECURSOR-DALEN BREDVID VÅR BY UNDER FLERA ÅR.",
      "MEN NU HAR DOM DÄR HEMSKA LURKARNA SKRÄMT MULLVADARNA UPP TILL YTAN!",
      "OCH EFTERSOM DOM ÄR BLINDA SOM FLADDERMÖSS SÅ KAN DOM INTE HITTA TILLBAKA NER UNDER MARKEN.",
      "OM NI SKULLE KUNNA FÖSA TILLBAKA DOM NER I SINA GRÄVTUNNLAR,",
      "SÅ SKULLE NI KANSKE KUNNA RÄDDA DERAS LIV.",
      "JAG HAR EN KRAFTCELL HÄR SOM SÄGER ATT NI KAN LYCKAS GÖRA DET.",
      "VISST, BLIXTMULLVADAR... VI BRYR OSS.",
      "KANSKE FÖR TVÅ KRAFTCELLER!",
      "BRA FÖRSÖK. MEN JAG SKULLE VARA VILLIG ATT GÖRA MIG AV MED YTTERLIGARE EN KRAFTCELL",
      "OM NI SKULLE KOMMA HIT MED 90 PRECURSOR KULOR FÖR MIN FORSKNINGSUTRUSTNING.",
      "LÅTER DET RÄTTVIST?"
    ],
    "geologist-reminder-moles": [
      "HAR NI LYCKATS FÖSA BLIXTMULLVADARNA TILLBAKA NER UNDER MARKEN?",
      "NI BORDE SKYNDA PÅ - DIREKT SOLLJUS ÄR INTE BRA FÖR DOM!"
    ],
    "geologist-reminder-money": [
      "JAG BEHÖVER DOM DÄR KULORNA OM JAG SKA KUNNA FORTSÄTTA MED MIN FORSKNING!"
    ],
    "geologist-resolution-moles": [
      "TACK FÖR ATT NI RÄDDADE LIVET PÅ DOM DÄR MULLVADARNA, DET VAR VÄLDIGT SNÄLLT AV ER.",
      "HÄR HAR NI EN KRAFTCELL FÖR ATT HJÄLPA ER.",
      "NU KAN JAG ÅTERGÅ TILL MIN FORSKNING!"
    ],
    "geologist-resolution-money": [
      "ÅH, NI HAR MED ER KULORNA!",
      "HÄR HAR NI EN KRAFTCELL SOM VI KOM ÖVERENS OM."
    ],
    "green-sagecage-daxter-sacrifice": [
      "LJUS ECO! DET SKULLE KUNNA VARA GREJEN SOM KAN ÄNDRA MIG TILLBAKA!!",
      "ELLER... SÅ SKULLE DET KUNNA STOPPA DEN DÄR ROBOTEN.",
      "ATT FÖRBLI LUDEN, ELLER ATT RÄDDA VÄRLDEN... DESSA BESLUT...",
      "OK, VISST, VI RÄDDAR VÄRLDEN.",
      "MEN GÖR DET SNABBT INNAN JAG ÄNDRAR MIG!"
    ],
    "green-sagecage-introduction": [
      "DET VAR PÅ TIDEN ATT NI TVÅ BESTÄMDE ER FÖR ATT DYKA UPP!",
      "TREVLIGT ATT SE DIG OCKSÅ!",
      "HAR DOM FÅTT DIG ATT BÖRJA MOPPA GOLVEN NU?",
      "VI HAR INTE TID FÖR SKÄMT, DAXTER. GOL OCH MAIA KIDNAPPADE OSS",
      "FÖR ATT DRÄNERA VÅRA KRAFTER OCH GE ENERGI ÅT DERAS FÖRFÄRLIGA MASKIN.",
      "DET VERKAR SOM ATT DOM HAR KOMBINERAT FUNGERANDE RESTER AV EN PRECURSOR-ROBOT",
      "MED ARTEFAKTER UPPSAMLADE ÖVER HELA LANDET.",
      "SEDAN LADE DOM TILL NÅGRA AV SINA EGNA HEMSKA TILLÄGG,",
      "VILKET SKAPADE DET ENDA TING KAPABELT TILL ATT ÖPPNA SILORNA MED MÖRK ECO.",
      "OM NI KAN FRIGÖRA OSS FYRA, SÅ KAN VI KOMBINERA VÅRA KRAFTER",
      "TILL ATT BRYTA KRAFTFÄLTET SOM OMGER ROBOTEN",
      "INNAN DOM ANVÄNDER DEN FÖR ATT FÖRSTÖRA VÄRLDEN."
    ],
    "green-sagecage-outro-beat-boss-a": [
      "GÖR NÅGOT!",
      "NEEEJ!"
    ],
    "green-sagecage-outro-beat-boss-b": [
      "NÅ, DET VERKAR SOM ATT JAG KANSKE VAR LITE FÖR HÅRD MOT ER POJKAR!",
      "NI HAR VERKLIGEN VAD SOM KRÄVS FÖR ATT BLI HJÄLTAR!",
      "MEN, DAXTER, VI KAN INTE ÄNDRA TILLBAKA DIG NU.",
      "VAR INTE OROLIG FÖR MIG, SÖTNOS.",
      "DU VET VAD DOM SÄGER: STORA SAKER KOMMER OFTA I SMÅ FÖRPACKNINGAR.",
      "JAK, DU HAR EN OTROLIG FÖRMÅGA ATT KUNNA KANALISERA ECO!",
      "SAMOS, DET VERKAR SOM ATT DU KAN HA HAFT RÄTT OM DEN HÄR TROTS ALLT!",
      "OCH KEIRA, UTAN DIN HJÄLP OCH UPPFINNINGSRIKEDOM",
      "SKULLE INGET AV DETTA HA VARIT MÖJLIGT.",
      "HM-HM-HM. KANSKE HAR VI FUNNIT ÄNNU EN VISMAN",
      "SÄRSKILT SOM GOL OCH MAIA VERKAR HA GÅTT FÖRLORADE NU...",
      "JA, GOL OCH MAIA... DEN MÖRKA ECON HAR ANTAGLIGEN FÖRINTAT DOM.",
      "EH, FÖRMODLIGEN...",
      "ÄH VEM BRYR SIG? HIT MED DOM BARA, FÖR VI KAN HANDSKAS MED DOM IGEN! ELLER HUR JAK?",
      "JAG SA, ELLER HUR, JAK?",
      "WOW! TARE LUGNT, TUFFING!"
    ],
    "green-sagecage-outro-beat-boss-enough-cells": [
      "MILDA MAKTER! VAD KAN DET DÄR VARA FÖR NÅGOT?",
      "WOW, DET ÄR EN URÅLDRIG PRECURSOR-DÖRR!",
      "DET VERKAR SOM ATT DEN BARA ÖPPNAS OM VI FYLLER ALLA 100 HÅLEN MED KRAFTCELLER!",
      "EH, VI ÄR HJÄLTAR, MINNS DU? VI HAR FAKTISKT 100 KRAFTCELLER!"
    ],
    "green-sagecage-outro-beat-boss-need-cells": [
      "MILDA MAKTER! VAD KAN DET DÄR VARA FÖR NÅGOT?",
      "WOW, DET ÄR EN URÅLDRIG PRECURSOR-DÖRR!",
      "DET VERKAR SOM ATT DEN BARA ÖPPNAS OM VI FYLLER ALLA 100 HÅLEN MED KRAFTCELLER!",
      "ÅH JÖSSES... DÅ KÖR VI IGEN!"
    ],
    "green-sagecage-outro-big-finish": [
      "WOW! VAD ÄR DET DÄR FÖR NÅGOT?",
      "DET ÄR SÅ VACKERT...",
      "HAR MAN SETT PÅ MAKEN..."
    ],
    "green-sagecage-outro-preboss": [
      "DU ÄR FÖR SENT UTE, SAMOS.",
      "SÅ FORT JAG BESITTER OBEGRÄNSAD MÖRK ECO",
      "SÅ KOMMER JAG ATT HA NYCKELN TILL SKAPELSEN SJÄLV!",
      "DET HÄR ÄR VANSINNE!",
      "ATT SLÄPPA UT SÅ MYCKET MÖRK ECO KOMMER ATT FÖRSTÖRA ALLT VI KÄNNER TILL!",
      "SE BARA VAD DET HAR GJORT MED ER!",
      "DET HAR GETT OSS EN SKÖNHET BORTOM ALLT DU SKULLE KUNNA FÖRSTÅ.",
      "SKÖNHET? HAR NI TVÅ KOLLAT ER I SPEGELN PÅ SISTA TIDEN?",
      "VÄNTA BARA TILL VI ÖPPNAR UPP SILORNA, LILLA VÄN.",
      "DU TROR ATT VARA KORT OCH LUDEN ÄR ILLA?",
      "OCH TÄNKA SIG, ATT NI TVÅ RESTE HELA VÄGEN HIT FÖR ATT BE OM MIN HJÄLP.",
      "DÅRAR! NJUT AV FÖRSTA PARKETT TILL VÄRLDENS ÅTERSKAPELSE!",
      "JAK! ÅK UPP MED HISSEN OCH STOPPA DEN DÄR ROBOTEN!"
    ],
    "green-sagecage-resolution": [
      "BRA JOBBAT, POJKAR! NU ÄR NI RIKTIGA HJÄLTAR.",
      "JAG KOMMER ATT KOMBINERA MIN GRÖNA ECO-KRAFT MED DOM TRE ANDRA VISMÄNNEN",
      "OCH TILLSAMMANS KOMMER VI ATT ÖPPNA SKÖLDDÖRREN SOM OMGER PRECURSOR-ROBOTEN.",
      "JA JA DET DÄR LÅTER SOM EN BRA BÖRJAN.",
      "OCH SEN EFTER ATT NI HAR ÖPPNAT SKÖLDEN",
      "VAD KOMMER NI ATT GÖRA MED ROBOTEN?",
      "INGENTING, DAXTER. VI MÅSTE FORTSÄTTA ATT HÅLLA SKÖLDEN ÖPPEN.",
      "DET ÄR UPP TILL ER TVÅ ATT FÖRSÖKA KOMMA PÅ ETT SÄTT ATT FÖRSTÖRA ROBOTEN.",
      "ÅH, PERFEKT. JAG KOMMER ATT FÅ HJÄLPA DEN SOM FÖRVANDLADE MIG TILL EN PÄLSBOLL",
      "MED ATT FÖRSTÖRA DEN ENDA PERSON SOM SKULLE KUNNA ÄNDRA TILLBAKA MIG!",
      "FÖRST, MÅSTE NI RÄDDA VÄRLDEN!",
      "SEN KAN VI FÖRSÖKA ÖVERTYGA GOL ATT HJÄLPA DAXTER."
    ],
    "mayor-introduction": [
      "NEJ... (MUTTRAR) SÄG INTE ATT NI TVÅ OCKSÅ HAR PROBLEM PRECIS SOM JAG!",
      "FÖRST HÖR JAG TALAS OM ATT MONSTER HAR SKÅDATS NÄRA BYN, OCH NU DETTA.",
      "KAN NI SE KUGGHJULEN DÄR UPPE, POJKAR? SER NI DEM? SER NI HUR DOM INTE RÖR PÅ SIG?",
      "DET BETYDER ATT VÅR BY INTE HAR NÅGON ENERGI!",
      "ECO-STRÅLEN SOM KOMMER FRÅN DJUNGELTEMPLET HAR BLIVIT AVBRUTEN!",
      "OCH POJKAR, ALLA ÄR FÖR RÄDDA FÖR ATT GÅ UT OCH TA REDA PÅ VAD SOM HAR HÄNT.",
      "HAR DU BETALAT RÄKNINGEN?",
      "VISST-ELLER? ÅH-HA-ÅH, DU ÄR ROLIG DU.",
      "MEN LYSSNA NU, OM NI POJKAR LYCKAS LAGA ECO-STRÅLEN, SÅ GER JAG ER EN KRAFTCELL.",
      "ÅH ÅH ÅH OCH-OCH EN ANNAN SAK, EH...",
      "OM DET ÄR SÅ ATT NI SKULLE VARA INTRESSERADE AV ATT GÖRA ETT BIDRAG TILL MIN OMVALSKAMPANJ,",
      "SÅ-SÅ SKULLE JAG VARA VILLIG ATT GE ER YTTERLIGARE EN KRAFTCELL!",
      "DET MINSTA BIDRAGET SKULLE VARA, FÅ SE, EN VÄLDIGT BLYGSAM SUMMA PÅ...",
      "90 PRECURSOR-KULOR."
    ],
    "mayor-reminder-beams": [
      "ÄR NI REDAN TILLBAKA? OCH UTAN ATT HA LAGAT ECO-STRÅLARNA?",
      "(SNYFTAR) ER BY BEHÖVER ER, POJKAR!"
    ],
    "mayor-reminder-donation": [
      "NÄMEN, ÄR NI HÄR FÖR ATT LÄMNA EN DONATION TILL MIN KAMPANJ, ÅH HO HO HO.",
      "90 PRECURSOR KULOR FÖR ATT KÖPA EN KRAFTCELL, TACK SÅ MYCKET."
    ],
    "mayor-resolution-beams": [
      "ÅH HO HO, VILKEN UNDERBAR SYN! JAG SKULLE VILJA TACKA ER SÅ MYCKET!",
      "OCH HELA BYN KOMMER ATT TACKA MIG-",
      "HÖR NI, POJKAR, NI HAR ÅTERSTÄLLT ENERGIN TILL BYN OCH GARANTERAT ATT JAG BLIR OMVALD!",
      "OCH FÖR DETTA, MIN POJKE, SÅ HAR NI FÖRTJÄNAT EN KRAFTCELL."
    ],
    "mayor-resolution-donation": [
      "SÅ EH, NI EH, SKULLE VILJA GÄMNA ETT BIDRAG? BRA... ETT-ETT-ETT STORT ETT HOPPAS JAG.",
      "JISSES! AH HA HA, DET HÄR ÄR, ÅH, DET HÄR ÄR ETT MYCKET STORT BIDRAG!",
      "JAG, J-J-J-JO JAG HOPPAS ATT DEN HÄR KRAFTCELLEN VISAR MIN TACKSAMHET TILLRÄCKLIGT."
    ],
    "minershort-introduction-gnawers": [
      "SKULLE INTE NI KUNNA TA OCH GÖRA LITE NYTTA?",
      "LURKAR HAR HÅLLT PÅ ATT GRÄVA UT DEN MÖRKA GROTTAN DÄR BORTA.",
      "DET VERKAR SOM ATT DOM ÄR UTE EFTER ATT HITTA PRECURSOR-ARTEFAKTER.",
      "DOM KAN FÅ ARTEFAKTERNA, JAG BRYR MIG INTE.",
      "VI BRYR OSS INTE!",
      "WILLARD, MATA DIN FÅGEL.",
      "DET ENDA JAG BRYR MIG OM ÄR ÄDELSTENAR!",
      "MEN JAG KOMMER INTE KUNNA FÅ TAG PÅ GROTTANS ÄDELSTENAR",
      "FÖR NÄR DOM ÄR FÄRDIGA, KOMMER DOM LÅTA STÄLLET KOLLAPSA!",
      "OM NI TAR HAND OM LURKARNA SOM GNAGER PÅ STÖTTEPELARNA,",
      "SÅ SKULLE NI KUNNA RÄDDA GROTTAN ÅT MIG.",
      "STICK IVÄG MED ER NU!"
    ],
    "minershort-introduction-orbs": [
      "HÖRRU GORDU, EH, VI VERKAR HA BESÖKARE.",
      "TROR DU DET, WILLARD? HALLÅ DÄR, FRÄMLINGAR, EH, ÄR NI BARA PÅ GENOMRESA?",
      "EH, SAMMA SAK FÖR OSS, FAKTISKT. ASSÅ, VI MÅSTE BÖRJA RÖRA PÅ OSS, DET FINNS INGET ATT SE HÄR.",
      "EH, JAG TRODDE ATT DU SA ATT DET HÄR VAR EN OVÄRDERLIG ÄDELSTEN VÄRD-",
      "WILLARD!",
      "FAKTISKT, SÅ SKULLE VI BEHÖVA KRAFTCELLER. INTE ÄDELSTENAR.",
      "VI HAR FAKTISKT FYRA STYCKEN. EH, VILL NI HA DOM?",
      "DET SOM FÅGELHJÄRNAN HÄR FÖRSÖKER SÄGA ÄR,",
      "ATT VI KANSKE HAR NÅGRA KRAFTCELLER LIGGANDE HÄR NÅNSTANS,",
      "OCH VI SKULLE NOG KUNNA GÖRA OSS AV MED DOM FÖR...",
      "90 KULOR PER STYCK.",
      "VAR HAR JAG HÖRT DET FÖRR?",
      "HÖRRU, HUR HAR NI GENIER TÄNKT ER ATT FÅ DEN HÄR STORA ÄDELSTENEN UT HÄRIFRÅN?",
      "ASSÅ, SMARTSKALLE, VI HAR TOLV ÅR TILL AV GRÄVANDE PÅ OSS ATT FÖRSÖKA KOMMA PÅ DET.",
      "EH... GORDY, SKULLE DET INTE GÅ FORTARE OM DU OCKSÅ GRÄVDE?"
    ],
    "minershort-introduction-switch": [
      "PSST, HÖRRNI. EH...",
      "PIPPIN OCH JAG HÖLL ATT UTFORSKA EN GROTTA SOM NI SKULLE TYCKA OM!",
      "DEN VAR FYLLD MED VACKER ORANGE METALL,",
      "OCH  DEN VAR VÄLDIGT VÄL DOLD BAKOM NÅGRA TRÄD I SNÖIGA BERGEN!",
      "JAG BERÄTTADE FÖR GORDY, MEN HAN SKREK BARA ÅT MIG FÖR ATT JAG INTE GRÄVDE!",
      "VARFÖR GRÄVER DU INTE?!",
      "FÖRLÅT!"
    ],
    "minershort-reminder-1-gnawers": [
      "SKULLE NI KUNNA TA HAND OM DOM DÄR LURKARNA",
      "SOM GNAGER PÅ STÖTTEPELARNA I DEN MÖRKA GROTTAN NÅGON GÅNG!",
      "DOM PELARNA KAN INTE STÅ EMOT HUR MYCKET STRYK SOM HELST!"
    ],
    "minershort-reminder-1-orbs": [
      "GLÖM INTE BORT VÅR ÖVERENSKOMMELSE. KOM TILL OSS MED 100 KULOR.",
      "EH... DU SA JU 90.",
      "WILLARD!",
      "OK DÅ. 90 KULOR PER KRAFTCELL."
    ],
    "minershort-reminder-1-switch": [
      "HITTADE NI GROTTAN BAKOM DOM DÄR TRÄDEN I SNÖIGA BERGEN?",
      "JAG KOMMER GÅ DIT SNART, FÖR ATT GÖMMA MIG FRÅN GORDY, FÖR HAN SKRIKER PÅ MIG IGEN!",
      "WILLARD!!"
    ],
    "minershort-reminder-2-orbs": [
      "EH, GORDY?",
      "90 KULOR PER KRAFTCELL, WILLARD! JISSES!"
    ],
    "minershort-resolution-1-orbs": [
      "ÅH, OK DÅ.",
      "HÄR HAR NI EN KRAFTCELL FÖR DOM DÄR KULORNA."
    ],
    "minershort-resolution-2-orbs": [
      "ÅH! ÅH, JAG FIXAR DET DEN HÄR GÅNGEN! EH...",
      "HÄR HAR NI EN...",
      "EH... HÄR HAR NI EN...!",
      "EN KRAFTCELL!",
      "JA, JA... SOM HAN SA.",
      "DET VAR DET. NI HAR HELT RENSAT UT OSS.",
      "INGA! FLER! KRAFT! CELLER!"
    ],
    "oracle-intro-1": [
      "VEM VÄCKER ORAKLET?",
      "VÄNTA, EN AV ER HAR LJUSET INUTI.",
      "FRÅN TIDEN FÖRE TIDEN, SÅ HAR JAG SETT PÅ OCH VÄNTAT",
      "PÅ ATT DEN SANNA HJÄLTEN SKA ÅTERVÄNDA.",
      "VISA MIG 120 PRECURSOR KULOR",
      "FÖR ATT FÅ VARJE KRAFTCELL JAG BESITTER."
    ],
    "oracle-intro-2": [
      "AKTA DET MÖRKA LJUSET,",
      "FÖR DET HAR FÖRVRIDIT ÖDET FÖR EN AV ER.",
      "KOM HIT MED 120 PRECURSOR KULOR",
      "FÖR VARJE KRAFTCELL JAG BESITTER."
    ],
    "oracle-intro-3": [
      "SÖK DET RENA LJUSET, FÖR I DESS STARKA FLAMMA LIGGER SVAREN.",
      "NI KAN FÖRTJÄNA MINA KRAFTCELLER",
      "GENOM ATT TA MED 120 PRECURSOR-KULOR FÖR VARJE."
    ],
    "oracle-left-eye-1": [
      "NI HAR VISAT ER VARA VÄRDIGA. HÄR ÄR EN KRAFTCELL."
    ],
    "oracle-left-eye-2": [
      "FÖR ER OFFERGÅVA, SÅ ERBJUDER JAG EN KRAFTCELL."
    ],
    "oracle-left-eye-3": [
      "FÖR ER ANSTRÄNGNING, SÅ ÄR EN KRAFTCELL ER BELÖNING."
    ],
    "oracle-reminder-1": [
      "KOM HIT MED 120 PRECURSOR KULOR",
      "OCH JAG KOMMER ATT BELÖNA ER MED EN KRAFTCELL."
    ],
    "oracle-reminder-2": [
      "VISA MIG 120 PRECURSOR KULOR",
      "OCH EN KRAFTCELL BLIR ER BELÖNING."
    ],
    "oracle-reminder-3": [
      "NI MÅSTE TA MED 120 PRECURSOR-KULOR",
      "TILL MIG FÖR ATT FÅ VARJE KRAFTCELL JAG BESITTER."
    ],
    "oracle-right-eye-1": [
      "FÖR ER GÅVA, SÅ ÄR YTTERLIGARE EN KRAFTCELL ER."
    ],
    "oracle-right-eye-2": [
      "HÄR ÄR EN TILL KRAFTCELL FÖR ERT UPPDRAG."
    ],
    "oracle-right-eye-3": [
      "NI HAR FÅTT YTTERLIGARE EN KRAFTCELL."
    ],
    "redsage-resolution": [
      "HI-HI-HI... NI HAR ÄNTLIGEN KOMMIT FÖR ATT RÄDDA MIG.",
      "VET NI HUR LÄNGE JAG HAR VARIT HÄR INNE?",
      "VARFÖR TOG DET SÅ LÅNG TID? OCH EH, HI-HI-HI...",
      "VAD HETER NI?",
      "JAG HETER DAXTER! HAN HETER JAK, OCH HAN ÄR MED MIG.",
      "BRA JOBBAT, DAXTER. DU ÄR EN VERKLIG HJÄLTE.",
      "NI MÅSTE STOPPA GOL FRÅN ATT AVFYRA ROBOTEN.",
      "JAG ANVÄNDER MINA ECO KRAFTER FÖR ATT HJÄLPA TILL ATT ÖPPNA SKÖLDDÖRREN."
    ],
    "sage-bluehut-introduction-crop-dusting": [
      "NÅ, SITUATIONEN HÄR LUKTAR VÄRRE ÄN EN LURKS ARMHÅLA.",
      "INNAN DEN BLÅ VISMANNENS FÖRSVINNANDE,",
      "SÅ SKREV HAN NER OMFATTANDE PROBLEM I ALLA DOM OMKRINGLIGGANDE OMRÅDENA.",
      "DET SOM INTRESSERAR MIG MEST ÄR MÖRK ECO SOM HAR INFEKTERAT",
      "NÅGRA OSKYLDIGA VÄXTER I PRECURSOR-DALEN.",
      "KEIRA KOMMER ATT TELEPORTERA ER A-GRAV-ZOOMER TILL DEN NÄRMASTE TRANSPORTPLATTAN.",
      "KÖR ZOOMERN TILL EN GRÖN ECO KÄLLA,",
      "OCH TA MED ER GRÖN ECO TILL DOM INFEKTERADE VÄXTERNA.",
      "DET BORDE LÄKA DOM.",
      "MISSA INTE EN ENDA VÄXT, ANNARS KOMMER DOM INFEKTERADE VÄXTERNA ATT SAKTA SMITTA DOM FRISKA IGEN.",
      "OCH, DAXTER...",
      "TA OCH BÖRJA STÄDA UPP HÄR!",
      "OCH GLÖM INTE HÖRNEN!"
    ],
    "sage-bluehut-introduction-prec-arm": [
      "NÅ, JAG HOPPAS ATT NI HAR PACKAT LUNCH. FÖR DET HÄR ÄR BARA BÖRJAN.",
      "ENLIGT DEN BLÅ VISMANNENS ANTECKNINGAR,",
      "SÅ VERKAR LURKAR HA INFILTRERAT TRÄSKET PÅ ANDRA SIDAN BUKTEN.",
      "TYDLIGEN SÅ PLANERAR DOM ATT ANVÄNDA ETT LUFTSKEPP",
      "FÖR ATT LYFTA UPP EN VIKTIG PRECURSOR-ARTEFAKT UR LERAN.",
      "NI KOMMER BEHÖVA BEGE ER DIT BORT FÖR ATT KUNNA LOSSA DERAS ANKARE.",
      "VEM VET VAD DOM KAN TÄNKAS VILJA HA ARTEFAKTEN TILL,",
      "MEN PRECIS SOM ANDEDRÄKTEN FRÅN DEN HÄR ORANGA SAKEN, SÅ KAN DET INTE VARA NÅGOT BRA."
    ],
    "sage-bluehut-reminder-1-crop-dusting": [
      "MINA ÖGON MÅSTE SPELA MIG ETT SPRATT!",
      "EFTERSOM JAG VET ATT NI TVÅ ÄR DJUPT INNE I PRECURSOR-DALEN,",
      "OCH FÖRSÖKER RÄDDA VÄXTERNA SOM HAR BLIVIT INFEKTERADE AV MÖRK ECO."
    ],
    "sage-bluehut-reminder-1-prec-arm": [
      "VAD GÖR NI TILLBAKA HÄR REDAN?",
      "JAG KAN SE FRÅN BALKONGEN",
      "ATT LURKSKEPPET FORTFARANDE SVÄVAR ÖVER TRÄSKET.",
      "NI HAR UPPENBART INTE KLARAT AV ER UPPGIFT ÄNNU.",
      "RÖR PÅ PÅKARNA!"
    ],
    "sage-intro-sequence-a": [
      "JAG HAR SPENDERAT MITT LIV SÖKANDE EFTER SVAREN SOM MIN FAR,",
      "OCH MIN FARFAR INTE KUNDE FINNA.",
      "VILKA VAR PRECURSORS?",
      "VARFÖR SKAPADE DOM DOM MÅNGA MONOLITERNA SOM OMGER VÅR PLANET?",
      "HUR TÄMJDE DOM ECO, VÄRLDENS LIVSENERGI?",
      "VAD VAR DERAS SYFTE? OCH VARFÖR FÖRSVANN DOM?",
      "JAG HAR FRÅGAT VÄXTERNA, MEN DOM MINNS INTE.",
      "VÄXTERNA HAR FRÅGAT STENARNA, MEN STENARNA KOMMER INTE IHÅG.",
      "TILL OCH MED STENARNA KOMMER INTE IHÅG.",
      "VARJE BEN I MIN KROPP SÄGER MIG ATT SVAREN VILAR",
      "PÅ AXLARNA AV EN UNG POJKE",
      "OVETANDE OM SITT ÖDE, OINTRESSERAD AV SÖKANDET EFTER SANNINGEN",
      "OCH SOM INTE LYSSNAR PÅ MIN VÄGLEDNING!",
      "OCH VARFÖR SKULLE HAN VILJA LYSSNA PÅ GAMLE SAMOS DEN VISE ANNARS?",
      "JAG ÄR JU BARA MÄSTAREN AV GRÖN ECO, EN AV DOM VISASTE MÄNNEN PÅ PLANETEN!",
      "SÅ DET VERKAR SOM ATT SVARET INTE BÖRJAR MED NOGGRANN EFTERFORSKNING",
      "ELLER FÖRNUFTIGT TÄNKANDE.",
      "NEJ! SOM MED MÅNGA AV ÖDETS MYSTERIER",
      "BÖRJAR DET MED EN LITEN AKT AV OLYDNAD.",
      "HALLÅ! EH, JAK? GAMLA GRÖNASTOLLEN SA TILL OSS ATT INTE KOMMA HIT!"
    ],
    "sage-intro-sequence-d1": [
      "VAD I HELA GRÖNA FRIDEN VILL NI TVÅ?",
      "VI- VI- VI VAR- DOM VAR- JAG ÄR- JAG VAR-",
      "SÄG DET INTE! ISTÄLLET FÖR ATT LYSSNA TILL MIN VISHET",
      "GICK NI TVÅ OCH DRÄLLDE OMKRING",
      "PÅ DEN ENDA PLATS SOM JAG SA ÅT ER ATT INTE GÅ TILL: DIMMIGA ÖN!",
      "DET STÄMMER! OCH SEN-",
      "OCH, DAXTER, DU TOG ÄNTLIGEN ETT VÄLBEHÖVLIGT BAD",
      "MEN I ETT BADKAR FYLLT MED MÖRK ECO.",
      "HÖRRU, GAMLE MAN, SKA DU FORTSÄTTA BABBLA",
      "ELLER SKA DU HJÄLPA MIG UR DEN HÄR RÖRAN!?",
      "JAG KOMMER FORTSÄTTA BABBLA! FÖR ENLIGT MIN PROFESSIONELLA ÅSIKT",
      "ÄR ÄNDRINGEN EN FÖRBÄTTRING.",
      "OCH DESSUTOM... SKULLE JAG INTE KUNNA HJÄLPA DIG ÄVEN OM JAG VILLE.",
      "VA!?",
      "DET FINNS BARA EN PERSON SOM HAR STUDERAT MÖRK ECO TILLRÄCKLIGT LÄNGE",
      "FÖR ATT KUNNA HA EN CHANS ATT ÄNDRA DIG TILLBAKA TILL DIN FÖRRA FORM:",
      "GOL ACHERON, VISMANNEN.",
      "MEN HAN BOR LÅNGT NORRUT. LÅNGT, LÅNGT NORRUT.",
      "INGEN HAR PRATAT MED HONOM I ÅRATAL.",
      "JAG HADE KUNNAT TELEPORTERA DIG DIT, MEN JAG KAN INTE GÖRA DET HELLER.",
      "INGEN AV DOM TRE VISMÄN SOM UPPRÄTTHÅLLER DOM ANDRA TELEPORTALERNA",
      "HAR VERKAT SUGNA PÅ ATT SLÅ PÅ SINA ÄNDAR PÅ ETT BRA TAG."
    ],
    "sage-intro-sequence-d2": [
      "DEN ENDA ANDRA VÄGEN NORRUT ÄR TILL FOTS GENOM ELDRAVINEN",
      "MEN DESS VULKANISKA JORD ÄR VARM NOG ATT SMÄLTA PRECURSOR-METALL.",
      "DU KAN INTE BARA GÅ GENOM DEN.",
      "MEN DU SKULLE KUNNA FLYGA ÖVER DEN",
      "OM DU HADE EN ZOOMER UTRUSTAD MED EN VÄRMESKÖLD.",
      "JAG RÅKAR FAKTISKT ARBETA PÅ JUST EN SÅDAN SAK FÖR TILLFÄLLET.",
      "ALLT JAG SKULLE BEHÖVA ÄR 20 KRAFTCELLER FÖR ATT GE DEN TILLRÄCKLIGT MED ENERGI",
      "FÖR ATT KUNNA MOTSTÅ FLODBÄDDENS HETTA. VISST ÄR DET VÄL SÅ, PAPPA?",
      "JA, KEIRA, DET SKULLE NOG FUNGERA. MEN VAR SKULLE EN POJKE",
      "OCH EN HALV!",
      "LYCKAS HITTA 20 KRAFTCELLER?",
      "FRÅN BYBORNA! DOM FLESTA HAR EN KRAFTCELL ELLER TVÅ",
      "UNDANSTUVADE NÅNSTANS.",
      "OCH ÄVEN OM DOM INTE ÄR VILLIGA ATT BARA GE BORT DOM",
      "SKULLE ATT MUTA DOM MED NÅGRA PRECURSOR-KULOR NOG KUNNA GÖRA SUSEN.",
      "OCH JAG SKULLE SLÅ VAD OM ATT DET FINNS ÄNNU FLER UTE I DET VILDA SOM BARA VÄNTAR PÅ NÅGON",
      "MODIG ÄVENTYRARE ATT HITTA DEM.",
      "TJA VI HAR DEN MODIGE ÄVENTYRAREN, I ALLA FALL.",
      "MODIG ÄVENTYRARE?",
      "NI TVÅ SKULLE INTE ENS KUNNA HITTA UT UR BYN UTAN TRÄNING!",
      "INNAN NI GÖR NÅGONTING ANNAT, VORE DET BÄST OM NI GÅR IGENOM PORTALEN OCH FÅR",
      "LITE ÖVNING PÅ GEJSERÖN.",
      "ÖH, VI KOMMER VÄL INTE HITTA NÅGOT MER AV DET DÄR MÖRKA GEGGIGA ECO-GREJSET, ELLER?",
      "FÖR JAG SKULLE INTE GILLA ATT RAMLA I IGEN OCH FÖRVANDLAS TILL DIG!",
      "HOPPA IN DÄR! INNAN JAG FÖRVANDLAR ER BÅDA TILL ORMBUNKAR!"
    ],
    "sage-intro-sequence-e": [
      "BRA TRÄNING, POJKAR, MEN DET ÄR INGENTING JÄMFÖRT MED DOM UTMANINGAR SOM LIGGER FRAMFÖR ER.",
      "ÄSCH, DET ÄR INGET PROBLEM. VI HAR DEN RÄTTA KNYCKEN, ELLER HUR JAK?",
      "VI SKULLE GÄRNA STANNA OCH SMÅPRATA, STORE GRÖNE, MEN VI ÄR EH..",
      "SUGNA PÅ ATT FORTSÄTTA MED VÅRA ÄVENTYR.",
      "VISST, VISST, \"ÄVENTYRA\" IVÄG DÅ.",
      "OCH MEDAN NI ÄR UTE OCH \"ÄVENTYRAR\", SKULLE NI VÄL KUNNA GÖRA LITE NYTTA?",
      "MINA JÄKLA SAMLARE FÖR GRÖN ECO ÄR IGENTÄPPTA IGEN.",
      "STICK UT MOT DEN BORTRE SIDAN AV STRANDEN OCH RENSA UR DOM ÄR NI BUSSIGA.",
      "FÖLJ LAMPORNA, DOM KOMMER ATT LEDA ER RAKT DIT.",
      "OCH NU, ALLESAMMANS..",
      "STICK HÄRIFRÅN!"
    ],
    "sage-introduction-misty-cannon": [
      "AH, OM DET INTE ÄR DOM SEGRANDE HJÄLTARNA.",
      "BRA, JAG SKULLE BEHÖVA PRATA MED ER TVÅ OM NÅGOT ALLVARLIGT.",
      "DET VERKAR SOM ATT DET ÄR EN HEL DEL LURKAKTIVITET PÅ DIMMIGA ÖN.",
      "JAG SER DEM BOMBARDERA PRECURSOR-SILON FRÅN MITT UTKIKSTORN.",
      "OM LURKARNA ÖPPNAR UPP DEN OCH SLÄPPER UT ALL MÖRK ECO, SKULLE VI ALLA KANSKE",
      "SPRINGA RUNT OCH SE LIKA FÅNIGA UT SOM DET HÄR IRRITERANDE LILLA EXEMPLARET.",
      "JAK, DET ÄR DAGS FÖR DIG ATT VISA VAD DU GÅR FÖR.",
      "FÖRSÖK FÅ FISKAREN ATT LÅTA DIG TA HANS BÅT TILLBAKA TILL DIMMIGA ÖN",
      "TA DIG UPP PÅ TOPPEN AV PRECURSOR-SILON OCH SLÅ UT DEN DÄR KANONEN.",
      "OCH... VAD SKA JAG GÖRA DÅ?",
      "DU? DU KAN VÄL SKURA MINA GOLV? DOM VERKAR HA TAPPAT SIN GLANS PÅ SISTONE."
    ],
    "sage-reminder-1-ecorocks": [
      "OJ VILKA \"MODIGA ÄVENTYRARE\" NI TVÅ ÄR.",
      "REDAN TILLBAKA OCH UTAN ATT HA RENSAT UT MINA IGENTÄPPTA ECO-SAMLARE!",
      "DOM ÄR LÄNGST BORT PÅ STRANDEN, POJKAR.",
      "NÅ...",
      "RÖR PÅ PÅKARNA!"
    ],
    "sage-reminder-1-generic": [
      "VAD GÖR NI TVÅ HÄR? NI HAR KRAFTCELLER ATT SAMLA!",
      "LÄMNA MIG I FRED... TILLS NI HAR DOM!"
    ],
    "sage-reminder-1-misty-cannon": [
      "BOMBARDEMANGET HÅLLER PÅ ATT FÖRVÄRRAS!",
      "FÅ TAG PÅ FISKAREN I DJUNGELN, FÅ TILLÅTELSE ATT ANVÄNDA HANS BÅT",
      "OCH BEGE DIG BORT TILL DIMMIGA ÖN FÖR ATT STOPPA KANONEN.",
      "OCH DU DAXTER, DÅ MÅSTE BÖRJA MOPPA GOLVEN. DET HÄR STÄLLET ÄR EN ENDA RÖRA!"
    ],
    "sage-reminder-2-generic": [
      "NI TVÅ VERKAR INTE RIKTIGT FÖRSTÅ ALLVARET I DEN HÄR SITUATIONEN.",
      "DET HÄR HANDLAR OM MER ÄN ATT EN POJKE BLIVIT LUDDIG. DET HÄR HANDLAR OM LIV SOM VI KÄNNER TILL DET.",
      "SESÅ, BEGE ER NU UT OCH UPPFYLL ERT ÖDE."
    ],
    "sage-village3-introduction": [
      "ÅH! JAG UNDRAR ALLTID OM JAG TAPPAR KROPPSDELAR INNE I DOM DÄR SAKERNA!",
      "MILDA MAKTER! DEN RÖDE VISMANNENS LABB SER VÄRRE UT ÄN HUR DEN BLÅ VISMANNENS VAR!",
      "NÅ, DET SER DEFINITIVT UT SOM ATT DET VARIT EN KAMP HÄR.",
      "HA HA HA HA HA!",
      "JAG SKULLE VERKLIGEN INTE KALLA DET FÖR \"KAMP\"",
      "ELLER SKULLE DU SÄGA SÅ, KÄRA SYSTER?",
      "VERKLIGEN INTE. DEN RÖDE VISMANNEN GAV UP SÅ ENKELT.",
      "INTE ROLIGT ALLS.",
      "GOL? ÄR DET VERKLIGEN DU?",
      "DU HAR TILL SLUT TAPPAT FÖRSTÅNDET, ELLER?",
      "OCH DU, MAIA! JAG SA JU ÅT ER ATT DEN MÖRKA ECON SKULLE PÅVERKA ER BÅDA!",
      "HMPH, INGEN LYSSNAR PÅ GAMLE SAMOS...",
      "VAD HAR NI GJORT MED DEN BLÅ VISMANNEN OCH RÖDE VISMANNEN?",
      "VAR INTE OROLIG FÖR DINA FÄRGGLADA VÄNNER, DIN GAMLA DÅRE.",
      "MÅR ALLDELES UTMÄRKT I VÅRT CITADELL. DOM ÄR VÅRA SPECIELLA GÄSTER.",
      "DOM HAR TACKSAMT ERBJUDIT SIG ATT HJÄLPA OSS MED ETT LITET PROJEKT.",
      "DU HADE FEL, SAMOS. MÖRK ECO KAN KONTROLLERAS!",
      "VI HAR LÄRT OSS DESS HEMLIGHETER, OCH NU KAN VI FORMA OM VÄRLDEN PRECIS SOM VI VILL.",
      "NI KAN INTE KONTROLLERA MÖRK ECO SJÄLV! INTE ENS PRECURSORS KUNDE-",
      "FRAM TILLS NU, SÅ VAR VI TVUNGNA ATT HANKA OSS FRAM MED DET LILLA MÖRK ECO",
      "SOM VI KUNDE KOMMA ÅT UPPE VID YTAN.",
      "MEN SNART, SÅ KOMMER VI HA TILLGÅNG TILL OFANTLIGA MÄNGDER",
      "AV MÖRK ECO SOM FINNS LAGRAD DJUPT UNDER MARKEN.",
      "INTE SILORNA!",
      "JO, JUST SILORNA!",
      "DOM KOMMER ATT ÖPPNAS, OCH ALL MÖRK ECO I HELA VÄRLDEN KOMMER ATT BLI VÅR!",
      "MEN DET ÄR JU OMÖJLIGT! BARA EN PRECURSOR-ROBOT-",
      "ÅH, SE INTE SÅ UPPRÖRD UT, SAMOS.",
      "VI HAR STORA PLANER ÅT DIG MED.",
      "AH HA HA HA HA HA HA! ÅH...",
      "VÄNTA HÄR LITE NU!",
      "DET DÄR VAR GOL?",
      "SAMMA GOL SOM PÅSTÅS SKULLE KUNNA ÄNDRA TILLBAKA MIG?",
      "GOL ÄR DEN PERSON SOM FÖRSÖKER DÖDA OSS ALLA?!",
      "JAG ÄR DÖDSDÖMD.",
      "VI ÄR KANSKE ALLA DÖDSDÖMDA.",
      "OM DOM ÖPPNAR SILORNA, SÅ KOMMER DEN MÖRKA ECON ATT",
      "FÖRVRIDA OCH FÖRSTÖRA ALLT DEN VIDRÖR!",
      "VI BARA MÅSTE TA OSS TILL DERAS CITADELL, FÖR ATT STOPPA DOM!",
      "SNABBASTE VÄGEN ATT KOMMA DIT ÄR GENOM LAVATUNNELN",
      "SOM FINNS VID BOTTEN AV DEN HÄR KRATERN.",
      "BARA NÅGRA FÅ KRAFTCELLER TILL, SÅ SKULLE ER ZOOMERS VÄRMESKÖLD",
      "KUNNA TA ER SÄKERT ÖVER TILL ANDRA SIDAN LAVAN.",
      "OK DÅ, MIN GOSSE. DU VET VAD SOM MÅSTE GÖRAS.",
      "TA MED DIG HÅRBOLLEN OCH GÅ OCH SAMLA IN FLER KRAFTCELLER."
    ],
    "sage-village3-introduction-dark-eco": [
      "HERREJÖSSES!",
      "DET VERKAR SOM ATT DET FINNS MÅNGA LURKAR I SPINDELGROTTORNA!",
      "PERFEKT. DET LÅTER SOM ETT RIKTIGT HÄRLIGT STÄLLE.",
      "LÅT MIG GISSA. DET FINNS SPINDLAR I SPINDELGROTTORNA, ELLER HUR?",
      "SÅKLART ATT DET FINNS SPINDLAR I SPINDELGROTTORNA!",
      "MEN DET ÄR DET MINSTA AV ERA PROBLEM!",
      "LURKARNA ÄR UTE EFTER KRISTALLER SOM ÄR GJORDA AV KONCENTRERAD MÖRK ECO.",
      "NI MÅSTE FÖRSTÖRA DOM DÄR KRISTALLERNA INNAN MONSTREN",
      "FÅR TAG PÅ DOM!",
      "SÄTT FART!"
    ],
    "sage-village3-introduction-rams": [
      "JAG ÄR GLAD ATT NI TVÅ ÄR HÄR. DET ÄR LURKRÖRELSER UPPE I BERGEN.",
      "TYDLIGEN HAR DOM UPPTÄCKT, OCH FÖRSÖKER ATT TA BORT",
      "NÅGRA MÖRK ECO-LAGER SOM ÄR INFRUSNA I GLACIÄREN.",
      "MEDAN NI ÄR DÄR UPP OCH LETAR RUNT EFTER KRAFTCELLER",
      "SÅ KAN NI SE TILL ATT STOPPA LURKARNA, OCH SE TILL ATT MINDRE MÖRK ECO FALLER I GOLS HÄNDER."
    ],
    "sage-village3-reminder-1-dark-eco": [
      "NI MÅSTE FÖRSTÖRA DOM MÖRKA ECO-KRISTALLERNA I SPINDELGROTTORNA!"
    ],
    "sage-village3-reminder-1-rams": [
      "VI KAN INTE LÅTA LURKARNA FÅ TAG PÅ DOM MÖRKA ECO-KAPSLARNA.",
      "GÅ UPP TILL DOM DÄR SNÖIGA TOPPARNA OCH STOPPA DOM!"
    ],
    "sculptor-introduction": [
      "HALLÅ DÄR... LILLA PÄLSNISSE!",
      "ÅH... JAG TRODDE FÖR EN STUND ATT DU VAR MIN MUSA.",
      "DIN VAD DÅ?",
      "HAR NI ALDRIG SETT EN MUSA INNAN?",
      "DET ÄR EN LYSANDE EKORRE RUNT DIN STORLEK, FULL AV ENERGI, OCH LIKA GALEN SOM EN LÄRKA!",
      "ÅH, JAG FÖRSTÅR! PRECIS SOM EN HJÄLPREDA.",
      "FAKTUM ÄR ATT UTAN MIN MUSA SÅ KAN JAG BARA INTE SKULPTERA.",
      "MEN MED HENNE RUNT MIG... SÅ SER JAG SKÖNHET I ALLT, FÖRSTÅR NI?",
      "JUST NU SKULLE JAG INTE ENS KUNNA MEJSLA MIG UT UR EN LÅDA.",
      "JAG TROR ATT HON STACK IVÄG TILL DEN DÄR DIMMIGA ÖN.",
      "AH, JAG HOPPAS BARA ATT HON MÅR BRA.",
      "DET ÄR VÄRT EN KRAFTCELL OM NI KAN FÖRA HENNE TILLBAKA TILL MIG!",
      "VÄNTA EN STUND! VI SKALL VÄL INTE GÅ TILLBAKA TILL DIMMIGA ÖN!",
      "SKA VI?"
    ],
    "sculptor-reminder-1": [
      "NÄMEN HALLÅ DÄR KOMPISAR! HAR NI LYCKATS HITTA MIN MUSA ÄN?"
    ],
    "sculptor-resolution": [
      "ÅH, MIN MUSA! NI RÖDDADE HENNE! ÅH, NI ÄR VERKLIGEN BÄST!",
      "HÄR, TA DEN HÄR KRAFTCELLEN. JAG KOMMER INTE BEHÖVA DEN NU NÄR JAG HAR FÅTT MIN INSPIRATION TILLBAKA!"
    ],
    "sidekick-human-intro-sequence-b": [
      "FORTSÄTT DITT LETANDE EFTER ARTEFAKTER OCH ECO.",
      "OM LOKALBEFOLKNINGEN BESITTER PRECURSOR-FÖREMÅL VET DU VAD SOM MÅSTE GÖRAS.",
      "SLÅ HÅRT MOT ALLA SOM LÄMNAR BYN.",
      "VI KOMMER ATT ATTACKERA DEN NÄR DET ÄR DAGS."
    ],
    "sidekick-human-intro-sequence-c": [
      "VAD GÖR VI HÄR, JAK? DET HÄR STÄLLET GER MIG RYSNINGAR!",
      "HUH?",
      "(STÖN) DUMMA PRECURSOR-SKRÄP!",
      "AH! VAD ÄR DET DÄR MÖRKA GEGGAN? DET SER INTE SÅ VÄNLIGT UT.",
      "VISMANNEN TJATAR OM HUR PRECURSORS BYGGDE DEN HÄR PLATSEN HELA TIDEN.",
      "\"VART TOG DOM VÄGEN? VARFÖR BYGGDE DOM DEN HÄR SKITEN?\"",
      "ASSÅ JAG GILLAR PRECURSOR-KULOR OCH KRAFTCELLER LIKA MYCKET SOM EN ANNAN",
      "MEN OM DU FRÅGAR MIG, SÅ MÅSTE DOM HA VARIT RIKTIGA SOPOR.",
      "WOW! HUR GJORDE DU DET DÄR?",
      "JAK, JAG TROR ATT VI ÄR I TRUBBEL!",
      "JISSES, DET DÄR STACK.",
      "JAG SA JU TILL DIG ATT VI INTE SKULLE HA KOMMIT HIT, OCH LYSSNADE DU ELLER?",
      "VAD ÄR DET?",
      "AAAAHH!!",
      "OK, OK. JAG ÄR OK, JAG ÄR OK..",
      "AAAHHH!!"
    ],
    "warrior-introduction": [
      "ÅH... MITT ÖMMA HUVUD.",
      "JAG TVIVLAR PÅ ATT DET ÄR NÅGOT AV DINA KÄNSLIGA ORGAN!",
      "SKAKA BARA AV DIG DET, TUFFING!",
      "ÅH, VISST, JAG HAR VARIT TUFF EN GÅNG I TIDEN.",
      "JAG VAR KANSKE EN AV DOM TUFFASTE SOM FANNS.",
      "JAG FÖRSVARADE DEN HÄR BYN PÅ EGEN HAND MOT DOM HÄR HEMSKA VARELSERNA UNDER NÄSTAN ETT HELT ÅR!",
      "SEN KOM DET DÄR HEMSKA MONSTRET OCH PÅBÖRJADE STENBOMBARDEMANGET.",
      "OCH SÅ, STÄRKT AV SJÄLVFÖRTROENDE, MED EN RUSTNING SOM SKEN I SOLEN...",
      "KLÄTTRADE JAG UPP FÖR KULLEN FÖR ATT TA MIG AN HONOM...!",
      "MEN HAN HAMRADE PÅ MIG SOM MAN MÖRAR EN JAKOSTEK.",
      "HAR DU PRÖVAT ATT ATTACKERA HONOM MED DITT MELODRAMA?",
      "FÖR DEN HÅLLER PÅ ATT TA KÅL PÅ MIG!",
      "EFTER MITT FÖRRA FÖRBLUFFANDE MISSLYCKANDE,",
      "SÅ STÄNGDE HAN AV PASSAGEN TILL SITT NÄSTE MED HJÄLP AV EN 30 TON TUNG STEN,",
      "VILKET RESULTERADE I ATT INGEN KUNDE UTMANA HONOM IGEN.",
      "SÅ, VÅR VISMAN, EN MÄSTARE AV BLÅ ECO OCH ETT MEKANISKT GENI, KOM PÅ EN MASKIN",
      "SOM SKULLE VARA KAPABEL ATT KUNNA FLYTTA STENEN UR VÄGEN...!",
      "MEN TYVÄRR, SÅ FÖRSVANN HAN INNAN VI HADE EN CHANS ATT AKTIVERA DEN.",
      "OCH HAN TOG MED SIG ALLA SINA KRAFTCELLER.",
      "JAG LYCKADES ÅTMINSTONE DRA UT TILLRÄCKLIGT MÅNGA PONTONER FRÅN VÅR BRO FÖR ATT FÖRHINDRA",
      "ATT MONSTRET SKA KUNNA KOMMA NER HIT OCH GÖRA MIG NÅGON SKADA.",
      "VISST, BRA, BRA JOBBAT, TUFFING. MEN, EM...",
      "VI SKULLE BEHÖVA BE DIG ATT, EH... SÄTTA TILLBAKA DOM, SÅ ATT SÄGA.",
      "ÅH, VISST! OCH BESEGLA MIN UNDERGÅNG?",
      "(SUCKAR)",
      "OK DÅ. VISST.",
      "KOM HIT MED 90 PRECURSOR KULOR OCH JAG KOMMER ATT SLÄPPA LÖS PONTONERNA.",
      "MEN JAG TÄNKER INTE SLÅSS MOT DET DÄR MONSTRET IGEN!"
    ],
    "warrior-reminder-1": [
      "TA ALL TID NI BEHÖVER FÖR ATT KOMMA HIT MED PRECURSOR-KULORNA",
      "JAG SER INTE FRAM EMOT ATT LAGA PONTONBRON I NÄRTID."
    ],
    "warrior-resolution": [
      "ÅH.",
      "UNDERBART.",
      "NI HAR MED ER PRECURSOR-KULORNA.",
      "OK DÅ.",
      "JAG SKA LAGA BRON.",
      "MEN BE MIG INTE ATT BLI INVOLVERAD MED DEN DÄR VARELSEN IGEN!"
    ],
    "yellowsage-resolution": [
      "VEM HADE KUNNA ANA ATT JAG SKULLE FÅ SKÅDA DAGEN",
      "DÅ JAG BEHÖVDE BLI RÄDDAD AV EN POJKE OCH HANS MUSKRÅTTA!",
      "ÅH... JAG SKALL ALLT GE GOL OCH MAIA",
      "IGEN FÖR DEN HÄR PINSAMHETEN!",
      "SEDAN TAR VI EN TITT PÅ ATT LAGA LITE MUSKRÅTTSTUVNING...",
      "(SVÄLJER)"
    ]
  },
  "hints": {
    "ASSTLP01": [
      "HMM..."
    ],
    "ASSTLP02": [
      "JAG MÅSTE FÖRSÖKA FÅ DEN HÄR VÄRMESKÖLDEN ATT FUNGERA..."
    ],
    "ASSTLP03": [
      "VI BEHÖVER KRAFTCELLER FÖR ATT KUNNA GE ENERGI TILL VÄRMESKÖLDEN..."
    ],
    "ASSTLP04": [
      "VAR ÄR MIN SKIFTNYCKEL?"
    ],
    "ASSTLP05": [
      "ELDRAVINEN ÄR SÅ VARM..."
    ],
    "ASSTLP23": [
      "FÅ SE NU, HUR LYCKADES HAN FÅ LEVITATORN ATT FUNGERA?"
    ],
    "ASSTLP24": [
      "NÅ, ÄVEN OM VI HAR KRAFTCELLER,",
      "KOMMER VI HA TILLRÄCKLIGT MED ENERGI?"
    ],
    "ASSTLP30": [
      "HM, FÅ SE NU..."
    ],
    "ASSTLP31": [
      "HM."
    ],
    "ASSTLP32": [
      "ÅH, KÄRA NÅN..."
    ],
    "ASSTLP33": [
      "A-HA!"
    ],
    "ASSTLP34": [
      "HMM... VAD HÅLLER GOL OCH MAIA PÅ MED?"
    ],
    "ASSTLP35": [
      "HMM... VI MÅSTE TA OSS TILL PRECURSOR-STAN."
    ],
    "ASSTLP36": [
      "HMM. VÄRMESKÖLDEN KOMMER ATT BEHÖVA MYCKET MER ENERGI",
      "FÖR ATT KUNNA STÅ EMOT LAVAN."
    ],
    "ASSTLP37": [
      "ÅH... VI MÅSTE RÄDDA DOM ANDRA VISMÄNNEN..."
    ],
    "BIL-AM01": [
      "JAG BARA ÄLSKAR LERAN."
    ],
    "BIL-AM02": [
      "JÄKLAR TRÄSKRÅTTOR."
    ],
    "BIL-AM03": [
      "JAG SKULLE VERKLIGEN BEHÖVA EN DOS AV MAMMAS MEDICIN."
    ],
    "BIL-AM04": [
      "GLADIOLA."
    ],
    "BIL-AM05": [
      "JAG SKULLE BEHÖVA LITE BRUN MEDICIN."
    ],
    "BIL-AM06": [
      "JAG SKULLE BEHÖVA LITE SOMMARKYLA."
    ],
    "BIL-AM07": [
      "ATTANS, DEN HÄR HETTAN GÖR MIG PRILLIG."
    ],
    "BIL-AM08": [
      "TUSAN OCKSÅ... DEN HÄR HETTAN GER MIG UTSLAG."
    ],
    "BIL-AM1A": [
      "UH-HM! JAG BARA ÄLSKAR LERAN!"
    ],
    "BIL-AM2A": [
      "JÄKLAR TRÄSKRÅTTOR!"
    ],
    "BIL-AM2B": [
      "JÄKLA TRÄSKRÅTTOR!"
    ],
    "BIL-LO01": [
      "FARTHY!"
    ],
    "BIL-LO02": [
      "HIHA-HIHA-HIHA-JIHA-JIHA!"
    ],
    "BIL-LO03": [
      "JIHA-JIHA-JIHA!"
    ],
    "BIL-LO1A": [
      "FARTHY!"
    ],
    "BIL-LO2A": [
      "JIHA-JIHA-JIHA!"
    ],
    "BIL-LO2B": [
      "JIHA! JIHA!"
    ],
    "BIL-TA01": [
      "TA DOM!"
    ],
    "BIL-TA02": [
      "SNYGGT SKOTT!"
    ],
    "BIL-TA03": [
      "DÄR BORTA!"
    ],
    "BIL-TA04": [
      "ÅH, ATTANS OCKSÅ."
    ],
    "BIL-TA05": [
      "RÅTTAN FICK ETT SNACK."
    ],
    "BIL-TA06": [
      "OCH EN TILL..."
    ],
    "BIL-TA07": [
      "DET ÄR BARA EN KVAR..."
    ],
    "BIL-TA08": [
      "FICK DOM."
    ],
    "BIL-TA09": [
      "JIHA!"
    ],
    "BIL-TA1A": [
      "PÅ DOM BARA!"
    ],
    "BIL-TA2A": [
      "SNYGGT SKOTT!"
    ],
    "BIL-TA3A": [
      "DÄR BORTA."
    ],
    "BIL-TA4A": [
      "ATTANS OCKSÅ!"
    ],
    "BIL-TA4B": [
      "ATTANS OCKSÅ!"
    ],
    "BIL-TA5A": [
      "RÅTTAN TOG EN MUNSBIT!"
    ],
    "BIR-AM01": [
      "ÄR NI VID ÄGGET ÄN?"
    ],
    "BIR-AM02": [
      "PRECIS SÅ, BARA EN LITEN BIT LÄNGRE!"
    ],
    "BIR-AM03": [
      "OK, BRA, KNUFFA DEN NU. ÅH, OCH TA DET FÖRSIKTIGT NU!"
    ],
    "BIR-AM04": [
      "NÄMEN, KÄRA NÅN, DET DÄR VAR INTE SÄRSKILT FÖRSIKTIGT!"
    ],
    "BIR-AM05": [
      "KOM IGEN NU, KNUFFA NER ÄGGET FRÅN KLIPPAN!"
    ],
    "BIR-AM06": [
      "ÅH!"
    ],
    "BIR-AM07": [
      "ÅH, KOM HIT NU, LILLA FÅGEL. KOM HIT, LILLA FÅGEL."
    ],
    "BIR-AM08": [
      "KOM HIT, LILLA FÅGEL."
    ],
    "BIR-AM09": [
      "VAR FÖRSIKTIG, DET SER INTE SÄKERT UT DÄR UPPE!"
    ],
    "BIR-AM10": [
      "VAR FÖRSIKTIG, SAKTA MEN SÄKERT!"
    ],
    "BIR-AM11": [
      "BRA JOBBAT! KOM NU OCH MÖT MIG HÄR NERE VID ÄGGET."
    ],
    "BIR-AM12": [
      "NI MÅSTE VARA EN SANN DJURÄLSKARE!"
    ],
    "BIR-AM13": [
      "SER DU NÅGRA ANDRA FÅGLAR DÄR UPPE?"
    ],
    "BIR-LO01": [
      "(KYSSLJUD) (VISSLING)"
    ],
    "BIR-LO02": [
      "MÄMEN KÄRA NÅN, DET DÄR ÄR EN SÖT EN."
    ],
    "BIR-LO03": [
      "NÄMEN TITTA HÄR, EN SVARTMYLLA."
    ],
    "BIR-am08": [
      "KOM HIT, LILLA FÅGEL..."
    ],
    "BLU-AM01": [
      "LITE HJÄLP SKULLE VARA BRA!"
    ],
    "BLU-AM02": [
      "ÅH, DET HÄR ÄR EN RIKTIG RÖRA."
    ],
    "BLU-AM03": [
      "HMM, ETT RIKTIGT MYSTERIUM VI STÅR INFÖR."
    ],
    "CHI-AM01": [
      "DET HÄR ÄR EN KATASTROF. DET HÄR ÄR EN KATASTROF SÄGER JAG!"
    ],
    "CHI-AM02": [
      "DOM VILL ATT JAG SKA GÅ IN I DJUNGELN - JAG! HO HO ÅH...",
      "JAG SKULLE HELLRE BROTTAS MED EN UPPRETAD FLUTT-FLUTT."
    ],
    "CHI-AM03": [
      "SÅ F-FÖRST ÄR FISKARENS BÅT...",
      "DEN BLIR ATTACKERAD AV ETT MONSTER...",
      "OCH NU, NU SKER DETTA...",
      "VAD MER KAN GÅ FEL?"
    ],
    "CHI-AM04": [
      "JAG KAN INTE... JAG SKULLE KUNNA, JAG SKULLE KUNNA... ÅH, KANSKE BORDE JAG HÖJA SKATTEN...",
      "FÖR ATT KUNNA BETALA FÖR ALL DEN HÄR RÖRAN."
    ],
    "CHI-AM05": [
      "PROBLEM... PROBLEM... PROBLEM!"
    ],
    "CHI-AM06": [
      "(SNYFTAR) JAG KOMMER ALDRIG ATT BLI OMVALD NU..."
    ],
    "CHI-AM07": [
      "(STÖNAR) VAD ÄR DET SOM HAR HÄNT MED BYNS ENERGISTRÅLE?"
    ],
    "CHI-AM08": [
      "JAG... DOM, JAG VET INTE... (MUTTRAR)"
    ],
    "CHI-LO01": [
      "...VÄDERKVARNAR, MONSTER, ENERGI, OMVAL..."
    ],
    "CHI-LO02": [
      "...RÖSTNINGEN, JAG... MONSTER, HM... OMVAL, ÅH..."
    ],
    "EXP-AM01": [
      "JAG MÅSTE GE MIG AV PÅ MIN RESA SNART.",
      "JAG BEHÖVER PRECURSOR-KULOR!"
    ],
    "EXP-AM02": [
      "FÅ SE NU, VART SKA JAG BEGE MIG FÖRST? EH..."
    ],
    "EXP-AM03": [
      "ÅH JAG SAKNAR DEN ÖPPNA LANDSVÄGEN."
    ],
    "EXP-AM04": [
      "SÅ MÅNGA PLATSER ATT SE, MEN INTE SÅ MYCKET TID."
    ],
    "EXP-AM05": [
      "PÅ MIN TID, DÅ KUNDE MAN STRÖVA RUNT",
      "UTAN ATT BLI ÖVERFALLEN AV MONSTER!"
    ],
    "EXP-LO02": [
      "JAG BEHÖVER FLER PRECURSOR KULOR."
    ],
    "EXP-LO1A": [
      "(MUMLAR)"
    ],
    "FAR-AM01": [
      "(SNARKAR) KOM HIT, BESSIE... KOM HIT, BESSIE BESSIE...",
      "DUKTIG FLICKA..."
    ],
    "FAR-AM02": [
      "JAG MÅSTE TA IN GRÖDORNA INNAN OLLONBORRARNA..."
    ],
    "FAR-AM2A": [
      "JAG MÅSTE TA IN GRÖDORNA TILL OLLONBORRARNA SÅ ATT..."
    ],
    "FAR-LO01": [
      "(SNARKAR)"
    ],
    "FAR-LO1A": [
      "(SNARKAR)"
    ],
    "FIS-AM01": [
      "GRR, DOM HÄR JÄKLA FISKARNA...",
      "JAG LYCKAS ALDRIG FÅNGA EN ENDA."
    ],
    "FIS-AM02": [
      "DOM HÄR MONSTREN SOM SLET SÖNDER MITT SKEPP",
      "KOMER ATT RUINERA MIG."
    ],
    "FIS-AM03": [
      "ATTANS, DOM HÄR PLÅGOANDARNA!",
      "IN I MIN KORG NU MED ER, JÄDRA FISKAR, KOM IGEN NU...",
      "AH HA HA HA HA..."
    ],
    "FIS-AM04": [
      "ÅH JAG ÄLSKAR LUKTEN AV FISK PÅ MORGONEN."
    ],
    "FIS-AM05": [
      "ÅH JAG SKULLE VERKLIGEN KUNNA TA LITE SALTA FISKLÄPPAR PÅ RÅG."
    ],
    "FIS-AM06": [
      "JAG KOMMER IHÅG DEN DÄR BJÄSSEN SOM KOM UNDAN..."
    ],
    "FIS-LO01": [
      "GRR!"
    ],
    "FIS-LO03": [
      "HA HA HA HA HA HA!"
    ],
    "FIS-LO04": [
      "JÄKLA FISK... DOM HAMNAR ALDRIG I MITT NÄT!"
    ],
    "FIS-LO05": [
      "HA HA HA HA AHA HA HA!"
    ],
    "FIS-TA01": [
      "MER ÅT VÄNSTER!"
    ],
    "FIS-TA02": [
      "TILL HÖGER MED ER!"
    ],
    "FIS-TA03": [
      "HÄR KOMMER EN BJÄSSE!"
    ],
    "FIS-TA04": [
      "NI MISSADE EN RIKTIGT STOR EN, GOSSE!"
    ],
    "FIS-TA05": [
      "MISSA INTE EN SÅN DÄR IGEN!"
    ],
    "FIS-TA06": [
      "HÅLL STADIGT NU POJK."
    ],
    "FIS-TA07": [
      "DINA SEGEL SLAKAR I VINDEN, POJK."
    ],
    "FIS-TA08": [
      "NI MISSADE EN."
    ],
    "FIS-TA09": [
      "DET SER UT SOM ATT NI SKULLE BEHÖVA ETT STÖRRE NÄT..."
    ],
    "FIS-TA10": [
      "NI MISSADE IGEN!"
    ],
    "FIS-TA11": [
      "HÅLL STADIGT NU! DU ÄR NÄSTAN DÄR..."
    ],
    "FIS-TA1A": [
      "VÄNSTER!"
    ],
    "FIS-TA2A": [
      "HÖGER!"
    ],
    "GAM-AM01": [
      "HÖRRU, TJUGO MOT ETT ÄR INTE SÅ DÅLIGA ODDS!"
    ],
    "GAM-AM02": [
      "NEJ, DET VAR EN SÄKER SAK!"
    ],
    "GAM-AM03": [
      "HI HI HI... JAG KOMER ATT FÅ JACKPOT NÄSTA GÅNG!"
    ],
    "GAM-AM04": [
      "HÖRRU! OM JAG HADE EN KULA FÖR VARJE MISSAT TILLFÄLLE...!"
    ],
    "GAM-AM05": [
      "HÖRU! TUNNOR SKULLE KUNNA TRENDA IGEN!"
    ],
    "GAM-AM06": [
      "ÅH... JAG SKULLE BEHÖVA EN CHANS."
    ],
    "GAM-AM07": [
      "ÅH, VAD ÄR ODDSEN FÖR ATT FLYTTA TILL EN STAD SOM ÄR UNDER ATTACK?"
    ],
    "GAM-AM08": [
      "JAG TRODDE ATT JAG HADE ETT BRA TIPS!"
    ],
    "GAM-AM09": [
      "YTTERLIGARE EN DAG, YTTERLIGARE EN SATSNING."
    ],
    "GAM-AM10": [
      "JAG SLÅR VAD OM ATT INGEN KAN UTMANA DET DÄR MONSTRET."
    ],
    "GAM-AM11": [
      "UH-HUH... JAG BORDE CASHA UT OCH GÅ VIDARE."
    ],
    "GAM-AM12": [
      "ÄSCH, IBLAND KAN MAN INTE VINNA ALLT."
    ],
    "GAM-AM13": [
      "HALLÅ DÄR, VAD GLOR NI PÅ? ROAR JAG ER?"
    ],
    "GEO-AM01": [
      "HMM, INTRESSANTA STRATA..."
    ],
    "GEO-AM02": [
      "STACKARS SMÅ MULLVADAR..."
    ],
    "GEO-AM03": [
      "INTRESSANT..."
    ],
    "GEO-AM04": [
      "LYCKA TILL, POJKAR!"
    ],
    "GEO-AM05": [
      "ELAKA LURKAR..."
    ],
    "GEO-AM06": [
      "STENAR HAR OCKSÅ KÄNSLOR, FAKTISKT..."
    ],
    "GEO-AM07": [
      "HÅLL UT BARA, SMÅTTINGAR..."
    ],
    "GEO-AM08": [
      "NU KAN JAG ÅTERVÄNDA TILL MIN FORSKNING!"
    ],
    "GEO-LO01": [
      "JAG MÅSTE ÅTERGÅ TILL MIN FORSKNING."
    ],
    "GEO-LO02": [
      "HMM, DEN HÄR STENEN VERKAR VARA GANSKA GAMMAL..."
    ],
    "GOL-AM01": [
      "NI TÄNKER VISST INTE GE UPP, ELLER HUR?"
    ],
    "GOL-AM02": [
      "SNART KOMMER DEN MÖRKA ECON ATT VARA VÅR!"
    ],
    "GOL-AM03": [
      "GÖR SLUT PÅ DOM!"
    ],
    "GOL-AM04": [
      "SKJUT!"
    ],
    "GOL-AM05": [
      "SPRÄNG DOM I SMÅBITAR!"
    ],
    "GOL-AM06": [
      "VAD NU? INTE DOM NU IGEN!"
    ],
    "GOL-AM07": [
      "DET ÄR FÖR SENT!"
    ],
    "GOL-AM08": [
      "NU HAR JAG ER!"
    ],
    "GOL-AM09": [
      "NU HAR JAG ER!"
    ],
    "GOL-AM10": [
      "AH HA HA HA HA!"
    ],
    "GOL-AM11": [
      "INGEN NÅD!"
    ],
    "GOL-AM12": [
      "HÄR FÅR NI!"
    ],
    "GOL-AM13": [
      "BRA FÖRSÖK!"
    ],
    "GOL-AM14": [
      "STÅ STILLA!"
    ],
    "GOL-AM15": [
      "PATETISKT!"
    ],
    "GOL-AM16": [
      "NEJ!"
    ],
    "GOL-AM17": [
      "ÅHHH!"
    ],
    "GOL-AM18": [
      "VI KOMMER ATT ÖPPNA SILON HELA VÄGEN OCH KROSSA ER OCKSÅ!"
    ],
    "GOL-AM19": [
      "LJUS ECO! DEN EXISTERAR FAKTISKT!"
    ],
    "GOL-AM20": [
      "VI KOMMER INTE ATT ACCEPTERA DET!"
    ],
    "MAI-AM01": [
      "GÖR SLUT PÅ DOM BÅDA TVÅ EN GÅNG FÖR ALLA!"
    ],
    "MAI-AM02": [
      "TA KÅL PÅ DOM!"
    ],
    "MAI-AM03": [
      "HA HA HA!"
    ],
    "MAI-AM04": [
      "ECO KOMMER INTE ATT SKYDDA ER NU!"
    ],
    "MAI-AM05": [
      "GÖR NÅGOT DÅ!"
    ],
    "MAI-AM06": [
      "ÄH!"
    ],
    "MAI-AM07": [
      "NEJ!"
    ],
    "MAI-AM08": [
      "VI KOMMER ÖPPNA SILON HELA VÄGEN OCH KROSSA ER OCKSÅ!"
    ],
    "MAI-AM09": [
      "DOM FÅR INTE FÅ TAG I DET!"
    ],
    "MIN-LO01": [
      "EN AV DOM HÄR DAGARNA KOMMER JAG ATT VARA RIK...",
      "DU MENAR ATT VI KOMMER ATT BLI RIKA!",
      "SÄKERT. SKIT SAMMA."
    ],
    "MIN-LO03": [
      "GRÄV, WILLARD! GRÄV!",
      "VISST, MEN DU GRÄVER INTE!",
      "DET ÄR FÖR ATT DET ÄR JAG SOM SKÖTER ALLT TÄNKANDE!"
    ],
    "MIN-LO04": [
      "EH, GORDY? KAN VI BRYTA EN STUND?",
      "ÅH, JAG SKA ALLT BRYTA NÅGOT. GRÄV NU!"
    ],
    "MIN-LO05": [
      "JAG ÄR HUNGRIG, GORDY!",
      "ÄT DIN PIPPI!"
    ],
    "MIN-LO06": [
      "EH, GORDY? JAG SKULLE BEHÖVA EN VASSARE HACKA.",
      "VAD DU SKULLE BEHÖVA ÄR EN VASSARE HJÄRNA!"
    ],
    "MSH-AM01": [
      "OH-HA-HA-HA! JAG KOMMER ATT BLI RIK!"
    ],
    "MSH-AM02": [
      "GRÄV, GRÄV, GRÄV!"
    ],
    "MSH-AM03": [
      "WILLARD! ARBETA HÅRDARE, INTE SMARTARE!"
    ],
    "MSH-AM04": [
      "A-HA, JAG KOMMER ATT BLI VÄRLDENS RIKASTE MAN! A HA HA..."
    ],
    "MSH-AM05": [
      "ÅH HO HO! INGEN HAR NÅGONSIN SETT EN SÅ HÄR STOR ÄDELSTEN! AH HA HA!"
    ],
    "MSH-AM06": [
      "LUGNA GATAN, HÄR KOMMER JAG!"
    ],
    "MSH-AM07": [
      "MINA ÄDELSTENAR! ALLA MINA ÄDELSTENAR!"
    ],
    "MSH-AM08": [],
    "MSH-AM09": [
      "(SKROCKAR) JAG KAN INTE VÄNTA MED ATT CASHA IN DEN HÄR LILLA SÖTNOSEN!"
    ],
    "MSH-AM10": [
      "DET HÄR SER UT SOM EN SÄLLSYNT CRYSTITE ZLARCONIA! ÅH-HO-HO!"
    ],
    "MSH-AM11": [
      "VÄNTA NU LITE! DOM ÄR ALLA MINA! DOM ÄR ALLA MINA, SÄGER JAG JU!"
    ],
    "MSH-AM12": [
      "SÅ, WILLARD. VAD SKA DU GÖRA MED",
      "DIN KVARTS HÄLFT?"
    ],
    "MSH-AM1A": [
      "JAG KOMMER ATT BLI RIK!"
    ],
    "MSH-AM2A": [
      "GRÄV, GRÄV, GRÄV!"
    ],
    "MSH-AM3A": [
      "DU MÅSTE ARBETA HÅRDARE, INTE TÄNKA SMARTARE!"
    ],
    "MTA-AM01": [
      "EH, ÄR VI NÄSTAN FÄRDIGA?"
    ],
    "MTA-AM02": [
      "SNÄLLA, KAN VI INTE TA EN PAUS?"
    ],
    "MTA-AM03": [
      "ÅH, JAG ÄR HUNGRIG..."
    ],
    "MTA-AM04": [
      "EH... JAG TROR ATT PIPPINS BUR BEHÖVER RENGÖRAS..."
    ],
    "MTA-AM05": [
      "JÖSSES, DET DÄR ÄR EN RIKTIGT STOR ÄDELSTEN!"
    ],
    "MTA-AM06": [
      "EH... JAG VILLE ALLTID BLI EN SKOGSHUGGARE..."
    ],
    "MTA-AM07": [
      "EH, GORDY LOVADE MIG HÄLFTEN AV VAD JAG KUNDE BÄRA!"
    ],
    "MTA-AM08": [
      "A-HA... PIPPIN ÄR MIN BÄSTA VÄN..."
    ],
    "MTA-AM09": [
      "JAG ÄLSKAR MIN LILLA PIPPI..."
    ],
    "RED-AM01": [
      "ÄR DET NÅGON DÄR?"
    ],
    "RED-AM02": [
      "NÅ..."
    ],
    "RED-AM03": [
      "VAD HÖLL ER UPPTAGNA?"
    ],
    "SAGELP03": [
      "DOM HÄR TVÅ SKULLE INTE ENS KUNNA DRA VAXET UR SINA EGNA ÖRON..."
    ],
    "SAGELP04": [
      "HAN KOMMER ALDRIG BLI SOM SIN FARBROR...",
      "JAG BRYR MIG INTE OM VAD DOM ANDRA SÄGER."
    ],
    "SAGELP05": [
      "HALLÅ DÄR, BLÅ VISMANNEN? HALLÅ DÄR?",
      "VAR I HELA FRIDEN KAN HAN HA TAGIT VÄGEN..."
    ],
    "SAGELP06": [
      "OJ, OJ, OJ..."
    ],
    "SAGELP11": [
      "NÅGON? VEM SOM HELST? KOM IN?"
    ],
    "SAGELP20": [
      "HMM..."
    ],
    "SAGELP21": [
      "LURKARNA MÅSTE STOPPAS."
    ],
    "SAGELP22": [
      "JAG FÖRSTÅR..."
    ],
    "SAGELP23": [
      "NEJ..."
    ],
    "SAGELP24": [
      "VAD SKULLE KUNNA HA HÄNT MED DEM?"
    ],
    "SAGELP31": [
      "DET HÄR ÄR INTE BRA."
    ],
    "SAGELP32": [
      "MÖRKA ECO-KRISTALLER?"
    ],
    "SAGELP33": [
      "MAIA OCH GOL HAR TAGIT SIG VATTEN ÖVER HUVUDET!"
    ],
    "SAGELP34": [
      "HMPH, DEN MÖRKA ECONS ENERGI GÅR INTE ATT KONTROLLERA!"
    ],
    "SAGELP35": [
      "MÖRK ECO I GLACIÄRERNA?"
    ],
    "SAGELP36": [
      "ÅH! DET FINNS LURKTRUPPER UPPE I BERGEN!"
    ],
    "SAGELP37": [
      "VAD HÅLLER GOL PÅ MED ATT PLANERA..."
    ],
    "SAGELP38": [
      "SKULLE HAN FAKTISKT KUNNA HA...?"
    ],
    "SCU-AM01": [
      "ÅH... JAG KAN BARA INTE GÖRA DET LÄNGRE."
    ],
    "SCU-AM02": [
      "ÅH, JAG BARA ÖNSKADE ATT JAG HADE LITE INSPIRATION."
    ],
    "SCU-AM03": [
      "JAG ÄR PRECIS LIKA INSPIRERAD... SOM DEN HÄR STENEN."
    ],
    "SCU-AM04": [
      "ÅH... VAR ÄR MIN MUSA?"
    ],
    "SCU-AM05": [
      "JAG KAN INTE ARBETA SÅ HÄR!"
    ],
    "SCU-AM06": [
      "ÅH SNÄLLA... KOMMER HON NÅGONSIN ATT VILJA KOMMA TILLBAKA TILL MIG?"
    ],
    "SCU-LO01": [
      "ÅH SNÄLLA NÅN..."
    ],
    "SKSP009F": [
      "HÄR FÅR NI! HÄR FÅR NI! HA HA HA!"
    ],
    "WAR-LO1A": [
      "(SNYFTANDE)"
    ],
    "WAR-LO1B": [
      "(SNYFTAR)"
    ],
    "WAR-LO1C": [
      "(SNYTER SIG OCH FRÄSER)",
      "(FORTSÄTTER ATT GRÅTA)"
    ],
    "YEL-AM01": [
      "TIDEN HÅLLER PÅ ATT RINNA UT!"
    ],
    "YEL-AM02": [
      "HÖRRU! SE TILL ATT FÅ UT MIG HÄRIFRÅN!"
    ],
    "YEL-AM03": [
      "NÄR JAG VÄL KOMMER UT HÄRIFRÅN, SÅ KOMMER DET ATT BÖRJA SKJUTAS!"
    ],
    "asstv100": [
      "OK, NI HAR TILLRÄCKLIGT MED CELLER FÖR ATT ÖKA STYRKAN PÅ VÄRMESKÖLDEN.",
      "ÅK MED GRUVVAGNEN AV TRÄ NER FÖR GRUVSCHAKTET VID LAVAGEJSERN.",
      "JAG KOMMER ATT MÖTA ER VID INGÅNGEN TILL LAVATUNNELN,",
      "SÅ ATT JAG KAN MODIFIERA ZOOMERN. SKYNDA!"
    ],
    "asstv101": [
      "HA HA, OK! NI HAR TILLRÄCKLIGT MED CELLER FÖR ATT KUNNA ÖKA",
      "ENERGIN PÅ VÄRMESKÖLDEN.",
      "MÖT MIG VID DEN DÄR VULKANISKA KRATERN.",
      "JAG KOMMER ATT VÄNTA VID LAVATUNNELN VID GRUVSCHAKTET VID LAVAGEJSERN.",
      "TA MED ER KRAFTCELLERNA!"
    ],
    "asstv102": [
      "SKYNDA PÅ MED DOM DÄR KRAFTCELLERNA!",
      "JAG VÄNTAR VID GRUVSCHAKTET NÄRA LAVAGEJSERN."
    ],
    "asstv103": [
      "GLÖM INTE BORT ATT AKTIVERA TELEPORTALEN FÖR ATT SLÄPPA GENOM OSS.",
      "NI MÅSTE GÅ IN I DEN RÖDE VISMANNENS LABB",
      "SOM FINNS I MITTEN AV DEN VULKANISKA KRATERN FÖR ATT KUNNA AKTIVERA DEN.",
      "VI KAN INTE TA OSS IGENOM FÖRRÄN DEN ÄR UPPE IGEN."
    ],
    "asstv104": [
      "HALLÅ DÄR, VI ÄR FORTFARANDE KVAR I STENBYN!",
      "AKTIVERA TELEPORTALEN!"
    ],
    "asstv105": [
      "VI SKULLE GÄRNA VILJA MÖTA UPP ER I DEN VULKANISKA KRATERN!",
      "GÅ IN I DEN RÖDE VISMANNENS LABB OCH AKTIVERA PORTEN."
    ],
    "asstva73": [
      "HALLÅ DÄR KILLAR! ENLIGT MINA UTRÄKNINGAR, SÅ KOMMER DET ATT KRÄVAS",
      "72 KRAFTCELLER FÖR ATT GE TILLRÄCKLIGT MED ENERGI ÅT VÄRMESKÖLDEN",
      "FÖR ATT KUNNA STÅ EMOT LAVAN PÅ VÄGEN MOT GOL OCH MAIAS CITADELL."
    ],
    "asstva74": [
      "NI HAR FORTFARANDE INTE TILLRÄCKLIGT MED KRAFTCELLER FÖR ATT TA ER IGENOM DEN HÄR LAVAN!",
      "NI KAN INTE TA ER IGENOM TILL GOL OCH MAIAS CITADELL",
      "FÖRRÄN NI HAR SAMLAT IHOP 72 KRAFTCELLER!"
    ],
    "asstvb02": [
      "WOW, SÅG NI DET DÄR?",
      "BLÅ ECO-KÄLLOR HAR AKTIVERATS RUNT OM HELA VÄRLDEN!",
      "JAG VISSTE ATT DET FANNS ETT SÄTT ATT AKTIVERA DOM.",
      "DET MÅSTE FINNAS ANDRA PLATSER FÖR ATT AKTIVERA DOM ANDRA ECO-KÄLLORNA OCKSÅ."
    ],
    "asstvb03": [
      "SNYGGT! NI LYCKADES STOPPA ALLA LURKARNA SOM SLÄPPTE MINOR!",
      "DOM HAR HÅLLT PÅ MED ATT HOTA VATTNEN RUNT VÅR BY UNDER FLERA VECKOR.",
      "TA MED ER ZOOMER TILL TRANSPORTPLATTAN SÅ TELEPORTERAR JAG DEN TILLBAKA!"
    ],
    "asstvb04": [
      "BRA, NI HAR LYCKATS SAMLA IHOP TILLRÄCKLIGT MÅNGA KRAFTCELLER FÖR ATT GE ENERGI ÅT MIN VÄRMESKÖLD!",
      "MÖT MIG VID INGÅNGEN TILL ELDRAVINEN",
      "GENOM ATT KLÄTTRA UPP FÖR KLIPPAN BAKOM BONDENS HUS.",
      "TA MED ER KRAFTCELLERNA, OCH SKYNDA HIT!",
      "MIN FAR SÄGER ATT HAN HAR SETT FLER LURKAR I KROKARNA!"
    ],
    "asstvb08": [
      "SKYNDA PÅ MED DOM DÄR KRAFTCELLERNA.",
      "JAG VÄNTAR PÅ ER VID MYNNINGEN TILL ELDRAVINEN",
      "VID TOPPEN AV KLIPPAN BAKOM BONDENS HUS!"
    ],
    "asstvb09": [
      "NI HAR INTE RIKTIGT TILLRÄCKLIGT MED KRAFTCELLER FÖR ATT GE ENERGI ÅT MIN VÄRMESKÖLD.",
      "NI KAN INTE PASSERA IGENOM ELDRAVINEN FÖRRÄN NI HAR SAMLAT IHOP TILLRÄCKLIGT MÅNGA KRAFTCELLER."
    ],
    "asstvb20": [
      "SNYGG FLYGNING! DOM DÄR LURKARNA VAR INGEN MATCH FÖR ER ZOOMER!",
      "DET ÄR EN TILL KRAFTCELL!"
    ],
    "asstvb21": [
      "BRA JOBBAT! ÄR NI INTE GLADA",
      "ATT NI RÄDDADE VÅR LILLA FLUTT-FLUTTVÄN?",
      "HON KOMMER KANSKE ATT KOMMA VÄL TILL PASS NÅGON ANNAN GÅNG.",
      "NU, TA HENNE TILLBAKA TILL TRANSPORTPLATTAN, SÅ KAN JAG TELEPORTERA HEM HENNE."
    ],
    "asstvb22": [
      "WOW! NI LYCKADES LYFTA UPP EN BIT AV UNDERVATTENSRUINEN TILL YTAN!",
      "DET VERKAR SOM ATT NI KAN ANVÄNDA ECO PÅ SÄTT SOM VI ALDRIG SETT FÖRRUT!",
      "EN KRAFTCELL KOM UPP TILL YTAN MED RUMMET. KLÄTTRA UPP DÄR OCH TA DEN."
    ],
    "asstvb23": [
      "SNYGGT JOBBAT! STENBYNS BEFOLKNING KAN ANDAS",
      "UT MED LÄTTNAD!",
      "MEN VI HAR INTE TID ATT FIRA! TA MED DIG DIN ZOOMER",
      "FÖR ATT NAVIGERA IGENOM BERGSPASSET SOM LIGGER FRAMFÖR ER.",
      "VAR FÖRSIKTIGA, FÖR DET VERKAR SOM LURKARNA HAR RIGGAT",
      "HELA PASSET MED SPRÄNGMEDEL!",
      "NÄR NI KOMMER TILL DEN VULKANISKA KRATERN,",
      "FÅR NI INTE GLÖMMA ATT BESÖKA DEN RÖDE VISMANNENS LABB",
      "OCH AKTIVERA TELEPORTALEN SÅ ATT FAR OCH JAG KAN KOMMA DIT OCH MÖTA UPP ER."
    ],
    "asstvb24": [
      "ÅH KÄRA NÅN! DOM DÄR LURKARNA MÅSTE VARA PÅ VÄG",
      "TILL EN AVTRYCKARE VID SLUTET AV PASSET!",
      "OM DOM LYCKAS KOMMA FRAM FÖRE ER,",
      "SÅ KOMMER DOM ATT SPRÄNGA HELA PASSET!",
      "NI MÅSTE HINNA FRAM FÖRE DOM OCH FÖRSTÖRA AVTRYCKAREN,",
      "ANNARS ÄR DET KÖRT!"
    ],
    "asstvb25": [
      "SNYGGT JOBBAT! NI LYCKADES HINNA FÖRE DOM TILL AVTRYCKAREN!",
      "DEN RÖDE VISMANNENS LABB ÄR PRECIS FRAMFÖR ER.",
      "GÅ DIT OCH AKTIVERA TELEPORTALEN SÅ ATT VI KAN KOMMA DIT OCH MÖTA UPP ER."
    ],
    "asstvb28": [
      "HALLÅ DÄR! GLÖM INTE BORT VISMANNEN OCH MIG!",
      "NI MÅSTE AKTIVERA TELEPORTALEN FÖR ATT VI SKA KUNNA KOMMA IGENOM!",
      "DEN FINNS I DEN BLÅ VISMANNENS LABB, VID SLUTET AV ELDRAVINEN.",
      "OM NI INTE LÅTER OSS KOMMA IGENOM, SÅ KAN VI INTE HJÄLPA ER!"
    ],
    "asstvb29": [
      "HALLÅ! VI VÄNTAR FORTFARANDE!",
      "AKTIVERA TELEPORTALEN!"
    ],
    "asstvb30": [
      "HALLÅ DÄR! VI KAN INTE KOMMA IGENOM FÖRRÄN TELEPORTALEN ÄR AKTIVERAD!"
    ],
    "asstvb40": [
      "DEN HÄR APPARATEN ÄR EN KOMMUNIKATÖR. MED DEN HÄR SÅ KAN MIN FAR OCH JAG",
      "GE ER RÅD NÄR SOM HELST UNDER ERT UPPDRAG."
    ],
    "asstvb41": [
      "DOM HÄR SVÄVANDE ÄGGFORMADE SAKERNA ÄR PRECURSOR-KULOR.",
      "SAMLA IHOP TILLRÄCKLIGT MÅNGA AV DEM, OCH NÅGRA AV BYBORNA KOMMER GE ER",
      "EN KRAFTCELL I UTBYTE."
    ],
    "asstvb42": [
      "DET HÄR ÄR EN KRAFTCELL, DEN VIKTIGASTE PRECURSOR-ARTEFAKTEN NI KAN HITTA!",
      "NI MÅSTE SAMLA IHOP 20 STYCKEN AV DESSA SÅ ATT JAG KAN LADDA UPP VÄRMESKÖLDEN",
      "TILL ER A-GRAV-ZOOMER."
    ],
    "asstvb44": [
      "HALLÅ DÄR! NI HITTADE EN AV MINA SPEJARFLUGOR!",
      "JAG SKICKADE UT 7 STYCKEN TILL VARJE OMRÅDE FÖR ATT LETA EFTER KRAFTCELLER",
      "MEN LURKARNA MÅSTE HA FÅNGAT DOM ALLIHOP!"
    ],
    "asstvb45": [
      "WOW! DEN DÄR SISTA SPEJARFLUGAN HADE EN KRAFTCELL!",
      "JAG SLÅR VAD OM ATT OM NI SAMLAR IN ALLA 7 I VARJE OMRÅDE",
      "NI KAN HITTA ÄNNU FLER KRAFTCELLER."
    ],
    "asstvb46": [
      "VAR FÖRSIKTIGA I HAVEN, FÖR VATTNEN ÄR SMOCKFULLA MED",
      "LURKHAJAR OCH JAG HAR ALDRIG SETT NÅGON BESEGRA EN.",
      "HÅLL DIG BORTA FRÅN DOM OM DU VET VAD SOM ÄR BÄST FÖR DIG!"
    ],
    "asstvb47": [
      "KOM IHÅG, DET DÄR ÄR EN KRAFTCELL.",
      "DU MÅSTE SAMLA IHOP SÅ MÅNGA AV DOM SOM DU BARA KAN."
    ],
    "asstvb48": [
      "DET DÄR ÄR EN BLÅ ECO KÄLLA! DEN ÄR MER KONCENTRERAD ÄN DOM SVÄVANDE KLUMPARNA,",
      "DEN HÄR KÄLLAN KOMMER ATT GE DIG EN FULL LADDNING AV ECO,",
      "VILKET LÅTER DIG ANVÄNDA DET MAXIMALT LÄNGE."
    ],
    "asstvb71": [
      "NI HAR FORTFARANDE INTE TILLRÄCKLIGT MED KRAFTCELLER FÖR ATT GE ENERGI ÅT DEN BLÅ VISMANNENS MASKIN.",
      "VI KAN INTE LYFTA DEN DÄR STENEN TILLS NI HAR SAMLAT IN 45 KRAFTCELLER."
    ],
    "asstvb72": [
      "TILLS DESS ATT VI KOMMER PÅ VARFÖR DEN BLÅ VISMANNEN FÖRSVANN,",
      "SÅ MÅSTE NI SAMLA IN 45 KRAFTCELLER FÖR ATT KUNNA GE ENERGI ÅT HANS MASKIN.",
      "PÅ DOM BARA!"
    ],
    "asstvb75": [
      "DEN HÄR GONDOLEN VERKAR INTE FUNGERA RÄTT.",
      "JAG SKA FÖRSÖKA ARBETA MED ATT FÅ DEN ATT FUNGERA IGEN."
    ],
    "asstvb76": [
      "JAG HAR AKTIVERAT GONDOLEN IGEN. DEN KAN TA ER UPP TILL SNÖIGA BERGET!",
      "ANVÄND DEN NÄR NI VILL."
    ],
    "sagevb01": [
      "NÅ, DET VERKAR SOM NI ÄNTLIGEN",
      "BESTÄMDE ER FÖR ATT RENSA MINA SAMLARE.",
      "JAG SKULLE GÄRNA VILJA ERBJUDA ER MINA GRATULATIONER",
      "MEN NI HAR SÅ MYCKET ATT GÖRA SÅ JAG SKA INTE SLÖSA BORT ER TID.",
      "FÖRRESTEN, OM SAKER INTE SKULLE GÅ ENLIGT PLAN,",
      "KAN JU DAXTER ALLTID JOBBA MED ATT KONTROLLERA BYNS RÅTTPROBLEM.",
      "AH HA HA HA HA HA."
    ],
    "sagevb02": [
      "JAG MÅSTE MEDGE, JAG ÄR IMPONERAD. NI LYCKADES ATT INTE KLANTA TILL DET!",
      "NU NÄR LURKARNA INTE LÄNGRE KAN ÖPPNA DEN DÄR SILON",
      "SÅ KAN DOM INTE ÖVERSVÄMMA VÄRLDEN MED MÖRK ECO",
      "OCH ORSAKA OBESKRIVLIG FÖRÖDELSE.",
      "TA BORT DET DÄR LÖJLIGA LEENDET, DAXTER!",
      "NI TVÅ HAR FORTFARANDE MYCKET KVAR ATT GÖRA.",
      "JOBBA PÅ!"
    ],
    "sagevb03": [
      "NI FORTSÄTTER ATT IMPONERA PÅ MIG. MEN DET KANSKE JUST BEROR PÅ ATT",
      "JAG HAR LÅGA FÖRVÄNTNINGAR.",
      "OK, ERT TILLFÄLLE ATT SKRYTA ÄR SLUT.",
      "FORTSÄTT JOBBA!"
    ],
    "sagevb04": [
      "BRA JOBBAT, JAK! DIN FARBROR SKULLE HA VARIT STOLT.",
      "DET DÄR VAR EN JÄTTESTOR ARM FRÅN EN PRECURSOR ROBOT.",
      "JAG HAR ALDRIG SETT NÅGOT SÅDANT I SÅ PASS BRA SKICK!",
      "JAG KAN INTE FÖRESTÄLLA MIG VAD LURKARNA VILLE GÖRA MED DET,",
      "MEN VI VILLE DEFINITIVT INTE ATT DOM SKULLE FÅ TAG PÅ DET.",
      "OM NI FORTSÄTTER LYCKAS SÅ VÄL...",
      "NEJ, NI KOMMER INTE ATT VARA I NÄRHETEN AV ATT VARA HJÄLTE.",
      "MEN FORTSÄTT ATT FÖRSÖKA. DET ÄR UPPFRISKANDE."
    ],
    "sagevb21": [
      "DOM DÄR SMÅ GRÖNA BOLLARNA MED ENERGI PÅ MARKEN ÄR EN SORTS ECO.",
      "PLOCKA UPP 50 SMÅ GRÖNA ECOS, ELLER EN STOR GRÖN FÖR ATT ÖKA DIN HÄLSA."
    ],
    "sagevb22": [
      "DET DÄR ÄR BLÅ ECO, VILKET INNEHÅLLER RÖRELSEENERGI.",
      "BLÅ ECO TILLÅTER DIG ATT SPRINGA SNABBT, SLÅ SÖNDER LÅDOR, OCH ÄVEN AKTIVERA NÅGRA PRECURSOR-",
      "ARTEFAKTER NÄR DU KOMMER TILLRÄCKLIGT NÄRA DOM."
    ],
    "sagevb23": [
      "NOTERA HUR VARJE KLUMP AV BLÅ ECO DU PLOCKAR UPP",
      "ÖKAR TIDEN DU KAN ANVÄNDA DESS ENERGI."
    ],
    "sagevb24": [
      "DET HÄR ÄR EN PRECURSOR-DÖRR.",
      "DEN KAN BARA ÖPPNAS GENOM ATT NÄRMA SIG DÖRREN",
      "MEDAN DU KANALISERAR BLÅ ECO GENOM DIN KROPP."
    ],
    "sagevb25": [
      "BRA JOBBAT, BLÅ ECO FICK DÖRREN ATT ÖPPNAS.",
      "MED HJÄLP AV BLÅ ECO, KAN DU FÖRA IN ENERGI I ALLA MÖJLIGA SORTERS",
      "PRECURSOR-ARTEFAKTER SOM HAR LEGAT I DVALA UNDER MÅNGA ÅR."
    ],
    "sagevb26": [
      "ANVÄND DINA GOGGLES FÖR ATT SE DINA FRAMSTEG UNDER ÄVENTYRET."
    ],
    "sagevb27": [
      "DU KAN HOPPA EN GÅNG, SEN HOPPA EN GÅNG TILL MEDAN DU ÄR I LUFTEN FÖR ATT NÅ ÄNNU HÖGRE KANTER."
    ],
    "sagevb28": [
      "NÄR DU ÄR OMRINGAD AV FIENDER, ANVÄND DIN SNURRSPARK."
    ],
    "sagevb29": [
      "DET DÄR ÄR INTE EN SNURRSPARK! FÖRSÖK IGEN."
    ],
    "sagevb30": [
      "KOM IGEN, JAK! GÖR EN SNURRSPARK."
    ],
    "sagevb31": [
      "BRA JOBBAT. ANVÄND SNURRSPARKEN OM DU BEHÖVER ANVÄNDA EN BRA ALLSIDIG ATTACK."
    ],
    "sagevb32": [
      "FÖR EN ATTACK SOM FÖRFLYTTAR DIG RAKT FRAMÅT, SLÅ MED DIN NÄVE."
    ],
    "sagevb33": [
      "DET DÄR SER INTE UT SOM EN SLAGATTACK! KOM IGEN OCH SLÅ NU."
    ],
    "sagevb34": [
      "JAK! ANVÄND EN SLAGATTACK."
    ],
    "sagevb35": [
      "BRA JOBBAT. ANVÄND EN SLAGATTACK FÖR ATT TÄCKA YTOR SNABBT I EN KNIPA."
    ],
    "sagevb36": [
      "IBLAND KOMMER DU BEHÖVA SLÅ TILL SAKER MED STÖRRE KRAFT.",
      "FÖR ATT KUNNA SLÅ SÖNDER DOM HÄR LÅDORNA MÅSTE DU HOPPA UPP I LUFTEN",
      "OCH SEDAN DYKA NER PÅ DOM, MED NÄVARNA FÖRST."
    ],
    "sagevb37": [
      "NÄR DU FÅTT LITE SJÄLVFÖRTROENDE, FÖRSÖK ANVÄNDA NÅGRA AV DINA ATTACKER I KOMBINATIONER."
    ],
    "sagevb38": [
      "DU KAN INTE KOMMA TILLBAKA GENOM PORTALEN",
      "FÖRRÄN DU HITTAT ALLA 4 KRAFTCELLERNA PÅ DEN HÄR ÖN."
    ],
    "sagevb39": [
      "PERFEKT! DU HITTADE ALLA KRAFTCELLERNA PÅ ÖN.",
      "KOM TILLBAKA TILL PORTALEN SÅ ATT JAG KAN TA ER TILLBAKA TILL LABBET. SKYNDA PÅ!"
    ],
    "sksp0001": [
      "HALLÅ! DEN DÄR SNYGGINGEN KEIRA HADE RÄTT! DET FINNS TRANSPORTPLATTOR HÄR UTE."
    ],
    "sksp0002": [
      "LITA PÅ MIG, DOM DÄR MÖRKA ECO LÅDORNA ÄR RIKTIGT DÅLIGA NYHETER!"
    ],
    "sksp0003": [
      "JAG SLÅR VAD OM ATT VI HITTAR ALLA DOM DÄR SJUKT SÖTA SPEJARFLUGORNA I VARJE OMRÅDE",
      "SÅ KOMMER ÅTMINSTONE EN AV DOM HA EN KRAFTCELL!"
    ],
    "sksp0004": [
      "SNYGGT, SKATTER!"
    ],
    "sksp0005": [
      "DOM HÄR TRÄLÅDORNA SER INTE SÅ TUFFA UT!",
      "JAG SKULLE SLÅ VAD OM ATT DOM GÅR SÖNDER OM DU DYKBOMBAR DOM."
    ],
    "sksp0006": [
      "DOM DÄR METALLÅDORNA ÄR TJOCKARE ÄN EN JAKO-SKALLE!",
      "MEN DET MÅSTE FINNAS NÅGONTING SOM KAN ÖPPNA UPP DOM."
    ],
    "sksp0007": [
      "ETT ORD: KRAFTCELLER. VI MÅSTE HITTA DOM OCH DET SER INTE SÅ BRA UT FÖR TILLFÄLLET."
    ],
    "sksp0008": [
      "VI BEHÖVER KULOR. KULOR, JAK! HUR SKA VI ANNARS KUNNA KÖPA KRAFTCELLER OM VI INTE SAMLAR NÅGRA KULOR!"
    ],
    "sksp0009": [
      "VILKEN KONSTIG SAK! JAG SLÅR VAD OM ATT VI KAN FÅ DEN ATT ÖPPNAS",
      "OM DU ÄR UPPLADDAD MED DET DÄR LYSANDE BLÅ ECO-GREJSET."
    ],
    "sksp0010": [
      "HALLÅ DÄR! BORDE VI INTE GÅ NER OCH KOLLA IN DEN GAMLA FISKARENS MOTORBÅT SOM LIGGER NERE VID HAMNEN!"
    ],
    "sksp0011": [
      "VI BORDE GÅ OCH FRÅGA FISKAREN NERE VID DJUNGELFLODEN",
      "OM VI KAN LÅNA HANS MOTORBÅT OCH STICKA ÖVER TILL DIMMIGA ÖN!"
    ],
    "sksp0013": [
      "SÅG DU STORLEKEN PÅ DEN DÄR TUGGAN",
      "SOM LURKHAJEN TOG AV FISKARENS BÅT?",
      "VI SKALL NOG HÅLLA OSS LÅNGT BORTA FRÅN DOM!",
      "JAG TROR INTE ATT VI KAN HANTERA EN VARELSE SOM ÄR SÅ JÄKLA GRYM."
    ],
    "sksp0014": [
      "VI HAR SAMLAT IHOP TILLRÄCKLIGT MÅNGA KULOR FÖR ATT BYTA TILL EN KRAFTCELL.",
      "LÅT OSS GÅ TILLBAKA OCH GÖRA BYTET NU PÅ EN GÅNG!"
    ],
    "sksp0015": [
      "DET DÄR MÅSTE VARA EN AV DOM DÄR PRECURSOR-ORAKLEN SOM VISMANNEN TJATAR OM HELA TIDEN.",
      "JAG HOPPAS ATT DOM INTE VAR LIKA FULA I VERKLIGHETEN!"
    ],
    "sksp0017": [
      "WOW! KOLLA IN DEN DÄR HÄFTIGA SKULPTUREN",
      "SOM STÅR PÅ STENARNA DÄR BORTA!"
    ],
    "sksp0018": [
      "VI BORDE GÅ OCH SÄGA ÅT DEN DÄR PRATKVARNEN TILL BORGMÄSTARE ATT HAN STÅR I STOR SKULD TILL OSS",
      "FÖR ATT VI KOPPLADE IHOP BYNS ENERGISTRÅLE!"
    ],
    "sksp0019": [
      "HALLÅ DÄR, FISKMÅSAR! VI KAN VÄL STÖRA DOM BARA FÖR SKOJS SKULL?"
    ],
    "sksp0020": [
      "TJO HO HO! KAN VI INTE GÖRA DET DÄR IGEN!"
    ],
    "sksp0021": [
      "DÄR ÄR DOM DÄR FISKMÅSARNA IGEN. PÅ DOM BARA!!"
    ],
    "sksp0022": [
      "AH HA HA HA HA HA!! OH HO HO!"
    ],
    "sksp0023": [
      "TJOFLÖJT!"
    ],
    "sksp0024": [
      "TJO HO HO! TJO HO!"
    ],
    "sksp0025": [
      "OJDÅ! DOM SKAPADE EN LAVIN! KOM SÅ GÅ VI OCH KIKAR PÅ DET."
    ],
    "sksp0026": [
      "HALLÅ DÄR! DEN DÄR PELIKANEN SNODDE PRECIS EN KRAFTCELL!",
      "VI GÅR OCH LÄR FÅGELN EN LÄXA!"
    ],
    "sksp0027": [
      "FORT! VI MÅSTE HINNA FRAM TILL KRAFTCELLEN INNAN PELIKANEN PLOCKAR UPP DEN IGEN."
    ],
    "sksp0028": [
      "SPARKA ÄGGET! HA HA! SPARKA DET! SPARKA DET!"
    ],
    "sksp0029": [
      "EH, VI BORDE NOG PRATA MED FÅGELSKÅDAREN",
      "OCH SE OM VI KNÄCKTE DET DÄR FLUTT-FLUTTÄGGET."
    ],
    "sksp0030": [
      "HALLÅ, FÖRSÖK ATT SLÅ TILL STENARNA FÖR ATT FÅ DOM UR VÄGEN!"
    ],
    "sksp0031": [
      "ÅH! VI KAN ANVÄNDA KANONEN FÖR ATT SPRÄNGA LITE SAKER!"
    ],
    "sksp0034": [
      "KRAFT! KRAFT! DYK EFTER DOM DÄR KULORNA JAK, DYK!"
    ],
    "sksp0035": [
      "OK, SÅ VI HAR EN PRECURSOR-AVFYRNINGSRAMP HÄR",
      "MEN DU HAR INTE LADDAT UPP MED DET DÄR BLÅA GREJSET. SÅ DET KOMMER INTE ATT HJÄLPA OSS!"
    ],
    "sksp0037": [
      "DOM DÄR TORNEN SOM FINNS UTSPRIDDA ÖVER HELA DJUNGELN MÅSTE LEDA OM ECO STRÅLEN.",
      "KOM IGEN SÅ TAR VI OCH FÖRSÖKER LIRKA MED DOM!"
    ],
    "sksp0038": [
      "HMM, OM BLÅ ECO KAN BYGGA EN BRO, SÅ SKULLE JAG SLÅ VAD OM ATT DET OCKSÅ KAN ÖPPNA EN DÖRR!",
      "KOM IGEN, VI GÅR TILLBAKA OCH SER TILL ATT DU FÅR ENERGI IGEN."
    ],
    "sksp0039": [
      "TITTA DÄR, DET FINNS SMÅ BLIXTMARKERINGAR PÅ STOLPARNA",
      "OCH DET KOMMER UT BLIXTAR FRÅN KÄLLAN DÄR BORTA.",
      "TÄNKER DU SAMMA SOM JAG?"
    ],
    "sksp0040": [
      "KOM IGEN SÅ ATT VI KAN KOMMA UPP PÅ MASKINEN OCH KROSSA SPEGELN SOM AVLEDER PRECURSOR-STRÅLEN!"
    ],
    "sksp0041": [
      "VI BEHÖVER TA OSS UPP TILL TOPPEN AV DET DÄR TORNET!"
    ],
    "sksp0043": [
      "VI BORDE KANSKE GÅ OCH LETA RÄTT PÅ FISKAREN.",
      "JAG HÖRDE ATT HAN VAR I DJUNGELN OCH FISKADE VID DEN NEDRE FLODEN!"
    ],
    "sksp0049": [
      "RIKTA STRÅLEN GENOM ATT PEKA DEN MOT NÄSTA TORN!"
    ],
    "sksp0050": [
      "KROSSA SPEGELN, JAK!"
    ],
    "sksp0051": [
      "TA INSEKTERNA, JAK! TA INSEKTERNA!"
    ],
    "sksp0052": [
      "KOM IGEN SÅ GÅR VI TILL NÄSTA TORN OCH ÅTERKOPPLAR STRÅLEN DÄR!"
    ],
    "sksp0053": [
      "HALLÅ! VI KAN FÖLJA STRÅLEN FÖR ATT HITTA TILL NÄSTA TORN."
    ],
    "sksp0054": [
      "VI MÅSTE SE TILL ATT DU ÄR FYLLD MED DET DÄR BLÅ GREJSET FÖR ATT KUNNA ÖPPNA DET HÄR!"
    ],
    "sksp0056": [
      "TITTA! JAG SER SKULPTÖRENS MUSA DÄR!"
    ],
    "sksp0059": [
      "DET HÄR STÄLLET GER MIG RYSNINGAR!",
      "VI BORDE NOG SE TILL ATT HÅLLA DIG BORTA FRÅN GEGGAN, OK?"
    ],
    "sksp0060": [
      "(GNYR) DET HÄR STÄLLET GER MIG RYSNINGAR!",
      "OCH TRO MIG, DET ÄR EN HELT NY UPPLEVELSE",
      "NÄR DU ÄR HELT TÄCKT MED PÄLS!"
    ],
    "sksp0062": [
      "KOM IGEN SÅ SMÄLLER VI DOM DÄR BALLONGLURKARNA OCH STRIMLAR DOM!"
    ],
    "sksp0063": [
      "JAG SA \"STRIMLA LURKARNA\" JAK. INTE MINORNA!",
      "REGEL NUMMER ETT: UNDVIK ALLTID MINORNA!"
    ],
    "sksp0064": [
      "VAR FÖRSIKTIG! DU MINNS VÄL VAD SOM HÄNDE FÖRRA GÅNGEN VI VAR HÄR."
    ],
    "sksp0067": [
      "RAMLA INTE NER I DIMMAN UNDER OSS!",
      "FÖR JAG TROR INTE VI SKULLE KUNNA KOMMA UPP IGEN."
    ],
    "sksp0069": [
      "DET ÄR ETT BAKHÅLL, JAK! DET ÄR ETT BAKHÅLL!"
    ],
    "sksp0070": [
      "HOPPA UPP I LUFTEN, OCH DYK NER PÅ DEN FÖR ATT KUNNA BALANSERA PÅ DEN."
    ],
    "sksp0071": [
      "FÅ TAG PÅ DEN RÖDA ECON!"
    ],
    "sksp0072": [
      "RÖD ECO GÖR DINA ATTACKER STARKARE."
    ],
    "sksp0073": [
      "VI BEHÖVER BLÅ ECO FÖR ATT KUNNA LADDA DEN HÄR PLATTFORMEN!"
    ],
    "sksp0076": [
      "JAK! TA NÅGRA HOPP FÖR ATT HÅLLA OSS FRÅN DEN VARMA MARKEN."
    ],
    "sksp0077": [
      "BALLONGER ÄR BRA, BRINNANDE HET MAGMA ÄR INTE BRA!"
    ],
    "sksp0078": [
      "KÖR PÅ DOM UPPHÖJDA PRECURSOR-SAKERNA FÖR ATT HÅLLA OSS SVALA."
    ],
    "sksp0079": [
      "AH! JAG KOMMER ATT DÖ! JAG KOMMER, FARFAR!",
      "DU MÅSTE FÅ DEN HÄR SAKEN ÖVER TILL ANDRA SIDAN INNAN DEN BLIR ÖVERHETTAD!"
    ],
    "sksp0080": [
      "ANVÄND KURVAN FÖR ATT KUNNA STYRA BÄTTRE!"
    ],
    "sksp0081": [
      "AH! JAG KANSKE BORDE KÖRA!"
    ],
    "sksp0082": [
      "DU FÖRSÖKER UNDVIKA DOM DÄR MÖRKA ECO-LÅDORNA, ELLER HUR?"
    ],
    "sksp0083": [
      "ÅH! SE OM VI SKULLE KUNNA LYFTA LITE GENOM ATT FLYGA PÅ DOM DÄR LURKARNA!"
    ],
    "sksp0084": [
      "FÖR NÄRA, FÖR NÄRA!"
    ],
    "sksp0085": [
      "AJDÅ! DEN HÄR LILLA SÖTNOSEN HÅLLER PÅ ATT BLI ALLT FÖR VARM!"
    ],
    "sksp0086": [
      "NÅGRA SEKUNDER TILL OCH VI BLIR STEKT FLUTT-FLUTT!"
    ],
    "sksp0087": [
      "TRÄFFA DOM DÄR BALLONGERNA FÖR ATT KYLA NER!"
    ],
    "sksp0088": [
      "HÄR KOMMER EN TILL BALLONG!"
    ],
    "sksp0089": [
      "JAG ÖNSKAR JAG HADE FÖRSOVIT MIG I MORSE!"
    ],
    "sksp0090": [
      "DU MISSADE EN BALLONG! VI BEHÖVER DOM ANNARS ÄR VI STEKTA!"
    ],
    "sksp0091": [
      "KÄRRAN HÅLLER PÅ ATT BLI FÖR VARM!"
    ],
    "sksp0092": [
      "TYCKER DU DET BÖRJAR LUKTA BRÄNT?!"
    ],
    "sksp0093": [
      "JAG TROR MIN SVANS BRINNER!"
    ],
    "sksp0094": [
      "DEN KOMMER EXPLODERA!"
    ],
    "sksp0095": [
      "JIPPIE! VI KLARADE DET!"
    ],
    "sksp0096": [
      "DET FINNS SPEJARFLUGOR HÄR UTE OCKSÅ!"
    ],
    "sksp009a": [
      "HA HA! DÄR VISADE VI HONOM ALLT."
    ],
    "sksp009b": [
      "SCHYSST, MER KULOR!"
    ],
    "sksp009c": [
      "GÖR MIG EN TJÄNST OCH HÅLL DIG BORTA FRÅN DOM DÄR MÖRKA ECO-LÅDORNA!"
    ],
    "sksp009d": [
      "YEAH-HA-HA-HA!"
    ],
    "sksp009e": [
      "TJOHOO!"
    ],
    "sksp009f": [
      "HÄR FÅR NI, HÄR FÅR NI! HA HA HA!"
    ],
    "sksp009g": [
      "JAG ÄR PRECIS BAKOM DIG, JAK!"
    ],
    "sksp009i": [
      "HITTADE VI ALLA SPEJARFLUGORNA I DET HÄR OMRÅDET?"
    ],
    "sksp009j": [
      "HÖRRU! DET VERKAR SOM ATT SPEJARFLUGOR ALLTID ÄR I RÖDA LÅDOR."
    ],
    "sksp009k": [
      "SCHYSST! DU HITTADE ALLA SPEJARFLUGORNA I DET HÄR OMRÅDET!"
    ],
    "sksp0109": [
      "HURRA! VI SLOG REKORDTIDEN!"
    ],
    "sksp0110": [
      "JAG HAR SAGT DET FÖRR, OCH JAG SÄGER DET IGEN...",
      "FÖRSÖK ATT UNDVIKA DOM MÖRKA ECO-LÅDORNA!"
    ],
    "sksp0111": [
      "VI FÖRSÖKER JAGA TILLBAKA MULLVADARNA NER I MARKEN!"
    ],
    "sksp0112": [
      "KOM IGEN, VI GÅR OCH HÄMTAR VÅR KRAFTCELL FRÅN GEOLOGEN."
    ],
    "sksp0113": [
      "DET DÄR MÅSTE VARA DOM INFEKTERADE VÄXTERNA SOM DEN GAMLA TRÄSKALLEN PRATADE OM."
    ],
    "sksp0114": [
      "VI MÅSTE ANVÄNDA GRÖN ECO FÖR ATT KUNNA BOTA DOM DÄR VÄXTERNA."
    ],
    "sksp0115": [
      "JAK, KÖR IGENOM DEN GRÖNA ECO-KÄLLAN."
    ],
    "sksp0116": [
      "DÄR ÄR EN AV DOM DÄR FLYGANDE LURKARNA!",
      "HAN KANSKE HAR EN KRAFTCELL!"
    ],
    "sksp0117": [
      "DÄR ÄR MULLVADSHÅLET!"
    ],
    "sksp0118": [
      "SE NU TILL ATT VI FLYGER ÖVER DOM INFEKTERADE VÄXTERNA!"
    ],
    "sksp0119": [
      "EN RING AVKLARAD, EN HEL DEL KVAR!"
    ],
    "sksp0120": [
      "SNABBA PÅ! DÄR ÄR NÄSTA RING!"
    ],
    "sksp0121": [
      "SKYNDA! DU MÅSTE FLYGA IGENOM ALLA RINGAR INNAN DOM STÄNGS AV!"
    ],
    "sksp0122": [
      "HÖRRU! DET DÄR GRÄSET SINKAR OSS..."
    ],
    "sksp0123": [
      "FORT! FÖLJ DET DÄR RÖRET!"
    ],
    "sksp0124": [
      "DET HÄR KÄNNS INTE BRA."
    ],
    "sksp0125": [
      "DET SER UT SOM ATT DOM DÄR SAKERNA BEHÖVER LADDAS MED BLÅ ECO."
    ],
    "sksp0126": [
      "KOM IGEN SÅ HÄMTAR VI KRAFTCELLEN UPPE PÅ TAKET PÅ DEN HÄR SAKEN!"
    ],
    "sksp0127": [
      "SPARKA TILL DEN DÄR LILLA HÖGST UPP!"
    ],
    "sksp0128": [
      "JAK! SPRING! DEN MÖRKA ECON STIGER!"
    ],
    "sksp0129": [
      "AHH! DEN DÄR MÖRKA ECON KOMMER NÄRMARE"
    ],
    "sksp0130": [
      "EH, JAG TROR VI MÅSTE AKTIVERA DOM DÄR PLATTFORMARNA ELLER NÅT."
    ],
    "sksp0131": [
      "HÖRRU! DET SER UT SOM DU SKULLE KUNNA DYKBOMBA PÅ DOM DÄR!"
    ],
    "sksp0132": [
      "EE-EE! JISSES! JO-HO! JO-HOO!"
    ],
    "sksp0133": [
      "JAG SLÅR VAD OM ATT VI SKULLE KUNNA FÅ DOM DÄR SAKERNA FYLLDA PÅ EN GÅNG!"
    ],
    "sksp0134": [
      "VAD SÄGS OM ATT VI FÖRSÖKER TA DET LUGNT MED DOM DÄR VARMA RÖREN?!"
    ],
    "sksp0135": [
      "DET DÄR VATTNET SER FARLIGT UT NÄR DET BYTER FÄRG!"
    ],
    "sksp0136": [
      "DU MÅSTE UPP UR VATTNET INNAN DET BYTER FÄRG!"
    ],
    "sksp0137": [
      "JAG SLÅR VAD OM ATT VI SKULLE KUNNA SKJUTA SÖNDER DOM DÄR STENARNA OM VI VAR FYLLDA MED GUL ECO."
    ],
    "sksp0138": [
      "VI BORDE SKJUTA SÖNDER DOM DÄR STORA STENARNA SOM HÅLLER FAST ANKARET."
    ],
    "sksp0139": [
      "VI BORDE KANSKE HJÄLPA KNÄPPSKALLEN ATT HITTA SITT HUSDJUR."
    ],
    "sksp0140": [
      "EN FLUTT-FLUTT KAN GLIDFLYGA LÄNGRE OM HON HOPPAR IGEN I LUFTEN!"
    ],
    "sksp0141": [
      "RÖR INTE DEN DÄR SVARTA VARMA TJÄRAN, DU KOMMER SKADA DIG!"
    ],
    "sksp0142": [
      "VATTNET VERKAR SÄKERT ATT VÄNTA I."
    ],
    "sksp0143": [
      "JÖSSES! FÖRSÖK BRYTA TUNGANS GREPP!"
    ],
    "sksp0144": [
      "SKJUT DOM DÄR RÅTTBONA FÖR ATT STOPPA RÅTTORNA FRÅN ATT KOMMA UT."
    ],
    "sksp0145": [
      "WOW! DU KAN SKJUTA ELDBOLLAR",
      "NÄR DU ÄR FYLLD MED GUL ECO."
    ],
    "sksp0146": [
      "HALLÅ DÄR! DET DÄR ÄR GUL ECO!"
    ],
    "sksp0147": [
      "DU KAN SVINGA PÅ PÅLEN DÄR BORTA!"
    ],
    "sksp0148": [
      "SE UPP, DET DÄR SNÅRET ÄR TAGGIGT!"
    ],
    "sksp0149": [
      "HALLÅ DÄR, DET DÄR SER UT SOM ETT ANKARE SOM HÅLLER LUFTSKEPPET PÅ PLATS!"
    ],
    "sksp0150": [
      "VAR FÖRSIKTIG NÄR DEN DÄR GRODAN ÄR UPPLADDAD!"
    ],
    "sksp0151": [
      "SPRING UNDAN, JAK!"
    ],
    "sksp0152": [
      "SE UPP, JAK! DET ÄR ETT BAKHÅLL!"
    ],
    "sksp0153": [
      "HÖRRU, DET DÄR MÅSTE VARA PRECURSOR-ARTEFAKTEN SOM LURKARNA ÄR UTE EFTER!",
      "DET SER UT SOM EN JÄTTELIK ROBOTARM!"
    ],
    "sksp0154": [
      "DEN DÄR SVARTA TJÄRAN SER UT ATT VARA VARM OCH FARLIG!"
    ],
    "sksp0155": [
      "SKJUT FLADDERMÖSSEN MED DET DÄR GULA ECO-MOJSET!"
    ],
    "sksp0156": [
      "VI KANSKE KAN DUCKA FÖR FLADDERMÖSSEN!"
    ],
    "sksp0157": [
      "SÅG DU DET DÄR? BARA TRE ANKARE KVAR!"
    ],
    "sksp0158": [
      "WOW! BARA TVÅ ANKARE TILL."
    ],
    "sksp0159": [
      "LUFTSKEPPET HÄNGER NÄTT OCH JÄMT KVAR! KOM IGEN SÅ LETAR VI RÄTT PÅ DET SISTA ANKARET!"
    ],
    "sksp0160": [
      "HÖRRU! DÄR ÄR VÅR FLUTT-FLUTT!"
    ],
    "sksp0161": [
      "JAG HATAR RÅTTOR! OCH JAG ÄR NÄSTAN EN SJÄLV."
    ],
    "sksp018a": [
      "DEN DÄR LATA BONDEN ÄR SKYLDIG OSS EN KRAFTCELL!",
      "VI BORDE GÅ OCH PRATA MED HONOM!"
    ],
    "sksp0300": [
      "VI MÅSTE HINNA FÖRE DOM DÄR LURKARNA TILL SLUTET AV PASSET!"
    ],
    "sksp0301": [
      "FÖRSÖK UNDVIKA ATT TRÄFFA DOM DÄR SPRÄNGMEDLEN!"
    ],
    "sksp0302": [
      "HÅLL DIG KVAR FRAMFÖR DOM OCH VI KOMMER GREJA DET HÄR!"
    ],
    "sksp0303": [
      "PRICKA BLÅ ECO FÖR ATT ÖKA FARTEN!"
    ],
    "sksp0304": [
      "UNDVIK TRÄDEN, JAK! DET KOMMER SAKTA NER OSS!"
    ],
    "sksp0305": [
      "JU MER BLÅ ECO VI PRICKAR, DESTO SNABBARE GÅR DET!"
    ],
    "sksp0306": [
      "SE UPP FÖR SPRÄNGMEDLEN!"
    ],
    "sksp0307": [
      "AKTA GROPARNA!"
    ],
    "sksp0308": [
      "JAG KANSKE BORDE KÖRA!"
    ],
    "sksp0309": [
      "DÄR ÄR EN AV LURKARNA!"
    ],
    "sksp0310": [
      "FÅNGA DOM, JAK!"
    ],
    "sksp0311": [
      "VI KÖRDE OM EN AV DOM!"
    ],
    "sksp0312": [
      "AJDÅ, EN AV LURKARNA KÖRDE OM OSS!"
    ],
    "sksp0313": [
      "DOM ÄR LÅNGT FÖRE OSS!"
    ],
    "sksp0314": [
      "ÅH JA, NU ÄR DET VI SOM LEDER!"
    ],
    "sksp0315": [
      "SNABBARE, JAK, SNABBARE!"
    ],
    "sksp0316": [
      "STORT GUPP, STORT GUPP!"
    ],
    "sksp0317": [
      "HÅLL I DIG!"
    ],
    "sksp0318": [
      "JIHA!"
    ],
    "sksp0319": [
      "DET HÄR KOMMER BLI PÅ HÅRET!"
    ],
    "sksp0320": [
      "DOM KOMMER HINNA FÖRE OSS TILL AVTRYCKAREN!"
    ],
    "sksp0321": [
      "VI GJORDE DET! VI HINDRADE DOM FRÅN ATT SPRÄNGA PASSET!"
    ],
    "sksp0327": [
      "JAG TROR DET DÄR VAR DEN SISTA MÖRKA ECO-KRISTALLEN!"
    ],
    "sksp0328": [
      "DU KANSKE SKULLE KUNNA SKJUTA BÄTTRE OM DU SIKTADE MED DINA GOGGLES."
    ],
    "sksp0329": [
      "ÅH, NEJ! MER MÖRK ECO!"
    ],
    "sksp0330": [
      "JAG TROR INTE VI FICK ALLA DOM DÄR MÖRKA ECO-KRISTALLERNA."
    ],
    "sksp0331": [
      "SKJUT LURKARNA SOM TUGGAR PÅ PÅLARNA!"
    ],
    "sksp0332": [
      "LÅT INTE LJUSET SLOCKNA!"
    ],
    "sksp0333": [
      "SLÅ TILL EN KRISTALL FÖR ATT FÅ LITE LJUS."
    ],
    "sksp0334": [
      "SPRING IVÄG! DEN DÄR KRISTALLEN KOMMER EXPLODERA!"
    ],
    "sksp0335": [
      "AJDÅ, DOM HAR HITTAT EN PRECURSOR-ROBOT!"
    ],
    "sksp0336": [
      "SPRÄCK ÄGGEN, INNAN DOM KLÄCKS!"
    ],
    "sksp0337": [
      "DET ÄR LÄSKIGT HÄR INNE..."
    ],
    "sksp0338": [
      "DET VERKAR SOM ATT SPINDELNÄTEN GÅR SÖNDER EFTER TVÅ STUDSAR."
    ],
    "sksp0339": [
      "JA. HATAR. SPINDLAR..."
    ],
    "sksp0340": [
      "BÄBISSPINDLAR PÅ INGÅNG!"
    ],
    "sksp0341": [
      "JAG TROR VI HAR HITTAT ETT SPINDELBO HÄR!"
    ],
    "sksp0342": [
      "SE UPP, HÄR KOMMER FLER SPINDLAR!"
    ],
    "sksp0343": [
      "KOM IGEN, VI STICKER HÄRIFRÅN!"
    ],
    "sksp0345": [
      "HUR KOMMER VI IN I DET HÄR FORTET?"
    ],
    "sksp0346": [
      "KANSKE SKULLE RÖD ECO KUNNA HJÄLPA OSS BESEGRA DEN HÄR!"
    ],
    "sksp0347": [
      "VI BEHÖVER UTFÖRA ETT RULLHOPP!"
    ],
    "sksp0348": [
      "VI MÅSTE HITTA ETT SÄTT ATT KUNNA ÖPPNA DEN HÄR KÄLLAN!"
    ],
    "sksp0349": [
      "DET DÄR SER UT SOM EN ECO KNAPP DÄR NERE!"
    ],
    "sksp0350": [
      "SLÅ TILL DOM NÄR SPIKARNA ÄR INDRAGNA!"
    ],
    "sksp0351": [
      "TRYCK PÅ KNAPPEN!"
    ],
    "sksp0352": [
      "SKYNDA! INNAN DOM DIMPER NER IGEN!"
    ],
    "sksp0359": [
      "DU MÅSTE ANVÄNDA RÖD ECO!"
    ],
    "sksp0360": [
      "SNYGGT! VI AKTIVERADE DOM STÄNGDA GULA ECO KÄLLORNA!"
    ],
    "sksp0362": [
      "TITTA! EN FRUSEN KRAFTCELL!"
    ],
    "sksp0363": [
      "BARA EN FLUTT-FLUTT KAN HOPPA SÅ DÄR LÅNGT!"
    ],
    "sksp0364": [
      "VI MÅSTE SKYNDA OSS, ANNARS ÄR DET KOKTA FLÄSKET STEKT!"
    ],
    "sksp0365": [
      "VÄLJ EN VÄG, VILKEN SOM HELST!"
    ],
    "sksp0366": [
      "UNDVIK, ELLER SKJUT MINORNA, JAK!"
    ],
    "sksp0367": [
      "KOM PÅ ETT SÄTT ATT KOMMA IGENOM DOM DÄR MÖRKA ECO TUNNORNA!"
    ],
    "sksp0368": [
      "FORTSÄTT ATT TA DOM DÄR KYLBALLONGERNA!"
    ],
    "sksp0369": [
      "VI HÅLLER PÅ ATT BLI FÖR VARMA!"
    ],
    "sksp0370": [
      "HON KOMMER EXPLODERA!"
    ],
    "sksp0371": [
      "SIKTA PÅ DEN BLÅ ECON, JAK!"
    ],
    "sksp0372": [
      "SKJUT DIG IGENOM!"
    ],
    "sksp0373": [
      "TJOSAN! VILKEN ÅKTUR!"
    ],
    "sksp0374": [
      "JA! SVÄNG OCH BRÄNN, SÖTNOS!"
    ],
    "sksp0375": [
      "SKJUT KRAFTSFÄRERNA FÖR ATT ÖPPNA DÖRREN!"
    ],
    "sksp0376": [
      "SKJUT KRAFTSFÄRERNA INNAN VI SMÄLTER!"
    ],
    "sksp0378": [
      "DÖRREN ÄR ÖPPEN, KOM IGEN SÅ GÅR VI!"
    ],
    "sksp0379": [
      "ZOOMANDE!"
    ],
    "sksp0380": [
      "VI LYCKADES TA OSS IGENOM!"
    ],
    "sksp0381": [
      "SLÅ SÖNDER GENERATORN FÖR ATT BEFRIA VISMANNEN!"
    ],
    "sksp0382": [
      "HÅLL DIG BARA KVAR I KANTEN!"
    ],
    "sksp0383": [
      "VI HAR FÅTT SÄLLSKAP, JAK. MAAASSOR AV LURKAR!"
    ],
    "sksp0384": [
      "FÖRSTÖR DOM DÄR GENERATORERNA!"
    ],
    "sksp0385": [
      "TRYCK PÅ KNAPPEN!"
    ],
    "sksp0386": [
      "DEN DÄR ROBOTEN SKRÄMMER INTE MIG!"
    ],
    "sksp0387": [
      "KOM IGEN SÅ KLÄTTRAR VI UPP FÖR DOM DÄR PLATTFORMARNA!"
    ],
    "sksp0388": [
      "MISSA INTE NÄSTA AVFYRNINGSRAMP!"
    ],
    "sksp0389": [
      "SE UPP!"
    ],
    "sksp0390": [
      "VI MÅSTE RÄDDA ALLA VISMÄNNEN!"
    ],
    "sksp0391": [
      "TROR DU ATT GOL FORTFARANDE KOMMER ATT VILJA ÄNDRA TILLBAKA MIG?"
    ],
    "sksp0392": [
      "SÅ DET HÄR ÄR GOL OCH MAIAS CITADELL. TREVLIGT OCH MYSIGT."
    ],
    "sksp0393": [
      "LANDA PÅ NÄSTA AVFYRNINGSRAMP!"
    ],
    "sksp0394": [
      "TA DEN GULA ECON!"
    ],
    "sksp0395": [
      "SKJUT ROBOTEN, JAK!"
    ],
    "sksp0396": [
      "SKJUT HANS ARM!"
    ],
    "sksp0397": [
      "SKJUT HANS PISTOL!"
    ],
    "sksp0398": [
      "SKJUT HANS HUVUD!"
    ],
    "sksp0399": [
      "SE UPP FÖR SMÄLLEN!"
    ],
    "sksp0400": [
      "HAN LADDAR UPP!"
    ],
    "sksp0401": [
      "TA DEN BLÅA ECON!"
    ],
    "sksp0402": [
      "TA DEN RÖDA ECON!"
    ],
    "sksp0403": [
      "DET HÄR KÄNNS INTE BRA!"
    ],
    "sksp0404": [
      "ANVÄND AVFYRNINGSRAMPEN, FORT!"
    ],
    "sksp0405": [
      "NU HAR DU GJORT DJURET ARGT!"
    ],
    "sksp0406": [
      "VI KAN INTE RÖRA DOM HÄR!"
    ],
    "sksp0407": [
      "ANVÄND DEN GULA ECON!"
    ],
    "sksp0408": [
      "SKJUT DOM DÄR!"
    ],
    "sksp0409": [
      "TA DEN LJUSA ECON, JAK!"
    ],
    "sksp0410": [
      "HAN SER ARG UT!"
    ],
    "sksp0411": [
      "HOPPA UPP FÖR ATT UNDVIKA EXPLOSIONERNA!"
    ],
    "sksp0412": [
      "NU TAR VI HAND OM SAKEN!"
    ],
    "sksp0413": [
      "SNYGGT SKJUTANDE DÄR, PARTNER!"
    ],
    "sksp0414": [
      "DET DÄR GJORDE ONT PÅ HONOM!"
    ],
    "sksp0415": [
      "HÄR KOMMER HAN!"
    ],
    "sksp0416": [
      "JAPP! DU GJORDE DET!"
    ],
    "sksp0417": [
      "SÄG \"GONATT\", GOL OCH MAIA!"
    ],
    "sksp0435": [
      "VÄLT DOM DÄR BENEN!"
    ],
    "sksp0443": [
      "SLÅ DOM DÄR PÅLARNA UPP UNDERIFRÅN!"
    ],
    "sksp0444": [
      "VI VÄNTAR HÄR. HALLÅ?"
    ],
    "sksp0449": [
      "TRYCK PÅ START FÖR ATT SPELA."
    ],
    "sksp0450": [
      "VILL DU SLUTA SPELA?"
    ],
    "sksp0451": [
      "JAG TRODDE INTE DET."
    ],
    "sksp0452": [
      "OK, DÅ SES VI SENARE."
    ],
    "sksp0455": [
      "JÖSSES, VILKA ÄR ALLA DOM HÄR MÄNNISKORNA?"
    ],
    "sksp0466": [
      "JAG GJORDE BRA IFRÅN MIG. ELLER HUR, TJEJER?"
    ],
    "sksp0b42": [
      "SLUTA MISSA DOM DÄR GULA FISKARNA, DOM VÄGER FEM KILO STYCK!",
      "OCH DET ÄR EN HEL DEL FISK, JAK."
    ]
  },
  "speakers": {
    "???": "???",
    "BILLY": "BILLY",
    "BIRDWATCHER": "FÅGELSKÅDARE",
    "BLUE SAGE": "BLÅ VISMAN",
    "DAXTER": "DAXTER",
    "FARMER": "BONDE",
    "FISHERMAN": "FISKARE",
    "FLUT-FLUT": "FLUTT-FLUTT",
    "GAMBLER": "SPELARE",
    "GEOLOGIST": "GEOLOG",
    "GOL": "GOL",
    "GORDY": "GORDY",
    "JAK": "JAK",
    "JAK'S UNCLE": "JAKS FARBROR",
    "KEIRA": "KEIRA",
    "MAIA": "MAIA",
    "MAYOR": "BORGMÄSTARE",
    "MINER": "GRUVARBETARE",
    "OLD MAN": "GAMMAL MAN",
    "ORACLE": "ORAKEL",
    "RED SAGE": "RÖD VISMAN",
    "SAMOS": "SAMOS",
    "SCULPTOR": "SKULPTÖR",
    "WARRIOR": "KRIGARE",
    "WILLARD": "WILLARD",
    "WOMAN": "KVINNA",
    "YELLOW SAGE": "GUL VISMAN"
  }
}
