===
One Pair
===

(:hello

"world")

---

(:hello "world")

===
Not a Valid Constant
===

(:hello

(println "hello world"))

---

(:hello
 (println "hello world"))

===
Two Pairs
===

(:hello

"world" :test 123)

---

(:hello "world"
 :test 123)

===
Pair Mixture
===

(:hello

"world" "not-a-pair" :test 123)

---

(:hello "world"
 "not-a-pair"
 :test 123)
