===
Constant List
===

(1 2 3 4)

---

(1 2 3 4)

===
Constant List - Too Long to Inline
===

(1111111111111 2222222222222222 3333333333333333333333333 444444444444444444444444444 555555555555555555555555555555555 666666666666666666666666666666666666666)

---

(1111111111111
 2222222222222222
 3333333333333333333333333
 444444444444444444444444444
 555555555555555555555555555555555
 666666666666666666666666666666666666666)

===
Empty List
===

()

---

()

===
List of lists
===

(defpart 116
  :init-specs
  ((:scalevel-x (meters 0.006666667)) (:scalevel-y :copy scalevel-x)
                (:fade-a 0.0)
                (:next-time (seconds 0.5))
                (:next-launcher 117)))

---

(defpart 116
  :init-specs
  ((:scalevel-x (meters 0.006666667))
   (:scalevel-y :copy scalevel-x)
   (:fade-a 0.0)
   (:next-time (seconds 0.5))
   (:next-launcher 117)))


===
Another list of lists
===

((:texture (new 'static 'texture-id :index #x1e :page #x2)) (:num 1.0)
             (:scale-x (meters 0.5) (meters 0.6))
             (:rot-y (degrees 0) (degrees 360))
             (:scale-y :copy scale-x)
             (:r 128.0)
             (:g 128.0)
             (:b 128.0)
             (:a 64.0 64.0)
             (:scalevel-x (meters 0.0016666667) (meters 0.001))
             (:scalevel-y :copy scalevel-x)
             (:timer (seconds 2))
             (:flags (bit2 bit3 left-multiply-quat))
             (:next-time (seconds 0.5))
             (:next-launcher 109))

---

((:texture (new 'static 'texture-id :index #x1e :page #x2))
 (:num 1.0)
 (:scale-x (meters 0.5) (meters 0.6))
 (:rot-y (degrees 0) (degrees 360))
 (:scale-y :copy scale-x)
 (:r 128.0)
 (:g 128.0)
 (:b 128.0)
 (:a 64.0 64.0)
 (:scalevel-x (meters 0.0016666667) (meters 0.001))
 (:scalevel-y :copy scalevel-x)
 (:timer (seconds 2))
 (:flags (bit2 bit3 left-multiply-quat))
 (:next-time (seconds 0.5))
 (:next-launcher 109))

===
Retain quoted empty lists
===

(or (= '() lst))

---

(or (= '() lst))

===
Quasi-quoted unquoted List
===

`,(something here)

---

`,(something here)

===
Empty Quoted List
===

'()

---

'()

===
Non-empty Quoted List
===

'(1 2 3)

---

'(1 2 3)

===
Non-empty Quoted List with quoted symbols inside
===

'('3)

---

'('3)