===
Quoted Symbols
===

(new 'static 'sound-id)

---

(new 'static 'sound-id)

===
Unquote Splicing
===

,@(apply (lambda (x) `(,x :class vf)) regs)

---

,@(apply (lambda (x) `(,x :class vf)) regs)

===
Numbers at the start of symbols
===

(4x3 #x12a)

---

(4x3 #x12a)

===
Numbers and operators in symbol
===

vector-rad<-vector-deg/2!

---

vector-rad<-vector-deg/2!

===
Double Quoted Symbols
===

''something

---

''something
